#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника.
//  ТабличныеЧасти - Структура - Ключ - Имя табличной части объекта.
//                               Значение - Выгрузка в таблицу значений пустой табличной части.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();	    
	
	Элемент = Элементы.Добавить(); 
	Элемент.ИмяПредопределенныхДанных = "БизнесПараметры";
	Элемент.Наименование = НСтр("ru = 'Бизнес параметры';
								|en = 'Business settings'", КодОсновногоЯзыка);  
	
	Элемент = Элементы.Добавить(); 
	Элемент.ИмяПредопределенныхДанных = "КонтекстныеОтчеты";
	Элемент.Наименование = НСтр("ru = 'Контекстные отчеты';
								|en = 'Users reports'", КодОсновногоЯзыка);  
	
	Элемент = Элементы.Добавить(); 
	Элемент.ИмяПредопределенныхДанных = "КонтрольИзменения";
	Элемент.Наименование = НСтр("ru = 'Контроль изменения';
								|en = 'Users conrol'", КодОсновногоЯзыка);

КонецПроцедуры

#КонецОбласти   

#КонецЕсли



