#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив Из Строка - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника.
//  ТабличныеЧасти - Структура - Ключ - Имя табличной части объекта.
//                               Значение - Выгрузка в таблицу значений пустой табличной части.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();	    
	
	Элемент = Элементы.Добавить(); 
	Элемент.ИмяПредопределенныхДанных = "ЗначенияПоУмолчанию";
	Элемент.Наименование = НСтр("ru = 'Значения по умолчанию'", КодОсновногоЯзыка);  	

КонецПроцедуры

#КонецОбласти   

#КонецЕсли



