#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если НЕ (ЗначениеЗаполнено(ТипЗначения1) ИЛИ ЗначениеЗаполнено(ТипЗначения2) ИЛИ ЗначениеЗаполнено(ТипЗначения3) 
			ИЛИ ЗначениеЗаполнено(ТипЗначения4) ИЛИ ЗначениеЗаполнено(ТипЗначения5) 
				ИЛИ ЗначениеЗаполнено(ИмяФормыЗаполненияХранилища)) Тогда
				
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не определена полезная информация по разделу'"),,,, Отказ);
				
	КонецЕсли;	
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли; 
	
КонецПроцедуры
	
#КонецОбласти  
	
#КонецЕсли

 
 
  
