#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает данные из правила
//
// Параметры:
//  Правило		 - СправочникСсылка	 - правило инициализации данных
//  Группировать - Булево			- признак группировкки данных в возвращаемой структуре
// 
// Возвращаемое значение:
//   - Структура - результат
//
Функция ВыполнитьПравило(Правило, Группировать = Истина) Экспорт
	
	Результат = Новый Структура;
	
	Если ЗначениеЗаполнено(Правило) Тогда  		
		
		ДанныеПравил 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Правило, "ХранилищеРеквизитов, ХранилищеТаблиц");
		ДанныеРеквизитов 	= ДанныеПравил.ХранилищеРеквизитов.Получить();   
		ДанныеТаблиц		= ДанныеПравил.ХранилищеТаблиц.Получить();
		
		Если Группировать Тогда
			Результат.Вставить("Реквизиты", ДанныеРеквизитов); 
			Результат.Вставить("Таблицы", ДанныеТаблиц);	 
		Иначе
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Результат, ДанныеРеквизитов);
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Результат, ДанныеТаблиц, Истина);
		КонецЕсли;		
		   		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли