#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.рнсШаблонНабораДанных") Тогда 	
		Шаблон = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
		ХранилищеРеквизитов = Неопределено;
		ХранилищеТаблиц = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти  

#КонецЕсли
