#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОграничениеТипаЗначенияСвойства();  	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	 
	УстановитьОграничениеТипаЗначенияСвойства();		 
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОграничениеТипаЗначенияСвойства()  		
	
	ОграничениеТипа = Метаданные.ПланыВидовХарактеристик.рнсТипыРасширенныхНастроек.Тип;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПравил.ТипЗначения.ТипЗначения КАК ТипЗначения,
		|	ТаблицаПравил.ТипЗначения КАК ТипСвойства
		|ИЗ
		|	Справочник.рнсПравилаПолученияДанныхИБ КАК ТаблицаПравил
		|ГДЕ
		|	ТаблицаПравил.Ссылка = &Ссылка
		|	И ТаблицаПравил.ТипЗначения <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.рнсТипыРасширенныхНастроек.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Запись.Правило);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	 	ВыборкаДетальныеЗаписи.Следующий(); 		
		
		ТипСвойства = ВыборкаДетальныеЗаписи.ТипСвойства;
		ОграничениеТипа = ВыборкаДетальныеЗаписи.ТипЗначения; 	
		
	КонецЕсли;	
	
	Элементы.ЗначениеСвойства.ОграничениеТипа = ОграничениеТипа;
	
КонецПроцедуры

#КонецОбласти










