#Область ПрограммныйИнтерфейс

#Область СхемаКомпоновкиДанных

// Проверяет можно ли выполнить схему,выполнив ее запрос
//
// Параметры:
//  Схема		 - СхемаКомпоновкиДанных	 	 - схема
//  Настройки	 - НастройкиКомпоновкиДанных	 - настройки
// 
// Возвращаемое значение:
//   - Булево - Ложь - схема простая
//
Функция ЭтоСложнаяСхема(Схема, Настройки = Неопределено) Экспорт
	
	Результат 	= Истина; 			
	Наборы 		= Схема.НаборыДанных;
	
	Если Настройки = Неопределено Тогда
		НастройкиСКД = Схема.НастройкиПоУмолчанию;		
	Иначе  		
		НастройкиСКД = Настройки;			
	КонецЕсли; 
	
	Если Наборы.Количество() = 1 И ТипЗнч(Наборы[0]) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
		
		РасчетныеПоляКомпоновки = Новый Массив;
		
		Для каждого Ит Из Схема.ВычисляемыеПоля Цикл
			РасчетныеПоляКомпоновки.Добавить(Новый ПолеКомпоновкиДанных(Ит.ПутьКДанным));			
		КонецЦикла; 		
		
		Для каждого Ит Из НастройкиСКД.ПользовательскиеПоля.Элементы Цикл
			РасчетныеПоляКомпоновки.Добавить(Новый ПолеКомпоновкиДанных(Ит.ПутьКДанным));			
		КонецЦикла; 		
		
		Если ЕстьПолеКомпоновкиВКоллекции(НастройкиСКД.Выбор.Элементы, РасчетныеПоляКомпоновки) Тогда
			Возврат Истина;	
		КонецЕсли; 
		
		Если ЕстьПолеКомпоновкиВКоллекции(НастройкиСКД.Отбор.Элементы, РасчетныеПоляКомпоновки) Тогда
			Возврат Истина;	
		КонецЕсли;			 	 
			
		Результат = ЕстьПоляКомпоновкиВСтруктуре(НастройкиСКД.Структура, РасчетныеПоляКомпоновки);
		
	КонецЕсли; 		 
	
	Возврат Результат;
	
КонецФункции 

// Выполняет поиск элементов компоновки в полях выбора, отборах, группировках
//
// Параметры:
//  КоллекцияПолей			 - КоллекцияЭлементов	 - коллекция элементов выбора, отбора, структуры
//  ИскомыеПоляКомпоновки	 - Массив	 - список ПолеКомпоновкиДанных
// 
// Возвращаемое значение:
//   - Булево - Истина - указанные элементы присутствуют
//
Функция ЕстьПолеКомпоновкиВКоллекции(КоллекцияПолей, ИскомыеПоляКомпоновки) Экспорт
	
	Результат = Ложь;
	
	Для каждого Элемент Из КоллекцияПолей Цикл
		
		Если Элемент.Использование Тогда 			
			
			ТипЭлемента = ТипЗнч(Элемент);
			
			Если ТипЭлемента = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
				Если ИскомыеПоляКомпоновки.Найти(Элемент.Поле) <> Неопределено Тогда
					Возврат Истина;	
				КонецЕсли; 	
			ИначеЕсли ТипЭлемента = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда 	
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли; 
			ИначеЕсли ТипЭлемента = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				 				
				Если ИскомыеПоляКомпоновки.Найти(Элемент.ЛевоеЗначение) <> Неопределено Тогда
					Возврат Истина;	
				КонецЕсли;
				
				Если ТипЗнч(Элемент.ПравоеЗначение) = ТипЗнч("ПолеКомпоновкиДанных") Тогда
					Если ИскомыеПоляКомпоновки.Найти(Элемент.ЛевоеЗначение) <> Неопределено Тогда
						Возврат Истина;	
					КонецЕсли;	
				КонецЕсли;  				
				
			ИначеЕсли ТипЭлемента = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда 			
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;				
			ИначеЕсли ТипЭлемента = Тип("ПолеГруппировкиКомпоновкиДанных") Тогда			
				Если ИскомыеПоляКомпоновки.Найти(Элемент.Поле) <> Неопределено Тогда
					Возврат Истина;	
				КонецЕсли;				 	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 	 
	
	Возврат Результат;
	
КонецФункции
 
// Выполняет поиск элементов компоновки в структуре
//
// Параметры:
//  ЭлементыСтруктуры		 - КоллекцияЭлементовСтруктуры - структура из настроек
//  ИскомыеПоляКомпоновки	 - Массив	 -  список ПолеКомпоновкиДанных
// 
// Возвращаемое значение:
//   - Булево - Истина - указанные элементы присутствуют
//
Функция ЕстьПоляКомпоновкиВСтруктуре(ЭлементыСтруктуры, ИскомыеПоляКомпоновки) Экспорт
	
	Результат = Ложь;	
	
	Для каждого Элемент Из ЭлементыСтруктуры Цикл
		
		Если Элемент.Использование Тогда 		 
		
			Если ТипЗнч(Элемент) = Тип("ГруппировкаКомпоновкиДанных") Тогда 			 			 
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Выбор.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли; 
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Отбор.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.ПоляГруппировки.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;
				
				Если ЕстьПоляКомпоновкиВСтруктуре(Элемент.Структура, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли; 				
				
			ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаКомпоновкиДанных") Тогда 
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Выбор.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;
				
				Если ЕстьПоляКомпоновкиВСтруктуре(Элемент.Колонки, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;
				
				Если ЕстьПоляКомпоновкиВСтруктуре(Элемент.Строки, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда 	
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Выбор.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли; 
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Отбор.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;	 
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.ПоляГруппировки.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;	
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Структура, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Элемент) = Тип("ДиаграммаКомпоновкиДанных") Тогда
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Выбор.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;
				
				Если ЕстьПоляКомпоновкиВСтруктуре(Элемент.Серии, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;
				
				Если ЕстьПоляКомпоновкиВСтруктуре(Элемент.Точки, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда 	
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Выбор.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли; 
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Отбор.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;	 
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.ПоляГруппировки.Элементы, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;
				
				Если ЕстьПолеКомпоновкиВКоллекции(Элемент.Структура, ИскомыеПоляКомпоновки) Тогда
					Возврат Истина;	
				КонецЕсли;   
				
			ИначеЕсли ТипЗнч(Элемент) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
				
			КонецЕсли; 
		
		КонецЕсли;
		
	КонецЦикла; 	
	
	Возврат Результат;
	
КонецФункции    

// Проверяет наличии иерархии в структура настройки схемы компоновки
//
// Параметры:
//  НастройкиКомпоновки	 - 	НастройкиКомпоновки	 - исходные настройки 
// 
// Возвращаемое значение:
//   - Булево - Истина - есть иерархии
//
Функция ЕстьИерархияВывода(НастройкиКомпоновки) Экспорт
	
	Результат = Ложь;
	
	Если НастройкиКомпоновки.Структура.Количество() > 1 Тогда
		Результат = Истина;	
	Иначе   		
		
		Элемент = НастройкиКомпоновки.Структура[0];
		
		Если ТипЗнч(Элемент) = Тип("ГруппировкаКомпоновкиДанных") Тогда   				
			Если Элемент.Структура.Количество() > 0 Тогда
				Результат = Истина;						
			КонецЕсли;							
		КонецЕсли; 
		
	КонецЕсли; 	
	
	Возврат Результат;
	
КонецФункции

// Очищает подчиненные элементы структуры
//
// Параметры:
//  НастройкиКомпоновкиДанных	 - НастройкиКомпоновки	 - исходные настройки 
//  НомерЭлементаСтруктуры		 - Число	 -  номер оставляемой группировки 
//
Процедура ПривестиСтруктуруКПлоскойТаблице(НастройкиКомпоновкиДанных, НомерЭлементаСтруктуры = -1) Экспорт
	
	СтруктураОтчета = НастройкиКомпоновкиДанных.Структура;
	
	Если НомерЭлементаСтруктуры = -1 Тогда
		
		СтруктураОтчета.Очистить();
		
		ГКД = СтруктураОтчета.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ГКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ГКД.Использование = Истина;	
		
	Иначе
		
		ЭлементыКУдалению = Новый Массив;
		
		Для Сч = 0 По СтруктураОтчета.Количество() - 1 Цикл
			
			ЭлементСтруктуры = СтруктураОтчета[Сч];
			
			Если Сч = НомерЭлементаСтруктуры Тогда
				
				Если ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") Тогда 				 
					ЭлементСтруктуры.Структура.Очистить(); 	
				ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
					ЭлементСтруктуры.Строки.Очистить();			
				КонецЕсли;					
			Иначе
				ЭлементыКУдалению.Добавить(ЭлементСтруктуры);		
			КонецЕсли; 	
			
		КонецЦикла;	
		
		Для каждого Ит Из ЭлементыКУдалению Цикл
			СтруктураОтчета.Элементы.Удалить(Ит);	
		КонецЦикла; 
		
	КонецЕсли;	
	
КонецПроцедуры  

// Помещает результат таблицы, полученный после выполнения схемы в таблицу
//
// Параметры:
//  Таблица				 - ТаблицаЗначений	 - исходная таблица
//  ИмяВТ				 - Строка			 - имя временной таблицы
//  ИменаКолонок		 - Строка			 - имена колонок
//  МенеджерВТ			 - МенеджерВТ		 - менеджер временных таблиц
//  ИмяПрефиксКолонки	 - Строка			 - префикс для определения пользовательских полей
// 
// Возвращаемое значение:
//   - МенеджерВременныхТаблиц - менеджер с таблицей
//
Функция ТаблицаВМенеджерВТ(Таблица, ИмяВТ, ИменаКолонок = "",  МенеджерВТ = Неопределено, ИмяПрефиксКолонки = "ПользовательскиеПоляПоле") Экспорт
	                     	
	Результат 		= ?(МенеджерВТ = Неопределено, Новый МенеджерВременныхТаблиц, МенеджерВТ);
	МассивИмен 		= СтрРазделить(ИменаКолонок, ",", Ложь);
	КолонкиТаблицы 	= Таблица.Колонки;
	
	Для Сч = 0 По МассивИмен.ВГраница() Цикл 		
		
		Если ИмяПрефиксКолонки = "ПользовательскиеПоляПоле" Тогда
			ИмяИзменяемойКолонки = ИмяПрефиксКолонки + Формат(Сч + 1, "ЧЦ=10; ЧГ=0");
		Иначе
			ИмяИзменяемойКолонки = ИмяПрефиксКолонки + ?(Сч = 0, "", Формат(Сч, "ЧЦ=10; ЧГ=0"));		
		КонецЕсли; 
		           		
		Колонка = КолонкиТаблицы.Найти(ИмяИзменяемойКолонки);	
		Если Колонка <> Неопределено Тогда
			Колонка.Имя = МассивИмен[Сч];	
		КонецЕсли;		
				
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Результат;
	Запрос.Текст = "ВЫБРАТЬ
	| *
	|ПОМЕСТИТЬ " + ИмяВТ + "
	| ИЗ &Таблица КАК Таблица";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.Выполнить(); 
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие используемых параметров настроек компоновки данных
//
// Параметры:
//  СхемаНастройки	 - СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных	 - проверяемая схема или настройки
// 
// Возвращаемое значение:
//   - Булево - результат проверки, при отсутствии параметров возвращает Истина
//
Функция ЕстьОбязательныеПараметры(СхемаНастройки) Экспорт
	
	Результат = Ложь;
	
	НастройкиКомпоновки = ?(ТипЗнч(СхемаНастройки) = Тип("СхемаКомпоновкиДанных"), СхемаНастройки.НастройкиПоУмолчанию, СхемаНастройки);
	КоллекцияПараметров = НастройкиКомпоновки.ПараметрыДанных.Элементы;
	
	Если КоллекцияПараметров.Количество() > 0 Тогда
		Для каждого Ит Из КоллекцияПараметров Цикл
			Если Ит.Использование Тогда
				Возврат Истина;	
			КонецЕсли;	
		КонецЦикла;	  
	Иначе
		Результат = Истина;		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Копирует значения параметров из одних настоек компоновки в другую
//
// Параметры:
//  Приемник		 - НастройкиКомпоновкиДанных	 - настройки для заполнения параметров 
//  Источник		 - НастройкиКомпоновкиДанных	 - настройки источник параметров
//  СписокПараметров - Массив	 - массив имен параметров
//
Процедура УстановитьПараметрыДанныхКопированием(Приемник, Источник, СписокПараметров = Неопределено) Экспорт

	Для каждого Ит Из Приемник.ПараметрыДанных.Элементы Цикл
		Если ТипЗнч(Ит) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
			Для каждого СтрокаПараметра Из Источник.ПараметрыДанных.Элементы Цикл
				Если СтрокаПараметра.Параметр = Ит.Параметр Тогда  
					Ит.Значение 		= СтрокаПараметра.Значение;
					Ит.Использование 	= Истина;		
				КонецЕсли;		
			КонецЦикла;		
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры   

// Копирует отборы из одной коллекции отборов в другую
//
// Параметры:
//  Приемник	 - ОтборКомпоновкиДанных	 - коллекция отборов, куда будут скопированы отборы источника 
//  Источник	 - ОтборКомпоновкиДанных	 - коллекция отборов источник копирования
//  СписокПолей	 - Строка	 - строка из имен полей через запятую
//
Функция УстановитьОтборыКопированием(Приемник, Источник, СписокПолей = Неопределено) Экспорт
	
	Результат 			= 0;
	ТипЭлементаОтбора 	= Тип("ЭлементОтбораКомпоновкиДанных");
	ЭлементыПриемника 	= Приемник.Элементы; 
	ПоляКомпоновки  	= Новый Массив; 
	МассивИменПолей 	= СтрРазделить(СписокПолей, ",", Ложь);    
	
	Для каждого Ит Из МассивИменПолей Цикл
		ПоляКомпоновки.Добавить(Новый ПолеКомпоновкиДанных(Ит));			
	КонецЦикла;  
	
	Для каждого Ит Из Источник.Элементы Цикл
		Если ТипЗнч(Ит) = ТипЭлементаОтбора Тогда     
			Если СписокПолей = Неопределено ИЛИ ПоляКомпоновки.Найти(Ит.ЛевоеЗначение) <> Неопределено Тогда
				
				ЗаполнитьЗначенияСвойств(ЭлементыПриемника.Добавить(ТипЭлементаОтбора), Ит); 
				
				Результат = Результат + 1;  
				
			КонецЕсли;	
		Иначе	
			
			Количество = УстановитьОтборыКопированием(Приемник, Ит, СписокПолей);			
			Если Количество > 0 Тогда
					
			КонецЕсли;
			
		КонецЕсли;	
	КонецЦикла;  
	
	Возврат Результат;	
	
КонецФункции    

#КонецОбласти 

// Возвращает значение реквизита элемента на указанном уровне иерархии
//
// Параметры:
//  ОбъектИБ			 - СправочникСсылка	 - элемент справочники с иерархией
//  Уровень				 - Число	 - уровень иерархии 
//  ИмяРеквизитаЗначения - Строка	 - имя реквизита
//  ЗначениеПоУмолчанию	 - Произвольный	 - значение по умолчанию
// 
// Возвращаемое значение:
//   - Произвольный - значение реквизита
//
Функция ЗначениеРеквизитаПоИерархии(ОбъектИБ, Знач Уровень = 0, Знач ИмяРеквизитаЗначения = "ТекущийРуководитель", Знач ЗначениеПоУмолчанию = Неопределено) Экспорт
	              		
	Значение	= Неопределено;
	ТекЭлемент 	= ОбъектИБ;
	
	Пока НЕ ЗначениеЗаполнено(Значение) И ЗначениеЗаполнено(ТекЭлемент) Цикл
		
		Реквизиты 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекЭлемент, "Родитель, " + ИмяРеквизитаЗначения);
		Значение 	= Реквизиты[ИмяРеквизитаЗначения];
		ТекЭлемент 	= Реквизиты.Родитель;
		
		Если ЗначениеЗаполнено(Значение) Тогда
			Если Уровень <> 0 Тогда
				Уровень 	= Уровень - 1;	
				Значение 	= Неопределено;
			КонецЕсли; 	
		КонецЕсли; 			
		
	КонецЦикла;		
	
	Возврат ?(ЗначениеЗаполнено(Значение), Значение, ЗначениеПоУмолчанию);
	
КонецФункции 

// Добавляет к тесту запроса текст помещения во временную таблицу
//
// Параметры:
//  ТекстЗапроса - Строка	 - исходный текст запроса 
//  ИмяВТ		 - Строка	 - имя временной таблицы
//  НомерЗапроса - Число	 - номер запроса в пакете 
// 
// Возвращаемое значение:
//   - Строка - текст запроса
//
Функция ЗапросВоВременнуюТаблицу(ТекстЗапроса, ИмяВТ, НомерЗапроса = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИмяВТ) Тогда
		Возврат ТекстЗапроса;	
	КонецЕсли; 
	
	СЗ = Новый СхемаЗапроса();
	СЗ.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Если НомерЗапроса = Неопределено Тогда
		Пакет = СЗ.ПакетЗапросов[СЗ.ПакетЗапросов.Количество() - 1];			
	Иначе
		Пакет = СЗ.ПакетЗапросов[НомерЗапроса];	
	КонецЕсли; 
	
	Если ТипЗнч(Пакет) = Тип("ЗапросВыбораСхемыЗапроса") Тогда
		Пакет.ТаблицаДляПомещения = ИмяВТ;
	КонецЕсли; 
	
	Возврат СЗ.ПолучитьТекстЗапроса() + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

// Проверка символа строки
//
// Параметры:
//  Код				 - Число	 - код символа
//  ЭтоПервыйСимвол	 - 	Булево - признак первого символа 
// 
// Возвращаемое значение:
//   - Булево - истина, если строка удовлетворяет идентификатору
//
Функция СимволУдовлетворяетТребованиюИдентификатора(Код, ЭтоПервыйСимвол = Ложь) Экспорт
	
	НачКодЦифры 		= КодСимвола("0");
	КонКодЦифры 		= КодСимвола("9");   	
	НачКодАнглБуквВР 	= КодСимвола("A");
	КонКодАнглБуквВР 	= КодСимвола("Z");  	
	НачКодАнглБуквНР 	= КодСимвола("a");
	КонКодАнглБуквНР 	= КодСимвола("z");  	
	НачКодРусБуквВР 	= КодСимвола("А");
	КонКодРусБуквВР 	= КодСимвола("Я");  	
	НачКодРусБуквНР 	= КодСимвола("а");
	КонКодРусБуквНР 	= КодСимвола("я");  
	КодСимвола_			= КодСимвола("_");
	
	Возврат (Код >= НачКодАнглБуквВР И Код <= КонКодАнглБуквВР)	ИЛИ (Код >= НачКодАнглБуквНР И Код <= КонКодАнглБуквНР)
				ИЛИ (Код >= НачКодРусБуквВР И Код <= КонКодРусБуквВР) ИЛИ (Код >= НачКодРусБуквНР И Код <= КонКодРусБуквНР)
				ИЛИ Код = КодСимвола_ ИЛИ ?(ЭтоПервыйСимвол, Ложь, Код >= НачКодЦифры И Код <= КонКодЦифры);
	
КонецФункции

#КонецОбласти 



 


