#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует запрос для выборки настроек из регистра общих настроек с возможностью фильтрации по разделу, секции и ключу.
//
// Параметры:
//   Раздел - СправочникСсылка.рнсРазделыОбщихНастроек - раздел настроек
//   Секция - Строка - секция раздела настроек
//           - Неопределено
//   ОписаниеКлюча - Структура - параметры для отбора по полям ключа настроек
//                 - СправочникСсылка.рнсКлючиОбщихНастроек - ссылка на ключ настройки
//                 - Строка - наименование ключа настройки
//                 - Неопределено
//   Дополнительно - Структура - дополнительные параметры формирования запроса:
//                     * Колонки - Число - битовая маска выбора колонок (1 - раздел, 2 - секция, 4 - поля ключа)
//                     * ИмяВременнойТаблицы - Строка - имя временной таблицы для помещения результата
//                     * Первые1 - Булево - признак ограничения выборки одной записью
//
// Возвращаемое значение:
//   Запрос - сформированный запрос для выборки настроек
Функция ЗапросОбщиеНастройки(Раздел, Секция = Неопределено, ОписаниеКлюча = Неопределено, Дополнительно = Неопределено) Экспорт
	
	Результат 						= Новый Запрос;  
	ОтборПоПолямКлюча				= Ложь; 
	ОтборПоКлючу					= Ложь;	
	КоличествоПолейКлюча 			= 0;  
	ДополнительныеПараметры			= Новый Структура("Колонки, ИмяВременнойТаблицы, Первые1", 7, Неопределено, Ложь);  
	МассивОтборов					= Новый Массив; 
	МассивСоединений				= Новый Массив; 
	МассивКолонокВыбор 				= Новый Массив;	
	ШаблонВыборКолонки 				= "ТаблицаНастроек.%1 КАК %1";    
	ШаблонВыборПолеКлюча 			= "ТаблицаПолейКлюча%1.Значение КАК %2";
	ШаблонОтбора					= "ТаблицаПолейКлюча%1.Значение = &ЗначениеОтбора%1"; 
	ШаблонСоединения				= "ЛЕВОЕ СОЕДИНЕНИЕ Справочник.рнсКлючиОбщихНастроек.ЗначенияКлюча КАК ТаблицаПолейКлюча%1
										|		ПО ТаблицаНастроек.Ключ = ТаблицаПолейКлюча%1.Ссылка
										|			И (ТаблицаПолейКлюча%1.НомерСтроки = %1)"; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ТекстЗапросаВыбор
	|ПОМЕСТИТЬ Вт_Настройки
	|ИЗ
	|	РегистрСведений.рнсОбщиеНастройки КАК ТаблицаНастроек
	|		&ТекстСоеднинений
	|ГДЕ
	|	НЕ ТаблицаНастроек.Отключено
	|	И ТаблицаНастроек.Раздел = &Раздел 	
	|	И &ТекстОтбора";	
	
	Если ЗначениеЗаполнено(ОписаниеКлюча) Тогда
		Если ТипЗнч(ОписаниеКлюча) = Тип("Структура") Тогда 
			ОтборПоПолямКлюча = Истина;
		Иначе 
			ОтборПоКлючу = Истина;		
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Дополнительно)  Тогда
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, Дополнительно);	
	КонецЕсли; 	 	
	
	Запрос = Новый Запрос;
	Запрос.Текст =  ТекстЗапросаРаздела();		
	
	Запрос.УстановитьПараметр("ПустойТипЗначения", ПланыВидовХарактеристик.рнсТипыРасширенныхНастроек.ПустаяСсылка());
	Запрос.УстановитьПараметр("Раздел", Раздел);
	
	РезультатЗапроса 	= Запрос.Выполнить(); 
	ВыборкаРаздел 		= РезультатЗапроса.Выбрать();
	
	ВыборкаРаздел.Следующий(); 
	
	КолонкаРаздел 		= ПроверитьБит(ДополнительныеПараметры.Колонки, 0); 
	КолонкаСекция 		= ПроверитьБит(ДополнительныеПараметры.Колонки, 1) И ВыборкаРаздел.ИспользоватьСекцииРаздела; 
	КолонкаПоляКлюча 	= ПроверитьБит(ДополнительныеПараметры.Колонки, 2) И ВыборкаРаздел.ИспользоватьКлючНастройки;
	КолонкаХранилище	= ВыборкаРаздел.ИспользуетсяХранилищеЗначения;
		
	Если ВыборкаРаздел.ИспользоватьКлючНастройки Тогда
		
		Выборка = ВыборкаРаздел.НастройкаКлюча.Выбрать();
		
		Пока Выборка.Следующий() Цикл			
			
			НПП 				= Выборка.НомерСтроки; 			 
			Идентификатор 		= Выборка.Идентификатор;  
			ЗначениеОтбора		= Неопределено;
			ЕстьОтбор 			= Ложь;
			
			Если ОтборПоПолямКлюча Тогда 				
				Если ЗначениеЗаполнено(Выборка.Идентификатор) И ОписаниеКлюча.Свойство(Выборка.Идентификатор, ЗначениеОтбора) Тогда 					
					ЕстьОтбор = Истина;  					
					Результат.УстановитьПараметр("ЗначениеОтбора" + НПП, ЗначениеОтбора); 
					МассивОтборов.Добавить(СтрШаблон(ШаблонОтбора, НПП));
				КонецЕсли;    			
			КонецЕсли; 	
			
			Если КолонкаПоляКлюча Тогда 		
				Псевдоним = ?(ЗначениеЗаполнено(Идентификатор), Идентификатор, "ПолеКлюча" + НПП);
				МассивКолонокВыбор.Добавить(СтрШаблон(ШаблонВыборПолеКлюча, НПП, Псевдоним));				
			КонецЕсли;  
			
			Если КолонкаПоляКлюча ИЛИ ЕстьОтбор Тогда
				МассивСоединений.Добавить(СтрШаблон(ШаблонСоединения, НПП));	
			КонецЕсли;
			
			КоличествоПолейКлюча = КоличествоПолейКлюча + 1; 			
			
		КонецЦикла;
		
	КонецЕсли;		
	
	Если КолонкаРаздел Тогда
		МассивКолонокВыбор.Добавить(СтрШаблон(ШаблонВыборКолонки, "Раздел"));		
	КонецЕсли; 
	
	Если КолонкаСекция Тогда
		МассивКолонокВыбор.Добавить(СтрШаблон(ШаблонВыборКолонки, "Секция"));	
	КонецЕсли; 	
	
	Если КолонкаПоляКлюча Тогда 
		
		МассивКолонокВыбор.Добавить("ТаблицаНастроек.Ключ КАК Ключ");  	
		
		Если КоличествоПолейКлюча = 0 Тогда 		
			МассивКолонокВыбор.Добавить("ПРЕДСТАВЛЕНИЕ(ТаблицаНастроек.Ключ) КАК ПредставлениеКлюча");
		КонецЕсли; 
		
	КонецЕсли;
	
	Для Сч = 1 По 5 Цикл
		Если ВыборкаРаздел["ЕстьЗначение" + Сч] Тогда
			МассивКолонокВыбор.Добавить(СтрШаблон(ШаблонВыборКолонки, "Значение" + Сч));	
		КонецЕсли;	
	КонецЦикла; 	
	
	Если КолонкаХранилище Тогда
		МассивКолонокВыбор.Добавить(СтрШаблон(ШаблонВыборКолонки, "Настройки"));	
	КонецЕсли;  	 	
	
	Если ЗначениеЗаполнено(Секция) И ВыборкаРаздел.ИспользоватьСекцииРаздела Тогда	
		МассивОтборов.Добавить("ТаблицаНастроек.Секция = &Секция"); 
		Результат.УстановитьПараметр("Секция", Секция);
	КонецЕсли;    
	
	Если ОтборПоКлючу Тогда
		
		Если ТипЗнч(ОписаниеКлюча) = Тип("СправочникСсылка.рнсКлючиОбщихНастроек") Тогда
			МассивОтборов.Добавить("ТаблицаНастроек.Ключ = &Ключ");	
			ЗначениеКлюча = ОписаниеКлюча;
		Иначе
			МассивОтборов.Добавить("ТаблицаНастроек.Ключ.Наименование = &Ключ");
			ЗначениеКлюча = Строка(ОписаниеКлюча);
		КонецЕсли;
		
		Результат.УстановитьПараметр("Ключ", ЗначениеКлюча);
		
	КонецЕсли;	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаВыбор", СтрСоединить(МассивКолонокВыбор, ", " + Символы.ПС));
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.ИмяВременнойТаблицы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Вт_Настройки", ДополнительныеПараметры.ИмяВременнойТаблицы);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ Вт_Настройки", "");	
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(МассивСоединений) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстСоеднинений", СтрСоединить(МассивСоединений, Символы.ПС));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстСоеднинений", "");	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(МассивОтборов) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстОтбора", СтрСоединить(МассивОтборов, Символы.ПС + " И "));
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстОтбора", "ИСТИНА");	
	КонецЕсли;  	
	
	Результат.Текст = ТекстЗапроса;   
	
	Результат.УстановитьПараметр("Раздел", Раздел);	  
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаРаздела()
	
	Результат = "ВЫБРАТЬ
		|	рнсРазделыОбщихНастроек.ИспользоватьСекцииРаздела КАК ИспользоватьСекцииРаздела,
		|	рнсРазделыОбщихНастроек.ИспользоватьКлючНастройки КАК ИспользоватьКлючНастройки,
		|	рнсРазделыОбщихНастроек.ИмяФормыЗаполненияХранилища <> """" КАК ИспользуетсяХранилищеЗначения,
		|	рнсРазделыОбщихНастроек.ТипЗначения1 <> &ПустойТипЗначения КАК ЕстьЗначение1,
		|	рнсРазделыОбщихНастроек.ТипЗначения2 <> &ПустойТипЗначения КАК ЕстьЗначение2,
		|	рнсРазделыОбщихНастроек.ТипЗначения3 <> &ПустойТипЗначения КАК ЕстьЗначение3,
		|	рнсРазделыОбщихНастроек.ТипЗначения4 <> &ПустойТипЗначения КАК ЕстьЗначение4,
		|	рнсРазделыОбщихНастроек.ТипЗначения5 <> &ПустойТипЗначения КАК ЕстьЗначение5,
		|	рнсРазделыОбщихНастроек.НастройкаКлюча.(
		|		ПолеКлюча КАК ПолеКлюча,
		|		ПолеКлюча.ТипЗначения КАК ТипЗначения,
		|		НомерСтроки КАК НомерСтроки,
		|		ПолеКлюча.Идентификатор КАК Идентификатор
		|	) КАК НастройкаКлюча
		|ИЗ
		|	Справочник.рнсРазделыОбщихНастроек КАК рнсРазделыОбщихНастроек
		|ГДЕ
		|	рнсРазделыОбщихНастроек.Ссылка = &Раздел";
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли