#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
		       	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда   
		Элементы.Код.Доступность = Истина;	
	Иначе	
		
		Элементы.НомерФиксированногоЗапросаВПакете.Видимость 			= Ложь; 
		Элементы.НомерФиксированногоЗапросаВПакете.МаксимальноеЗначение = 0;
		
		АдресСКД 			= ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);	
		АдресНастроекСКД 	= Неопределено;		
			
	КонецЕсли;         
	
	Элементы.ГруппаПараметрыРаботыПоСписку.Видимость 	= Объект.РежимРаботы = 1;   
	
	Если Метаданные.ОбщиеФормы.Найти("УпрощеннаяНастройкаСхемыКомпоновкиДанных") = Неопределено Тогда  
		ДоступнаФормаРедактированияСКД 					= Ложь;
		Элементы.РедактироватьЗагрузитьСхему.Заголовок  = НСтр("ru = 'Загрузить схему'");
	Иначе
		ДоступнаФормаРедактированияСКД 					= Истина; 
		Элементы.РедактироватьЗагрузитьСхему.Заголовок  = НСтр("ru = 'Редактировать'");
	КонецЕсли;     	  
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДанныеСхемы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "СхемаКомпоновкиДанных, ХранилищеНастроекКомпоновкиДанных");	
	Схема 		= ДанныеСхемы.СхемаКомпоновкиДанных.Получить();
	Настройки 	= ДанныеСхемы.ХранилищеНастроекКомпоновкиДанных.Получить();	
	АдресСКД 	= ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор);
	
	Если Схема <> Неопределено Тогда
		
		НастроитьФормуПоСхемеКомпоновки(Схема, Схема.НастройкиПоУмолчанию); 
		
		Если Настройки <> Неопределено Тогда
			АдресНастроекСКД = ПоместитьВоВременноеХранилище(Настройки, Новый УникальныйИдентификатор);
		КонецЕсли;
		
	КонецЕсли; 		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастройитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Модифицированность И НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ВопросЗадан", Ложь) Тогда
		
		ЗадатьВопрос = НеобходимоЗадатьВопрос(АдресСКД, Отказ);	
		
		Если Отказ Тогда         
			ТекстСообщения = НСтр("ru = 'Не задана схема компоновки данных'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);				
		Иначе 		
			Если ЗадатьВопрос Тогда
				
				Отказ 			= Истина;
				Оповещение 		= Новый ОписаниеОповещения("ПоказатьВопрос_Завершение", ЭтотОбъект, ПараметрыЗаписи);
				ТекстВопроса 	= НСтр("ru = 'Нет обязательных параметров в настройках. Продолжить?'");
				
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);			
				
			КонецЕсли; 		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ПустаяСтрока(АдресСКД) Тогда 
		ТекущийОбъект.СхемаКомпоновкиДанных =
			Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСКД));
	Иначе
		
		ТекущийОбъект.СхемаКомпоновкиДанных = Новый ХранилищеЗначения(Неопределено);

	КонецЕсли;
		
	Если НЕ ПустаяСтрока(АдресНастроекСКД) Тогда 
		
		ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных =
			Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресНастроекСКД));
			
	Иначе
			
		ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(Неопределено);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	
	НастройитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантВыполненияПриИзменении(Элемент)
	
	НастройитьФорму();	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура;  
	ПараметрыЗаписи.Вставить("Закрыть", Истина);
	
	Если Записать(ПараметрыЗаписи) Тогда
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗагрузитьСхему(Команда)
	
	Если ДоступнаФормаРедактированияСКД Тогда
	                
		ИмяФормы									 = "ОбщаяФорма.УпрощеннаяНастройкаСхемыКомпоновкиДанных";
		ЗаголовокФормыНастройкиСхемыКомпоновкиДанных = НСтр("ru = 'Настройки ""%СКД%""'");
		ЗаголовокФормыНастройкиСхемыКомпоновкиДанных = СтрЗаменить(ЗаголовокФормыНастройкиСхемыКомпоновкиДанных, "%СКД%", Объект.Наименование); 	
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("АдресСхемыКомпоновкиДанных", АдресСКД);
		ПараметрыОткрытияФормы.Вставить("АдресНастроекКомпоновкиДанных", ?(ПустаяСтрока(АдресНастроекСКД), Неопределено, АдресНастроекСКД));
		ПараметрыОткрытияФормы.Вставить("ИсточникШаблонов", Неопределено);
		ПараметрыОткрытияФормы.Вставить("Заголовок", ЗаголовокФормыНастройкиСхемыКомпоновкиДанных);
		ПараметрыОткрытияФормы.Вставить("НеПомещатьНастройкиВСхемуКомпоновкиДанных", Истина);
		ПараметрыОткрытияФормы.Вставить("НеНастраиватьУсловноеОформление", Истина);
		ПараметрыОткрытияФормы.Вставить("НеНастраиватьПорядок", Истина);
		ПараметрыОткрытияФормы.Вставить("НеНастраиватьВыбор", Истина);
		ПараметрыОткрытияФормы.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
		ПараметрыОткрытияФормы.Вставить("ИмяШаблонаСКД", "");
		ПараметрыОткрытияФормы.Вставить("ВозвращатьИмяТекущегоШаблонаСКД", Ложь);
		
		ОткрытьФорму(ИмяФормы,
			ПараметрыОткрытияФормы,,,,, 
			Новый ОписаниеОповещения("РедактироватьСхему_Завершение", ЭтотОбъект),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	Иначе  
		
		АдресФайла							= ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);		
		ОписаниеОповещения 					= Новый ОписаниеОповещения("ПрочитатьФайлСхемы_Завершение", ЭтотОбъект); 		
		ПараметрыДиалога 					= ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла(); 	
		ПараметрыДиалога.ИдентификаторФормы = УникальныйИдентификатор;		
		                                      
		ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыДиалога,, АдресФайла); 
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ВыгрузитьСхему(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ЭтоАдресВременногоХранилища(АдресСКД) Тогда
		
		ДвоичныеДанные = ДвоичныеДанныеСхемы(АдресСКД, УникальныйИдентификатор);   
		
		Если ДвоичныеДанные <> Неопределено Тогда				
			
			ПараметрыСохранения 								= ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
			ПараметрыСохранения.Диалог.Заголовок 				= НСтр("ru = 'Выберите файл для сохранения'");
			ПараметрыСохранения.Диалог.МножественныйВыбор 		= Ложь;
			ПараметрыСохранения.Диалог.ПредварительныйПросмотр 	= Ложь;				
	
			ФайловаяСистемаКлиент.СохранитьФайл(Неопределено, ДвоичныеДанные, 
														Объект.Код, ПараметрыСохранения);			
			
		КонецЕсли; 		
			
	КонецЕсли; 		
	
КонецПроцедуры   

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции   

#Область ПодключаемыеОбработчики

&НаКлиенте
Процедура ПрочитатьФайлСхемы_Завершение(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныйФайл <> Неопределено Тогда    		
		
		Состояние(НСтр("ru = 'Выполняется чтение файла схемы компоновки. Пожалуйста, подождите...'"));
		                       	
		АдресФайлаСКД = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПомещенныйФайл.ВыбранноеИмяФайла), УникальныйИдентификатор);
		  	 	
		//ЗагрузитьСКДИзФайлаНаСервере(АдресФайлаСКД, КомпоновщикНастроекПВД, ТекущаяСтрока.АдресСКД, ТекущаяСтрока.АдресНастроекКомпоновщика, УникальныйИдентификатор, ОтображениеСтраницыПараметры);
		     		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервереБезКонтекста
Процедура ЗагрузитьСКДИзФайлаНаСервере(АдресФайлаСКД, КомпоновщикНастроек, АдресСКД, АдресНастроек, Идентификатор, ЕстьПараметры)
	                             	
	//ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаСКД);
	//ИмяФайлаСКДНаСервере = ПолучитьИмяВременногоФайла();
	//ДвоичныеДанные.Записать(ИмяФайлаСКДНаСервере);   
	//
	//ЧтениеXML = Новый ЧтениеXML;
	//ЧтениеXML.ОткрытьФайл(ИмяФайлаСКДНаСервере);
	//
	//Попытка
	//	СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("СхемаКомпоновкиДанных"));	
	//Исключение
	//    СообщитьПользователю(НСтр("ru = 'Не удалось прочитать файл СКД.'"));
	//КонецПопытки; 
	//ЧтениеXML.Закрыть();
	//
	//УдалитьФайлы(ИмяФайлаСКДНаСервере);
	//УдалитьИзВременногоХранилища(АдресФайлаСКД);
	//
	//Если СхемаКомпоновкиДанных <> Неопределено Тогда
	//	
	//	Если ЗначениеЗаполнено(АдресСКД) И ЭтоАдресВременногоХранилища(АдресСКД) Тогда
	//		АдресСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСКД);
	//	Иначе
	//		АдресСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Идентификатор);	
	//	КонецЕсли; 
	//	
	//	Если ЗначениеЗаполнено(АдресНастроек) И ЭтоАдресВременногоХранилища(АдресНастроек) Тогда
	//		АдресНастроек = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных.НастройкиПоУмолчанию, АдресНастроек);
	//	Иначе
	//		АдресНастроек = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных.НастройкиПоУмолчанию, Идентификатор);	
	//	КонецЕсли;	
	//	
	//	ОбновитьКомпоновщикНастроек(КомпоновщикНастроек, АдресСКД, СхемаКомпоновкиДанных.НастройкиПоУмолчанию,, ЕстьПараметры); 		
	//	
	//КонецЕсли; 		
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопрос_Завершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗадан", Истина);
		Если Записать(ПараметрыЗаписи) И ПараметрыЗаписи.Свойство("Закрыть") Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура РедактироватьСхему_Завершение(Результат, ДополнительныеПараметры) Экспорт
	        
	Если Результат <> Неопределено Тогда 
		ПрименитьИзмененияКСхемеКомпоновкиДанных(Результат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти  

&НаСервере
Процедура ПрименитьИзмененияКСхемеКомпоновкиДанных(АдресНастроекСхемы)
	                                                    	
	Схема 							= ПолучитьИзВременногоХранилища(АдресСКД);
	НастройкиСхемы					= ПолучитьИзВременногоХранилища(АдресНастроекСхемы);
	НастройкиПоУмолчанию 			= Схема.НастройкиПоУмолчанию;	
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить();
	
	Если ОбщегоНазначения.ЗначениеВСтрокуXML(КомпоновщикНастроек.ПолучитьНастройки()) <> ОбщегоНазначения.ЗначениеВСтрокуXML(НастройкиСхемы) Тогда 
		АдресНастроекСКД = АдресНастроекСхемы;
	КонецЕсли;
	
	НастроитьФормуПоСхемеКомпоновки(Схема, НастройкиСхемы);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройитьФорму()
	
	Элементы.ГруппаРежимРаботыПростой.Видимость 			= Ложь;
	Элементы.ГруппаРежимРаботыПоСпискуНастроек.Видимость 	= Ложь;
	Элементы.СтраницаРасширенныйРежим.Видимость 			= Ложь; 
	Элементы.НомерФиксированногоЗапросаВПакете.Видимость 	= Ложь;
	Элементы.ГруппаПараметрыРаботыПоСписку.Видимость        = Ложь;
	
	Если Объект.РежимРаботы = 0 Тогда
		Элементы.ГруппаРежимРаботыПростой.Видимость 			= Истина;
	ИначеЕсли Объект.РежимРаботы = 1 Тогда 
		
		Элементы.ГруппаПараметрыРаботыПоСписку.Видимость        = Истина;
		Элементы.ГруппаРежимРаботыПоСпискуНастроек.Видимость 	= Истина; 
		
		Если Объект.ВариантВыполнения = ПредопределенноеЗначение("Перечисление.рнсВариантВыполненияПравила.ЗапросСОбъединением") Тогда
			Элементы.НомерФиксированногоЗапросаВПакете.Видимость = Элементы.НомерФиксированногоЗапросаВПакете.МаксимальноеЗначение > 1;	
		КонецЕсли;  	
		
	ИначеЕсли Объект.РежимРаботы = 2 Тогда
		Элементы.СтраницаРасширенныйРежим.Видимость 			= Истина; 	
	КонецЕсли;	
	
КонецПроцедуры     

&НаСервереБезКонтекста
Функция ДвоичныеДанныеСхемы(Адрес, Идентификатор) 	
	
	Схема 		= ПолучитьИзВременногоХранилища(Адрес);
	ТекстXML 	= ОбщегоНазначения.ЗначениеВСтрокуXML(Схема);  	
	
	Возврат ПоместитьВоВременноеХранилище(ПолучитьДвоичныеДанныеИзСтроки(ТекстXML), Идентификатор);
	
КонецФункции  

&НаСервереБезКонтекста
Функция НеобходимоЗадатьВопрос(Адрес, Отказ)
	
	Схема = ПолучитьИзВременногоХранилища(Адрес);
	Если Схема = Неопределено Тогда  
		Отказ = Истина;	
		Возврат Неопределено;
	Иначе
		НастройкиКомпоновки = Схема.НастройкиПоУмолчанию;
		Возврат НЕ рнсСлужебный.ЕстьОбязательныеПараметры(НастройкиКомпоновки);		
	КонецЕсли; 
	
КонецФункции 

&НаСервере
Процедура НастроитьФормуПоСхемеКомпоновки(Схема, НастройкиКомпоновки)	
	
	Наборы 								= Схема.НаборыДанных;
	Объект.ИспользуетсяСписокОбъектов 	= Ложь;; 
	СписокПолейВыбора 					= Элементы.ИмяКолонкиРезультата.СписокВыбора;  
	
	СписокПолейВыбора.Очистить();   
	
	Для каждого Ит Из НастройкиКомпоновки.Выбор.Элементы Цикл 	
		ИмяПоля = Строка(Ит.Поле); 	
		СписокПолейВыбора.Добавить(ИмяПоля); 		
	КонецЦикла;   
	
	Для каждого Ит Из Схема.Параметры Цикл
		Если Ит.ДоступенСписокЗначений И НЕ Ит.ОграничениеИспользования Тогда  
			Объект.ИспользуетсяСписокОбъектов = Истина;
			Прервать;	
		КонецЕсли;	
	КонецЦикла; 	 
	
	Если Наборы.Количество() = 1 И ТипЗнч(Наборы[0]) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда 
		
		ТекстЗапроса = Наборы[0].Запрос;
		СхемаЗапроса = Новый СхемаЗапроса;  
		
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса); 
		
		МаксимальноеЗначение = СхемаЗапроса.ПакетЗапросов.Количество(); 		
		
	Иначе  	
		МаксимальноеЗначение 											= 0;		 
		Элементы.ВариантВыполнения.Доступность 							= Ложь;
		Объект.ВариантВыполнения 										= Перечисления.рнсВариантВыполненияПравила.СхемаКомпоновки;			
	КонецЕсли; 
	
	Элементы.НомерФиксированногоЗапросаВПакете.МаксимальноеЗначение	= МаксимальноеЗначение; 
	Элементы.НомерФиксированногоЗапросаВПакете.Видимость = МаксимальноеЗначение > 1;
	
КонецПроцедуры

#КонецОбласти   




















 









