#Область ПрограммныйИнтерфейс

#Область МодификацияФорм

// Процедуры и функции для описания поведения элементов форм, замещающих две колонки таблицы

// Добавляет таблицу значений как набор пар поле ввода и поле списка значений  
//
// Параметры:
//  Форма				 - Форма	 - исходная форма 
//  Родитель			 - ЭлементФормы	 - родитель для добавляемого элемента 
//  ПолныйПутьКТаблице	 - Строка	 - путь к таблицы источнику данных
//  ИмяКолонкиКлюча		 - Строка	 - имя группирующей колонка
//  ИмяКолонкиСписка	 - Строка	 - имя колонки списка 
//  Обработчики			 - Структура	 - структура с данными обработчиков колонок
//
Процедура СоздатьЭлементыОтображенияТаблицы(Форма, Родитель, ПолныйПутьКТаблице, ИмяКолонкиКлюча, ИмяКолонкиСписка, Обработчики = Неопределено) Экспорт
	
	ИмяТаблицы				= "";
	МассивРеквизитов 		= Новый Массив;		
	Таблица					= ЗначениеРеквизитаФормы(Форма, ПолныйПутьКТаблице, ИмяТаблицы);
	Коллекция				= Таблица.Выгрузить(Новый Массив); 	
	ТипЗначенийСписка       = Коллекция.Колонки[ИмяКолонкиСписка].ТипЗначения;
	ИмяТаблицыОтображения 	= "ОтображениеТаблицы_" + ИмяТаблицы;
	КоллекцияКлючСписок		= СоздатьКоллекциюСтрокПоУникальнымЗначениямКолонок(Таблица, ИмяКолонкиКлюча, Истина, ИмяКолонкиСписка);
	  	        	                          
	МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяТаблицыОтображения, Новый ОписаниеТипов("ТаблицаЗначений")));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ИдентификаторКлюча",  Новый ОписаниеТипов("Строка"), ИмяТаблицыОтображения));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("КлючСписка",  Коллекция.Колонки[ИмяКолонкиКлюча].ТипЗначения, ИмяТаблицыОтображения));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("СписокЗначений", Новый ОписаниеТипов("СписокЗначений"), ИмяТаблицыОтображения));
	
	Форма.ИзменитьРеквизиты(МассивРеквизитов);	
	
	Для каждого Ит Из КоллекцияКлючСписок Цикл
		
		Список 				= Новый СписокЗначений;
		Список.ТипЗначения 	= ТипЗначенийСписка;   	
		
		Список.ЗагрузитьЗначения(Ит.Значение);
		              	
		// поправить
		ДобавитьЭлементыОтображенияСтрокиТаблицы(Форма, ИмяТаблицыОтображения, Родитель, ТРег(ИмяКолонкиКлюча), ТРег(ИмяКолонкиСписка), Ит.Ключ, Список);
		
	КонецЦикла; 
	
	Список 				= Новый СписокЗначений;
	Список.ТипЗначения 	= ТипЗначенийСписка;
	
	ДобавитьЭлементыОтображенияСтрокиТаблицы(Форма, ИмяТаблицыОтображения, Родитель, ТРег(ИмяКолонкиКлюча), ТРег(ИмяКолонкиСписка), Неопределено, Список);
	
КонецПроцедуры

// Добавляет колонку списка значений, элементы которого из колонки связанной таблицы   
//
// Параметры:
//  Форма					 - 	Форма	 - исходная форма 
//  ТаблицаФормыНазначения	 - 	ДанныеФормыКоллекция - таблица с добавляемой колонкой
//  ТаблицаДанныхСписка		 - 	ДанныеФормыКоллекция - таблица источник для списка значений 
//  ДанныеКолонкиСписка		 - 	Структура - дополнительные свойства колонки
//  ИмяРеквизитаСвязи		 - Строка	 - реквизит для связи таблиц
//
Процедура СоздатьКолонкуСписокЗначенийОтображенияСтрокТаблицы(Форма, ТаблицаФормыНазначения, ТаблицаДанныхСписка, ДанныеКолонкиСписка, ИмяРеквизитаСвязи = "КлючСвязи") Экспорт
	
	ОграничениеПоТипу		= Неопределено;
	ИмяКолонкиНазначения	= ДанныеКолонкиСписка.Имя;   	
	Путь					= ТаблицаФормыНазначения.ПутьКДанным;  	
	СвойстваКолонки     	= Новый Структура("Имя, Вид, КнопкаОчистки", ИмяКолонкиНазначения, ВидПоляФормы.ПолеВвода, Истина);
	МассивРеквизитов		= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Новый РеквизитФормы(ИмяКолонкиНазначения, Новый ОписаниеТипов("СписокЗначений"), Путь));
	
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СвойстваКолонки, ДанныеКолонкиСписка, Истина);	
	
	Если ДанныеКолонкиСписка.Свойство("ОграничениеПоТипу", ОграничениеПоТипу) Тогда
		ТипЗначенийСписка = ОграничениеПоТипу;		
	Иначе
		ТаблицаИсточник 	= ТаблицаДанныхСписка.Выгрузить(Новый Массив);
		ТипЗначенийСписка 	= ТаблицаИсточник.Колонки[ИмяКолонкиНазначения].ТипЗначения;
	КонецЕсли; 	 
	
	Для каждого СтрокаНазначения Из ЗначениеРеквизитаФормы(Форма, Путь, Неопределено) Цикл
		
		СтрокаНазначения[ИмяКолонкиНазначения].ТипЗначения = ТипЗначенийСписка;   
		
		СтрокиИсточника = ТаблицаДанныхСписка.НайтиСтроки(Новый Структура(ИмяРеквизитаСвязи, СтрокаНазначения[ИмяРеквизитаСвязи]));
		
		Для каждого Ит Из СтрокиИсточника Цикл     			
			СтрокаНазначения[ИмяКолонкиНазначения].Добавить(Ит[ИмяКолонкиНазначения]);		
		КонецЦикла; 					
		
	КонецЦикла;
	
	СоздатьЭлементФормы(Форма.Элементы, СвойстваКолонки, Тип("ПолеФормы"), ТаблицаФормыНазначения);  	
	
КонецПроцедуры 

// Добавляет таблицу на форму с колонкой типа список значений 
//
// Параметры:
//  Форма					 - Форма	 - исходная форма
//  ИсточникЗначений		 - ТаблицаЗначений,ДанныеФормыКоллекция	 - источник значений для списка
//  ИмяКолонкиСписка		 - Строка	 - имя колонки списка значений
//  Родитель				 - ЭлементФормы	 - родитель для добавляемого элемента
//  ДополнительныеПараметры	 - Структура	 - дополнительное описание элементов
//
Процедура СоздатьТаблицуСоСпискомЗначений(Форма, ИсточникЗначений, ИмяКолонкиСписка, Родитель = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	СвойстваТаблицы			= Неопределено;
	МассивКолонок			= Новый Массив;
	СвойствоКолонки			= Неопределено;
	СвойстваКолонок			= Неопределено;
	ИмяТаблицы 				= "МА_ТаблицаСоСписком";
	ЭлементыФормы 			= Форма.Элементы;
	ТипИсточник				= ТипЗнч(ИсточникЗначений);
	МассивРеквизитов		= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Новый РеквизитФормы(ИмяТаблицы, Новый ОписаниеТипов("ТаблицаЗначений")));
	     			
	Если ТипИсточник = Тип("ДанныеФормыКоллекция") Тогда 
		Колонки = ИсточникЗначений.Выгрузить(Новый Массив).Колонки;	
	Иначе
		Колонки = ИсточникЗначений.Колонки;	
	КонецЕсли; 
	
	ТипЗначенийСписка = Колонки[ИмяКолонкиСписка].ТипЗначения;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		ДополнительныеПараметры.Свойство("СвойстваКолонок", СвойстваКолонок);
		ДополнительныеПараметры.Свойство("СвойстваТаблицы", СвойстваТаблицы);
		
		Если ДополнительныеПараметры.Свойство("ИмяТаблицы") Тогда
			ИмяТаблицы = ДополнительныеПараметры.ИмяТаблицы;	
		КонецЕсли; 
		
	КонецЕсли; 
	
	Для каждого Ит Из Колонки Цикл 
		
		Если Ит.Имя = "НомерСтроки" ИЛИ Ит.Имя = "ИсходныйНомерСтроки" Тогда
			Продолжить;	
		КонецЕсли; 
		
		Если Ит.Имя = ИмяКолонкиСписка Тогда						
			МассивРеквизитов.Добавить(Новый РеквизитФормы(Ит.Имя, Новый ОписаниеТипов("СписокЗначений"), ИмяТаблицы, Ит.Заголовок));
		Иначе
			МассивРеквизитов.Добавить(Новый РеквизитФормы(Ит.Имя, Ит.ТипЗначения, ИмяТаблицы, Ит.Заголовок));	
		КонецЕсли; 
		
		Если Ит.Имя <> ИмяКолонкиСписка Тогда
			МассивКолонок.Добавить(Ит.Имя);	
		КонецЕсли;		
		
	КонецЦикла; 
	
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
	
	Таблица = СоздатьЭлементФормы(ЭлементыФормы, СвойстваТаблицы, Тип("ТаблицаФормы"), Родитель);
	
	Для каждого Ит Из МассивРеквизитов Цикл 	
		
		Если Ит.Имя = ИмяТаблицы Тогда
			Продолжить;	
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(СвойстваКолонок) Тогда
			СвойстваКолонок.Свойство(Ит.Имя, СвойствоКолонки);		
		КонецЕсли; 		
		
		Если СвойствоКолонки = Неопределено Тогда
			СвойствоКолонки = Новый Структура("Имя, Вид", Ит.Имя, ВидПоляФормы.ПолеВвода);  		
		КонецЕсли; 
		
		Если Ит.Имя = ИмяКолонкиСписка Тогда 
			СвойствоКолонки.Вставить("ОграничениеТипа", ТипЗначенийСписка);			 		
		КонецЕсли; 		
		
		СоздатьЭлементФормы(ЭлементыФормы, СвойствоКолонки, Тип("ПолеФормы"), Таблица);	
			
	КонецЦикла; 
	
	// заполнение
	
	КоллекцияКлючСписок	= СоздатьКоллекциюСтрокПоУникальнымЗначениямКолонок(ИсточникЗначений, МассивКолонок, Истина);

	ЗаполнитьТаблицуСоСписком(Форма[ИмяТаблицы], ИмяКолонкиСписка, КоллекцияКлючСписок);  	
	
КонецПроцедуры 

// Добавляет элементы отражающие состояние и элементы управления регламентным заданием 
//
// Параметры:
//  УправляемаяФорма			 - Форма	 - исходная форма
//  Родитель					 - ЭлементФормы	 - родитель для добавляемого элемента
//  Постфикс					 - Строка	 - постфикс наименования элементов  
//  ОписаниеЭлементовУправления	 - Структура	 - дополнительное описание элементов
//
Процедура СоздатьЭлементыСостоянияРегламентногоЗадания(УправляемаяФорма, Родитель = Неопределено, Постфикс = "", ОписаниеЭлементовУправления = Неопределено) Экспорт
	
	ЕстьСостояние 				= Истина;  	  	
	КвалификаторыДаты 			= Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	ДействиеИспользование		= Неопределено;
	ДействияРасписание			= Неопределено;
	ДействиеВыполнение			= Неопределено;
	ДействиеОбновление			= Неопределено;	
	ТипПолеФормы 				= Тип("ПолеФормы");
	КнопкаФормы 				= Тип("КнопкаФормы"); 
	
	Если ЗначениеЗаполнено(ОписаниеЭлементовУправления) Тогда
		ОписаниеЭлементовУправления.Свойство("Использование", ДействиеИспользование);	
		ОписаниеЭлементовУправления.Свойство("Расписание", ДействияРасписание);
		ОписаниеЭлементовУправления.Свойство("Выполнение", ДействиеВыполнение);
		ОписаниеЭлементовУправления.Свойство("ОбновлениеСостояния", ДействиеОбновление);
		ОписаниеЭлементовУправления.Свойство("Состояние", ЕстьСостояние);
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(ДействиеВыполнение) ИЛИ ЗначениеЗаполнено(ДействиеОбновление) Тогда
		
		СвойстваПанели 		= Новый Структура("Имя, Вид", "ГруппаКомандыЗадания" + Постфикс, ВидГруппыФормы.КоманднаяПанель);
		СвойстваКоманды 	= Новый Структура; 
		
		СвойстваКоманды.Вставить("Имя", Неопределено);
		СвойстваКоманды.Вставить("Заголовок", Неопределено);
		СвойстваКоманды.Вставить("Действие", Неопределено);
		СвойстваКоманды.Вставить("Вид", ВидКнопкиФормы.ОбычнаяКнопка);
		СвойстваКоманды.Вставить("Отображение", ОтображениеКнопки.КартинкаИТекст);  	
		
		КоманднаяПанельРЗ = СоздатьЭлементФормы(УправляемаяФорма, СвойстваПанели, Тип("ГруппаФормы"), Родитель);
		
		Если ЗначениеЗаполнено(ДействиеВыполнение) Тогда  	
			 					
			СвойстваКоманды.Имя 		= "ВыполнитьЗадание" + Постфикс;
			СвойстваКоманды.Заголовок 	= НСтр("ru='Выполнить'");
			СвойстваКоманды.Действие 	= ДействиеВыполнение; 
			
			СоздатьЭлементФормы(УправляемаяФорма, СвойстваКоманды, КнопкаФормы, КоманднаяПанельРЗ);			
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ДействиеОбновление) Тогда 			
			
			СвойстваКоманды.Имя 		= "ОбновитьСостояниеЗадания" + Постфикс;
			СвойстваКоманды.Заголовок 	= НСтр("ru='Обновить состояние'");
			СвойстваКоманды.Действие 	= ДействиеОбновление; 
			
			СоздатьЭлементФормы(УправляемаяФорма, СвойстваКоманды, КнопкаФормы, КоманднаяПанельРЗ);			
			
		КонецЕсли; 		
		
	КонецЕсли; 
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Идентификатор" + Постфикс, Новый ОписаниеТипов("Строка"), , "Идентификатор"));  	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Использование" + Постфикс, Новый ОписаниеТипов("Булево"), , "Использование"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Ключ" + Постфикс, Новый ОписаниеТипов("Строка"), , "Ключ"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Начало" + Постфикс, Новый ОписаниеТипов("Дата", , , КвалификаторыДаты), , "Начало"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Конец" + Постфикс, Новый ОписаниеТипов("Дата", , , КвалификаторыДаты),, "Конец"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Наименование" + Постфикс, Новый ОписаниеТипов("Строка"), , "Наименование"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Пользователь" + Постфикс, Новый ОписаниеТипов("Строка"), , "Пользователь"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Расписание" + Постфикс, Новый ОписаниеТипов(), , "Расписание"));  	
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Состояние" + Постфикс, Новый ОписаниеТипов("Строка"), , "Состояние"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ИнформацияОбОшибке" + Постфикс, Новый ОписаниеТипов("Строка"), , "Информация"));
	
	УправляемаяФорма.ИзменитьРеквизиты(МассивРеквизитов);
	
	СоздатьЭлементФормы(УправляемаяФорма, Новый Структура("Имя, Вид", "Наименование" + Постфикс, ВидПоляФормы.ПолеНадписи), ТипПолеФормы, Родитель);
	
	Если ЗначениеЗаполнено(ДействияРасписание) Тогда     
		
		СвойстваРасписания = Новый Структура; 
		СвойстваРасписания.Вставить("Имя", "Расписание" + Постфикс);
		СвойстваРасписания.Вставить("Вид", ВидПоляФормы.ПолеНадписи);
		СвойстваРасписания.Вставить("Гиперссылка", Истина);
		СвойстваРасписания.Вставить("Действия", Новый Структура("Нажатие", ДействияРасписание)); 		
		 		
	Иначе
		СвойстваРасписания = "Расписание" + Постфикс;		
	КонецЕсли;
	
	СоздатьЭлементФормы(УправляемаяФорма, СвойстваРасписания, ТипПолеФормы, Родитель);	
	СоздатьЭлементФормы(УправляемаяФорма, Новый Структура("Имя, Вид", "Идентификатор" + Постфикс, ВидПоляФормы.ПолеНадписи), ТипПолеФормы, Родитель);
	СоздатьЭлементФормы(УправляемаяФорма, Новый Структура("Имя, Вид", "Ключ" + Постфикс, ВидПоляФормы.ПолеНадписи), ТипПолеФормы, Родитель); 	
	СоздатьЭлементФормы(УправляемаяФорма, Новый Структура("Имя, Вид", "Пользователь" + Постфикс, ВидПоляФормы.ПолеНадписи), ТипПолеФормы, Родитель);
	
	Если ЗначениеЗаполнено(ДействиеИспользование) Тогда  
		
		СвойстваГруппы 	= Новый Структура;		
		СвойстваГруппы.Вставить("Имя", "ГруппаИспользование" + Постфикс);
		СвойстваГруппы.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);	
		СвойстваГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
		СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);	 
		СвойстваГруппы.Вставить("Отображение", ОтображениеОбычнойГруппы.Нет);
		
		СвойстваДекорации = Новый Структура;   
		СвойстваДекорации.Вставить("Имя", "ДекорацияИспользование" + Постфикс);
		СвойстваДекорации.Вставить("Вид", ВидДекорацииФормы.Надпись); 
		СвойстваДекорации.Вставить("Заголовок", "Использование"); 	
		
		СвойстваИспользование = Новый Структура;
		СвойстваИспользование.Вставить("Имя", "Использование" + Постфикс); 
		СвойстваИспользование.Вставить("Действие", ДействиеИспользование);
		СвойстваИспользование.Вставить("Вид", ВидКнопкиФормы.ОбычнаяКнопка); 
		СвойстваИспользование.Вставить("Отображение", ОтображениеКнопки.Картинка);
		
		ГруппаИспользование = СоздатьЭлементФормы(УправляемаяФорма, СвойстваГруппы, Тип("ГруппаФормы"), Родитель);
		СоздатьЭлементФормы(УправляемаяФорма, СвойстваДекорации, Тип("ДекорацияФормы"), ГруппаИспользование);
		СоздатьЭлементФормы(УправляемаяФорма, СвойстваИспользование, КнопкаФормы, ГруппаИспользование); 
		
	Иначе 		
		СоздатьЭлементФормы(УправляемаяФорма, Новый Структура("Имя, Вид", "Использование" + Постфикс, ВидПоляФормы.ПолеНадписи), ТипПолеФормы, Родитель);	
	КонецЕсли;    	    

	Если ЗначениеЗаполнено(ЕстьСостояние) Тогда
		
		СвойстваГруппы 	= Новый Структура;		
		СвойстваГруппы.Вставить("Имя", "ГруппаПериодВыполнения" + Постфикс);
		СвойстваГруппы.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);	
		СвойстваГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
		СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);	 
		СвойстваГруппы.Вставить("Отображение", ОтображениеОбычнойГруппы.Нет);
		
		СвойстваИнфоОбОшибках = Новый Структура; 
		СвойстваИнфоОбОшибках.Вставить("Имя", "ИнформацияОбОшибке" + Постфикс);
		СвойстваИнфоОбОшибках.Вставить("Вид", ВидПоляФормы.ПолеВвода);
		СвойстваИнфоОбОшибках.Вставить("ТолькоПросмотр", Истина);
		СвойстваИнфоОбОшибках.Вставить("МногострочныйРежим", Истина); 	
		
		СоздатьЭлементФормы(УправляемаяФорма, Новый Структура("Имя, Вид", "Состояние" + Постфикс, ВидПоляФормы.ПолеНадписи), ТипПолеФормы, Родитель);
		                                        
		ГруппаПериодВыполнения = СоздатьЭлементФормы(УправляемаяФорма, СвойстваГруппы, Тип("ГруппаФормы"), Родитель);
		СоздатьЭлементФормы(УправляемаяФорма, Новый Структура("Имя, Вид", "Начало" + Постфикс, ВидПоляФормы.ПолеНадписи), ТипПолеФормы, ГруппаПериодВыполнения);
		СоздатьЭлементФормы(УправляемаяФорма, Новый Структура("Имя, Вид", "Конец" + Постфикс, ВидПоляФормы.ПолеНадписи), ТипПолеФормы, ГруппаПериодВыполнения);
		
		СоздатьЭлементФормы(УправляемаяФорма, СвойстваИнфоОбОшибках, ТипПолеФормы, Родитель);	
		
	КонецЕсли;	  	
	 	
КонецПроцедуры

// Базовое создание элементов формы

// Создает элемент формы
//       
// Параметры:
//  УправляемаяФорма              	- Форма                             						- исходная форма
//  ОпределениеЭлемента         	- Строка, Структура                            				- строка, состоящая из полного пути и спецсимволов-указаний, или структура свойств элемента
//                                                                                                (обязательный ключ структуры - "Имя", дополнительно для команды - "Действие" или "ИмяКоманды"). 
//																									Спецсимволы:
//                                                                        							1. ! - имя группы (таблицы формы) не добалвяется к имени элемента   
//  ТипЭлемента                 	- Тип                          								- тип ДекорацияФормы, ГруппаФормы, КнопкаФормы, ТаблицаФормы, ПолеФормы 									                                 						
//  Родитель                 		- Строка, ГруппаФормы, ТаблицаФормы 						- родитель для добавляемого элемента
//  СледующийЭлемент         		- Строка, ГруппаФормы, ТаблицаФормы,                        - элемент, перед которым должен быть вставлен новый элемент
//										ПолеФормы, КнопкаФормы  
//  РазделПМФ             			- Строка                            						- раздел ПМФ
//
// Возвращаемое значение:
//   - КнопкаФормы,ПолеФормы,ТаблицаФормы,ГруппаФормы - добавленный элемент
//
Функция СоздатьЭлементФормы(УправляемаяФорма, ОпределениеЭлемента, ТипЭлемента, Знач Родитель = Неопределено, Знач СледующийЭлемент = Неопределено, Знач РазделПМФ = "") Экспорт
                                        
    ЭлементыФормы                	= УправляемаяФорма.Элементы; 
	КомандаПМФ						= Неопределено;
    ПутьКДанным                  	= "";
	ИмяКоманды						= ""; 
    РодительЭлемента                = ?(ТипЗнч(Родитель) = Тип("Строка"), ЭлементыФормы[Родитель], Родитель);
	ТипРодителя						= ТипЗнч(РодительЭлемента);
	
	Если ТипЗнч(ОпределениеЭлемента) = Тип("Структура") Тогда 
		ИмяЭлементаФормы = ОпределениеЭлемента.Имя;	
		СвойстваЭлемента = ОпределениеЭлемента;
	Иначе
		ИмяЭлементаФормы = ОпределениеЭлемента;
		СвойстваЭлемента = Неопределено;
	КонецЕсли;
	
	ФормироватьИмяЭлемента         	= НЕ СтрНачинаетсяС(ИмяЭлементаФормы, "!");
    ИмяЭлементаФормы            	= СтрЗаменить(ИмяЭлементаФормы, "!", "");
    ЧастиИмени 						= СтрРазделить(ИмяЭлементаФормы, ".", Ложь);   
	   	
    Если ЧастиИмени.Количество() = 1 Тогда
        КлючЭлемента     	= ИмяЭлементаФормы;         
        ИмяЭлемента         = ИмяЭлементаФормы;
        ИмяРеквизитаВУ    	= ""; 
    Иначе
        
        КлючЭлемента        = ЧастиИмени[ЧастиИмени.ВГраница()];         
        ИмяЭлемента         = КлючЭлемента;
        ИмяЭлементаФормы    = КлючЭлемента;
        
        ЧастиИмени.Удалить(ЧастиИмени.ВГраница());
        ИмяРеквизитаВУ = СтрСоединить(ЧастиИмени, ".");
        
    КонецЕсли;
    
    Если Не (ТипЗнч(СвойстваЭлемента) = Тип("Структура")
        И СвойстваЭлемента.Свойство("ПутьКДанным", ПутьКДанным)) Тогда         
     
        Если ТипРодителя = Тип("ТаблицаФормы") Тогда
			
			ИмяЭлемента = РодительЭлемента.Имя + КлючЭлемента; 
			
			Если НЕ СтрНачинаетсяС(КлючЭлемента, РодительЭлемента.ПутьКДанным)  Тогда
				ПутьКДанным = РодительЭлемента.ПутьКДанным + "." + КлючЭлемента;	
			КонецЕсли; 			
            
        ИначеЕсли ТипРодителя = Тип("ГруппаФормы") И РодительЭлемента.Вид = ВидГруппыФормы.ГруппаКолонок Тогда         
            
            Таблица = РодительЭлемента;
            Пока ТипЗнч(Таблица) <> Тип("ТаблицаФормы") Цикл            
                Таблица = Таблица.Родитель;
            КонецЦикла;
            ИмяЭлемента = Таблица.Имя + КлючЭлемента;
			
			Если НЕ СтрНачинаетсяС(КлючЭлемента, Таблица.ПутьКДанным)  Тогда
				ПутьКДанным = Таблица.ПутьКДанным + "." + КлючЭлемента;	
			КонецЕсли;                         
            
        Иначе
            ИмяЭлемента = ?(РодительЭлемента = Неопределено, "", РодительЭлемента.Имя) + КлючЭлемента;
            ПутьКДанным = ?(ЗначениеЗаполнено(ИмяРеквизитаВУ), ИмяРеквизитаВУ + ".", "") + КлючЭлемента;    
        КонецЕсли;
    
	КонецЕсли; 		
    
    Элемент = ЭлементыФормы.Вставить(?(ФормироватьИмяЭлемента, ИмяЭлемента, ИмяЭлементаФормы),
                                        ТипЭлемента,
                                            РодительЭлемента,
                                                ?(ТипЗнч(СледующийЭлемент) = Тип("Строка"), ЭлементыФормы[СледующийЭлемент], СледующийЭлемент));  
												
	Если СвойстваЭлемента = Неопределено Тогда 		
		
		ВТаблице 	= Ложь;
		ВСтраницах  = Ложь;	
		ВПанели  	= Ложь;
						
		Если ТипРодителя = Тип("ГруппаФормы") Тогда   
			
			ВидГруппы = РодительЭлемента.Вид;
							
			Если ВидГруппы = ВидГруппыФормы.ГруппаКолонок Тогда  
				ВТаблице 	= Истина;
			ИначеЕсли ВидГруппы = ВидГруппыФормы.Страницы Тогда	
				ВСтраницах  = Истина;
			ИначеЕсли ВидГруппы = ВидГруппыФормы.ГруппаКнопок ИЛИ ВидГруппы = ВидГруппыФормы.Подменю ИЛИ ВидГруппы = ВидГруппыФормы.КоманднаяПанель Тогда 
				ВПанели  	= Истина;		
			КонецЕсли;
			
		ИначеЕсли ТипРодителя = Тип("ТаблицаФормы") Тогда   
			ВТаблице 	= Истина;			
		КонецЕсли;						
						
		Если ТипЭлемента = Тип("КнопкаФормы") Тогда 
						
			Команда = УправляемаяФорма.Команды.Найти(ИмяЭлементаФормы);
			Если Команда = Неопределено Тогда 	
				Команда 			= УправляемаяФорма.Команды.Добавить(ИмяЭлементаФормы); 				
				Команда.Действие    = ИмяЭлементаФормы;
				Команда.Заголовок   = ЗРег(ИмяЭлементаФормы);
				КомандаПМФ			= Команда;
			КонецЕсли;			
			
			Элемент.ИмяКоманды 	= Команда.Имя;			
			Элемент.Вид 		= ?(ВПанели, ВидКнопкиФормы.КнопкаКоманднойПанели, ВидКнопкиФормы.ОбычнаяКнопка);
			
		ИначеЕсли ТипЭлемента = Тип("ГруппаФормы") Тогда  
			
			Если ВТаблице Тогда  
				Элемент.Вид = ВидГруппыФормы.ГруппаКолонок;	
			ИначеЕсли ВСтраницах Тогда
				Элемент.Вид = ВидГруппыФормы.Страница;
			ИначеЕсли ВПанели Тогда
				Элемент.Вид = ВидГруппыФормы.ГруппаКнопок;	
			Иначе    
				Элемент.ОтображатьЗаголовок = Ложь;
				Элемент.Вид 				= ВидГруппыФормы.ОбычнаяГруппа;	
			КонецЕсли; 		         
			
		ИначеЕсли ТипЭлемента = Тип("ДекорацияФормы") Тогда
			Элемент.Вид         = ВидДекорацииФормы.Надпись;	  
		ИначеЕсли ТипЭлемента = Тип("ТаблицаФормы") Тогда
            Элемент.ПутьКДанным = ПутьКДанным; 
		Иначе
			Элемент.Вид         = ВидПоляФормы.ПолеВвода;
			Элемент.ПутьКДанным = ПутьКДанным;	
        КонецЕсли;			
		
	Иначе
		
		КоллекцияОбработчиков	= Неопределено;
        КоллекцияВыбора			= Неопределено;
        
        Если ТипЭлемента = Тип("ПолеФормы") ИЛИ ТипЭлемента = Тип("ТаблицаФормы") Тогда      
            Если Не СвойстваЭлемента.Свойство("ПутьКДанным") Тогда
                Элемент.ПутьКДанным = ПутьКДанным;        
            КонецЕсли;        
		КонецЕсли;		
        
        // сначала установить вид, потом все остальное
        Если СвойстваЭлемента.Свойство("Вид") Тогда
            Элемент.Вид = СвойстваЭлемента.Вид;        
        КонецЕсли;
        
        ЗаполнитьЗначенияСвойств(Элемент, СвойстваЭлемента);    
		
		Если ТипЭлемента = Тип("КнопкаФормы") И НЕ ЗначениеЗаполнено(Элемент.ИмяКоманды) Тогда 
			
			Действие = Неопределено;
			
			Если СвойстваЭлемента.Свойство("Действие", Действие) Тогда	
				
				Команда = УправляемаяФорма.Команды.Найти(ИмяЭлементаФормы);
				Если Команда = Неопределено Тогда 	
					Команда 			= УправляемаяФорма.Команды.Добавить(ИмяЭлементаФормы); 				
					Команда.Действие    = Действие; 	
					КомандаПМФ			= Команда;
				КонецЕсли; 
				
				Элемент.ИмяКоманды = Команда.Имя;
				
			Иначе
				ВызватьИсключение НСтр("ru = 'Не задано действие команды'");
			КонецЕсли;			
			
		КонецЕсли;		
        
        Если СвойстваЭлемента.Свойство("СписокВыбора", КоллекцияВыбора) Тогда
            Если ТипЗнч(КоллекцияВыбора) = Тип("Массив") Тогда
                Элемент.СписокВыбора.ЗагрузитьЗначения(КоллекцияВыбора);
            Иначе      
                СтрокаСпискаЗначений = Новый Структура("Значение, Представление, Пометка, Картинка");
                Для каждого Ит Из КоллекцияВыбора Цикл
                    ЗаполнитьЗначенияСвойств(СтрокаСпискаЗначений, Ит);
                    Элемент.СписокВыбора.Добавить(СтрокаСпискаЗначений.Значение, СтрокаСпискаЗначений.Представление,
                                                                СтрокаСпискаЗначений.Пометка, СтрокаСпискаЗначений.Картинка);        
                КонецЦикла;
            КонецЕсли;                
        КонецЕсли;
        
        Если СвойстваЭлемента.Свойство("Действия", КоллекцияОбработчиков) Тогда            
            Для каждого Ит Из КоллекцияОбработчиков Цикл                         
                Элемент.УстановитьДействие(Ит.Ключ, Ит.Значение);
            КонецЦикла;                           
        КонецЕсли;
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(РазделПМФ) Тогда
		
		ДобавитьКомпонентРазделаПМФ(УправляемаяФорма, РазделПМФ, Элемент);
		
		Если КомандаПМФ <> Неопределено Тогда
			ДобавитьКомпонентРазделаПМФ(УправляемаяФорма, РазделПМФ, КомандаПМФ);	
		КонецЕсли;
		
	КонецЕсли; 
    
    Возврат Элемент;
 
КонецФункции

// Создает таблицу формы с колонками на основе указанного источника данных
//
// Параметры:
//   Форма - Форма - форма, в которой создается таблица
//   ПолныйПутьКТаблице - Строка - полный путь к данным таблицы
//   КолонкиТаблицы - Строка - имена колонок, перечисленные через запятую
//                    - Массив из Строка - массив имен колонок
//                    - ОбъектМетаданных - объект метаданных, на основе которого создаются колонки
//   Родитель - Строка - имя родительского элемента формы
//            - ЭлементФормы - родительский элемент формы
//   СледЭлемент - Строка - имя элемента, перед которым будет вставлена таблица
//               - ЭлементФормы - элемент формы, перед которым будет вставлена таблица
//
// Возвращаемое значение:
//   Структура:
//     * Таблица - ТаблицаФормы - созданный элемент формы "ТаблицаФормы"
//     * Колонки - Структура - коллекция созданных колонок таблицы (ключ - имя колонки, значение - ПолеФормы)
Функция СоздатьТаблицуФормы(Форма, ПолныйПутьКТаблице, КолонкиТаблицы = Неопределено, Знач Родитель = Неопределено, Знач СледЭлемент = Неопределено) Экспорт
	
	ФормироватьИмяЭлемента 	= НЕ СтрНачинаетсяС(ПолныйПутьКТаблице, "\"); 
	ПолныйПутьКТаблице		= СтрЗаменить(ПолныйПутьКТаблице, "\", "");
	ИмяТаблицы				= "";   
	Таблица					= ЗначениеРеквизитаФормы(Форма, ПолныйПутьКТаблице, ИмяТаблицы);  
	ТипКолонок				= ТипЗнч(КолонкиТаблицы);	
	КоллекцияКолонок 		= Новый Структура;  
	Результат 				= Новый Структура; 
	
	Если ПолныйПутьКТаблице = ИмяТаблицы Тогда
		РеквизитВУ = "";
	Иначе
		РеквизитВУ = Лев(ПолныйПутьКТаблице, СтрДлина(ПолныйПутьКТаблице) - СтрДлина(ИмяТаблицы) - 1);	
	КонецЕсли; 
	
	Если ТипКолонок = Тип("Строка") Тогда 		
		Колонки = СтрРазделить(КолонкиТаблицы, ",", Ложь); 		
	ИначеЕсли ТипКолонок = Тип("Массив") Тогда	
		Колонки = КолонкиТаблицы;	
	ИначеЕсли ТипКолонок = Тип("ОбъектМетаданных") Тогда 	
		
		Колонки = Новый Массив;
		
		Для каждого Ит Из КолонкиТаблицы.СтандартныеРеквизиты Цикл
			Колонки.Добавить(Ит.Имя);	
		КонецЦикла;  
		
		Для каждого Ит Из КолонкиТаблицы.Реквизиты Цикл
			Колонки.Добавить(Ит.Имя);	
		КонецЦикла;  
		
	Иначе
		
		Колонки = Новый Массив;
		СписокКолонок = Таблица.Выгрузить(Новый Массив).Колонки;
		
		Для каждого Ит Из СписокКолонок Цикл   		
			Если Ит.Имя <> "ИсходныйНомерСтроки" Тогда
				Колонки.Добавить(Ит.Имя);	
			КонецЕсли;  				
		КонецЦикла; 	
		            
	КонецЕсли;  
	
	ТаблицаФормы = СоздатьЭлементФормы(Форма, ?(ФормироватьИмяЭлемента, "", "\") + ПолныйПутьКТаблице, Тип("ТаблицаФормы"), Родитель, СледЭлемент, РеквизитВУ);
	
	Для каждого Ит Из Колонки Цикл 	
		
		Если ТипЗнч(Ит) = Тип("Строка") Тогда 
			ИмяКолонки 		= Ит;
			Вид 			= ВидПоляФормы.ПолеВвода; 
		Иначе
			ИмяКолонки 		= Ит.Имя;
			Вид 			= ВидПоляФормы.ПолеВвода;	
		КонецЕсли; 		
		
		КоллекцияКолонок.Вставить(Ит, СоздатьЭлементФормы(Форма, ИмяКолонки, Вид, Тип("ПолеФормы"), ТаблицаФормы));	
		
	КонецЦикла; 	
	
    Результат.Вставить("Таблица", ТаблицаФормы);
    Результат.Вставить("Колонки", КоллекцияКолонок);
	
	Возврат Результат;
	
КонецФункции  

// Получает значение реквизита по пути к данным
//
// Параметры:
//  Форма		 - Форма	 - исходная форма
//  ПутьКДанным	 - Строка	 - путь к реквизиту формы
//  ИмяРеквизита - Строка	 - возвращаемое имя
// 
// Возвращаемое значение:
//   - Произвольный - значение реквизита формы
//
Функция ЗначениеРеквизитаФормы(Форма, ПутьКДанным, ИмяРеквизита = Неопределено) Экспорт
	
	ЭтоТаблица 	= Ложь;
	ДанныеФормы = Форма; 
	Результат 	= Неопределено;
	
	Если СтрНайти(ПутьКДанным, ".") > 0 Тогда  		
		
		МассивСтрок = СтрРазделить(ПутьКДанным, ".");		
		
		Для Сч = 0 По МассивСтрок.ВГраница() - 1 Цикл  			
			ДанныеФормы = ДанныеФормы[МассивСтрок[Сч]]; 
			ЭтоТаблица  = ТипЗнч(ДанныеФормы) = Тип("ДанныеФормыКоллекция");
		КонецЦикла;	 
		
		ИмяРеквизита = МассивСтрок[МассивСтрок.ВГраница()];
		
	Иначе 		
		ИмяРеквизита = ПутьКДанным;  					
	КонецЕсли;
	
	Если ЭтоТаблица Тогда	
		Результат = Новый Массив;
		Для каждого Ит Из ДанныеФормы Цикл
			Результат.Добавить(Ит[ИмяРеквизита]);	
		КонецЦикла;   
	Иначе
		Результат = ДанныеФормы[ИмяРеквизита];	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Дополняет параметры выбора
//
// Параметры:
//  Элемент			 - ПолеВвода - элемент формы
//  ИмяПараметра	 - Строка	 - имя параметра
//  Значение		 - Произвольный	 - значение параметра выбора
//  ТолькоДобавить	 - Булево	- признак проверки параметров на дубли
//
Процедура ИзменитьПараметрыВыбора(Элемент, ИмяПараметра, Значение, ТолькоДобавить = Ложь) Экспорт
	
	ДобавитьНовый          = Истина;
	МассивПараметровВыбора = Новый Массив(Элемент.ПараметрыВыбора);    
	
	Если НЕ ТолькоДобавить Тогда	
	
		Для Сч = 0 По МассивПараметровВыбора.ВГраница() Цикл  
			
			ТекущийПараметр = МассивПараметровВыбора[Сч];	   
			
			Если ТекущийПараметр.Имя = ИмяПараметра Тогда 
				МассивПараметровВыбора[Сч] = Новый ПараметрВыбора(ИмяПараметра, Значение); 
				ДобавитьНовый = Ложь;
				Прервать;
			КонецЕсли;	 
			
		КонецЦикла;	 
	
	КонецЕсли;
	
	Если ДобавитьНовый Тогда
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора(ИмяПараметра, Значение));	
	КонецЕсли;
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
КонецПроцедуры

#Область ПМФ

// Дополняет форму или массив реквизитами программной модификации
//
// Параметры:
//  Приемник 				- Массив,Форма     	-  массив реквизитов или управляемая форма
//  ДополнительныеРеквизиты - Структура     	-  коллекция имени и типа реквизита
//
Процедура ИнициализироватьПМФ(Приемник, ДополнительныеРеквизиты = Неопределено) Экспорт
    
    ИмяТаблицыКомпонентов = "КомпонентыПМФ";    
    
    Если ТипЗнч(Приемник) = Тип("ФормаКлиентскогоПриложения") Тогда
        Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Приемник, ИмяТаблицыКомпонентов) Тогда
            Возврат;    
        КонецЕсли;    
    КонецЕсли;      
                                              
    ТипЧисло  = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный));
    ТипСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(512));    
    Реквизиты = Новый Массив;
        
    Реквизиты.Добавить(Новый РеквизитФормы(ИмяТаблицыКомпонентов, Новый ОписаниеТипов("ТаблицаЗначений")));   
    Реквизиты.Добавить(Новый РеквизитФормы("ПутьКДанным", ТипСтрока, ИмяТаблицыКомпонентов));
    Реквизиты.Добавить(Новый РеквизитФормы("ИмяКомпонента", ТипСтрока, ИмяТаблицыКомпонентов));
    Реквизиты.Добавить(Новый РеквизитФормы("ВидКомпонента", ТипЧисло, ИмяТаблицыКомпонентов));    
    Реквизиты.Добавить(Новый РеквизитФормы("Секция", ТипСтрока, ИмяТаблицыКомпонентов));
    Реквизиты.Добавить(Новый РеквизитФормы("Раздел", ТипСтрока, ИмяТаблицыКомпонентов));   
    
    Если ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда     
    
        Для каждого ОписаниеРеквизита Из ДополнительныеРеквизиты Цикл
            Реквизиты.Добавить(Новый РеквизитФормы(ОписаниеРеквизита.Ключ, ОписаниеРеквизита.Значение, ИмяТаблицыКомпонентов));        
        КонецЦикла;
        
    КонецЕсли;
    
    Если ТипЗнч(Приемник) = Тип("Массив") Тогда
        ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Приемник, Реквизиты);
    Иначе
        Приемник.ИзменитьРеквизиты(Реквизиты);    
    КонецЕсли;    
    
КонецПроцедуры  

// Добавляет информацию о новом компоненте в таблицу ПМФ
//
// Параметры:
//  Назначение		 - Форма						 			- исходная форма
//  Раздел			 - Строка						 			- имя раздела
//  Компонент		 - Строка, РеквизитФормы, ЭлементФормы	 	- добавляемый компонент
//  ВидКомпонента	 - Число								 	- 0 - реквизит, 1 - элемент формы, 2 - команда формы
// 
// Возвращаемое значение:
//   - ДанныеФормыЭлементКоллекции - строка таблицы ПМФ
//
Функция ДобавитьКомпонентРазделаПМФ(Назначение, Знач Раздел, Компонент, ВидКомпонента = 0, ДополнительныеРеквизиты = Неопределено) Экспорт
	
	ТипКомпонента = ТипЗнч(Компонент);
	
	Если ТипЗнч(Назначение) = Тип("ФормаКлиентскогоПриложения") Тогда
		НоваяСтрока = Назначение.КомпонентыПМФ.Добавить();  
	ИначеЕсли ТипЗнч(Назначение) = Тип("ДанныеФормыЭлементКоллекции") Тогда 
		НоваяСтрока = Назначение;		
	Иначе
		НоваяСтрока = Назначение.Добавить();	
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(Раздел) Тогда	
	
		МассивПодстрокРаздела = СтрРазделить(Раздел, ".", Ложь); 
		Если МассивПодстрокРаздела.Количество() = 1 Тогда 
			Секция 		= "";	
		Иначе
			Раздел 		= СокрЛП(МассивПодстрокРаздела[0]);
			Секция  	= СокрЛП(МассивПодстрокРаздела[1]);		
		КонецЕсли;
		
		НоваяСтрока.Секция	= Секция;
		НоваяСтрока.Раздел	= Раздел;
	
	КонецЕсли;
	
	Если ТипКомпонента = Тип("Строка") Тогда 
		
		Точка = СтрНайти(Компонент, ".", НаправлениеПоиска.СКонца); 
		Если Точка > 0 Тогда 
			ИмяРеквизита = Прав(Компонент, СтрДлина(Компонент) - Точка);	
			ПутьКДанным  = Лев(Компонент, Точка - 1); 
		Иначе
			ИмяРеквизита = Компонент;
			ПутьКДанным  = "";
		КонецЕсли; 
		
		НоваяСтрока.ИмяКомпонента 	= ИмяРеквизита;
		НоваяСтрока.ПутьКДанным	 	= ПутьКДанным;  
		НоваяСтрока.ВидКомпонента 	= ВидКомпонента;
		
	Иначе 
		
		Если ТипКомпонента = Тип("РеквизитФормы") Тогда 		
			НоваяСтрока.ИмяКомпонента 	= Компонент.Имя;
			НоваяСтрока.ПутьКДанным	 	= Компонент.Путь; 
			НоваяСтрока.ВидКомпонента 	= 0;
		ИначеЕсли ТипКомпонента = Тип("КомандаФормы") Тогда  
			НоваяСтрока.ИмяКомпонента 	= Компонент.Имя;
			НоваяСтрока.ВидКомпонента 	= 2;
		Иначе
			НоваяСтрока.ИмяКомпонента 	= Компонент.Имя;
			НоваяСтрока.ВидКомпонента 	= 1;
		КонецЕсли;  	
			
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(ДополнительныеРеквизиты) Тогда
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДополнительныеРеквизиты);	
	КонецЕсли;
	
	Возврат НоваяСтрока;
	            
КонецФункции

// Возвращает строки компоненты по разделу
//
// Параметры:
//  Форма	 						- Форма 	 - исходная форма
//  Раздел	 						- Строка	 - имя раздела
//  ВидКомпонента					- Число		 - 0 - реквизит, 1 - элемент формы, 2 - команда формы 
//  ДополнительныеПараметры			- Структура	 - значения дополнительных полей поиска
// 
// Возвращаемое значение:
//   - Массив - массив строк таблицы ПМФ 
//
Функция КомпонентыРаздела(УправляемаяФорма, Раздел, ВидКомпонента = Неопределено, Дополнительно = Неопределено) Экспорт
	
	МассивПодстрокРаздела = СтрРазделить(Раздел, ".", Ложь); 
	Если МассивПодстрокРаздела.Количество() = 1 Тогда 
		Отбор = Новый Структура("Раздел", Раздел); 	
	Иначе    
		Отбор = Новый Структура("Раздел, Секция", СокрЛП(МассивПодстрокРаздела[0]), СокрЛП(МассивПодстрокРаздела[1]));					
	КонецЕсли; 
	
	Если ВидКомпонента <> Неопределено Тогда
		Отбор.Вставить("ВидКомпонента", ВидКомпонента);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Дополнительно) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Отбор, Дополнительно, Ложь);		
	КонецЕсли;
	
	Возврат УправляемаяФорма.КомпонентыПМФ.НайтиСтроки(Отбор);
	
КонецФункции

// Проверяет наличие компонентов по разделу
//
// Параметры:
//  Форма	 - Форма - исходная форма
//  Раздел	 - Строка	 - имя раздела  
//  Компоненты		 - Строка	 - строка имен компонентов
//  ВидКомпонента	 - Число	 - 0 - Реквизит, 1 - путь к данным,  2 - ЭлементФормы, 3 - команда
// 
// Возвращаемое значение:
//   - Массив - список имен найденных компонентов
//
Функция ПроверитьНаличиеКомпонентовПоРазделу(УправляемаяФорма, Раздел, Компоненты, ВидКомпонента = 0) Экспорт
	
	Результат 			= Новый Массив;  
	ПроверяемыйМассив	= СтрРазделить(Компоненты, ",", Ложь); 	
	
	Если ЗначениеЗаполнено(Раздел) Тогда	
		
		МассивПодстрокРаздела = СтрРазделить(Раздел, ".", Ложь); 
		Если МассивПодстрокРаздела.Количество() = 1 Тогда 
			Отбор = Новый Структура("Раздел, ВидКомпонента", Раздел, ВидКомпонента); 	
		Иначе    
			Отбор = Новый Структура("Раздел, Секция, ВидКомпонента", СокрЛП(МассивПодстрокРаздела[0]), СокрЛП(МассивПодстрокРаздела[1]), ВидКомпонента);					
		КонецЕсли; 		
		
	Иначе
		Отбор = Новый Структура("ВидКомпонента", ВидКомпонента);		
	КонецЕсли;	
	
	КомпонентыПМФ = УправляемаяФорма.КомпонентыПМФ.НайтиСтроки(Отбор);
	                                  	
	Если ВидКомпонента = 0 ИЛИ ВидКомпонента = 1 ИЛИ ВидКомпонента = 2 Тогда
		ИмяКолонки = "ИмяКомпонента"; 	
	Иначе
		ИмяКолонки = "ПутьКДанным";	
	КонецЕсли;
	               
	Для каждого Ит Из КомпонентыПМФ Цикл
		Если ПроверяемыйМассив.Найти(Ит[ИмяКолонки]) <> Неопределено Тогда
			Результат.Добавить(Ит[ИмяКолонки]);	
		КонецЕсли;		
	КонецЦикла;
	       
	Возврат Результат;
	
КонецФункции

// Удаляет реквизиты и элементы формы, очищает информацию по разделу 
//
// Параметры:    
//  Форма		 				- Форма	 	 - исходная форма 
//  Раздел						- Строка	 - имя раздела    
//  ВидКомпонента		 		- Число	 	 - 0 - реквизит, 1 - элемент формы, 2 - команда формы 
//  РеквизитыКУдалению	 		- Массив	 - массив удаляемых реквизитов для удаления вне этой процедуры
//
Процедура УдалитьКомпонентыРазделаПМФ(УправляемаяФорма, Раздел, ВидКомпонента = Неопределено, РеквизитыКУдалению = Неопределено) Экспорт
	
	ЭлементыФормы 		= УправляемаяФорма.Элементы;    
	Команды				= УправляемаяФорма.Команды;   
	Количество			= 0;  
	УдалятьРеквизиты 	= РеквизитыКУдалению = Неопределено; 
	МассивРеквизитов	= ?(УдалятьРеквизиты, Новый Массив, РеквизитыКУдалению);
	
	Если ЗначениеЗаполнено(Раздел) Тогда	
		
		МассивПодстрокРаздела = СтрРазделить(Раздел, ".", Ложь); 
		Если МассивПодстрокРаздела.Количество() = 1 Тогда 
			Отбор = Новый Структура("Раздел", Раздел); 	
		Иначе    
			Отбор = Новый Структура("Раздел, Секция", СокрЛП(МассивПодстрокРаздела[0]), СокрЛП(МассивПодстрокРаздела[1]));					
		КонецЕсли; 
		
		Если ВидКомпонента <> Неопределено Тогда
			Отбор.Вставить("ВидКомпонента", ВидКомпонента);	
		КонецЕсли;
		
		СтрокиКомпонентыПМФ = УправляемаяФорма.КомпонентыПМФ.НайтиСтроки(Отбор);
		
	Иначе
		СтрокиКомпонентыПМФ = УправляемаяФорма.КомпонентыПМФ;		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СтрокиКомпонентыПМФ) Тогда 				
		
		Для каждого Ит Из СтрокиКомпонентыПМФ Цикл
			
			Если Ит.ВидКомпонента = 0 Тогда  	
				ПутьКданным = ?(ЗначениеЗаполнено(Ит.ПутьКДанным), Ит.ПутьКДанным + ".", "") + Ит.ИмяКомпонента;
				МассивРеквизитов.Добавить(ПутьКданным);				
			КонецЕсли;
			
			Если Ит.ВидКомпонента = 1 Тогда	
				Попытка
					ЭлементыФормы.Удалить(ЭлементыФормы[Ит.ИмяКомпонента]);	
				Исключение  			    
				КонецПопытки;								
			КонецЕсли; 							
				
			Если Ит.ВидКомпонента = 2 Тогда
				Команды.Удалить(Команды[Ит.ИмяКомпонента]);				
			КонецЕсли;
			
		КонецЦикла;		 			 
		
		Для каждого Ит Из СтрокиКомпонентыПМФ Цикл
			УправляемаяФорма.КомпонентыПМФ.Удалить(Ит);	
		КонецЦикла;  
		
		Если УдалятьРеквизиты И ЗначениеЗаполнено(МассивРеквизитов) Тогда  		
			УправляемаяФорма.ИзменитьРеквизиты(, МассивРеквизитов);						
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область Прочее

// Сравнивает прочитанный объект и данные в информационной базе.	
//
// Параметры:
//  ТекущийОбъект		 - ДокументОбъект, СправочникОбъект	 	- объект ссылочного типа
//  ОписаниеИзменений	 - Структура	 			- структура изменений 
//  Реквизиты			 - Строка, МассивСтрок	 	- реквизиты, подлежащие контролю
//  ТабличныеЧасти		 - Структура	 - табличные части, подлежащие контролю 
//								Ключ - имя табличной части, Значение - структура:
//								"Колонки", Значение - массив строк   
//								"Показатели", Значение - массив строк                                 
//                              "ИмяТаблицы", имя временной таблицы данных табличной части текущего объекта в менеджере ВТ
//								"РежимКонтроля", Значение - число
//										РежимКонтроля - 0 не контролировать
//										РежимКонтроля - 1 контролировать указанные
//										РежимКонтроля - 2 не контролировать указанные
//											
//  Настройки			 - Структура	 -  дополнительные настройки 
//											"МенеджерВТ" - Менеджер ВТ
//											"ДетальностьИзменений" - Число (0 - без детализации, 1 - текстовое представление изменений, 2 - коллекции изменений) 
//											"РежимКонтроляРеквизитов" = РежимКонтроля 
// 
// Возвращаемое значение:
//   - Булево - признак измененности Объекта
//
Функция ЕстьИзмененияОбъектаСсылочногоТипа(ТекущийОбъект, ОписаниеИзменений, Реквизиты = Неопределено, ТабличныеЧасти = Неопределено, Настройки = Неопределено) Экспорт
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	МенеджерВТ												= Неопределено;	
	МетаданныеОбъект										= ТекущийОбъект.Метаданные(); 	
	ИмяТаблицы												= МетаданныеОбъект.ПолноеИмя();
	РеквизитыОбъекта										= МетаданныеОбъект.Реквизиты;
	СтандартныеРеквизитыОбъекта								= МетаданныеОбъект.СтандартныеРеквизиты;  	
	КолонкиШапки											= ПодготовитьТаблицуОписанияКолонок(); 	
	КолонкиТабличныхЧастей									= Новый Структура; 	
	ТекстИзменений											= "";   
	ТаблицаИзменений										= ПодготовитьТаблицуИзменений();	
	ЕстьИзмененияРеквизитов									= Ложь;
	ЕстьИзмененияТабличныхЧастей							= Ложь;
	ШаблонВыводаИзменениеТабличнойЧастиПоПоказателям		= НСтр("ru = 'Изменена табличная часть ""%1"" по показателям %2.'") + Символы.ПС;	
	ДетальностьИзменений									= 1;  	
	СмещениеРезультатСравненияТаблиц 						= 0; 
	РежимКонтроляРеквизитов 								= 1;
		
	Если Настройки <> Неопределено Тогда              
		РежимКонтроляРеквизитов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "РежимКонтроляРеквизитов", 1);
		ДетальностьИзменений 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "ДетальностьИзменений", 1);  
		МенеджерВТ              = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "МенеджерВТ"); 			 		
	КонецЕсли; 		
	
	Если РежимКонтроляРеквизитов <> 0 Тогда 	 
		
		КоллекцииМетаданныхРеквизитов = Новый Массив;
		КоллекцииМетаданныхРеквизитов.Добавить(РеквизитыОбъекта);
		КоллекцииМетаданныхРеквизитов.Добавить(СтандартныеРеквизитыОбъекта);  
		
		Если Реквизиты = Неопределено Тогда 
			
			Для каждого Коллекция Из КоллекцииМетаданныхРеквизитов Цикл
				Для каждого Реквизит Из Коллекция Цикл
					ДобавитьОписаниеКолонки(КолонкиШапки, Реквизит); 						
				КонецЦикла;	
			КонецЦикла; 
			
		Иначе   	
							
			Если РежимКонтроляРеквизитов = 2 Тогда 
				
				Для каждого Коллекция Из КоллекцииМетаданныхРеквизитов Цикл
					Для каждого Реквизит Из Коллекция Цикл
						Если Реквизиты.Найти(Реквизит.Имя) = Неопределено Тогда
							ДобавитьОписаниеКолонки(КолонкиШапки, Реквизит);		
						КонецЕсли;  			 						
					КонецЦикла; 
				КонецЦикла;
				
			Иначе  				
				Для каждого Ит Из Реквизиты Цикл
					ДобавитьОписаниеКолонки(КолонкиШапки, ?(МетаданныеОбъект.Реквизиты.Найти(Ит) = Неопределено, СтандартныеРеквизитыОбъекта[Ит], РеквизитыОбъекта[Ит])); 		
				КонецЦикла;	 			
			КонецЕсли;	
			
		КонецЕсли; 
	
	КонецЕсли;
	
	Если ТабличныеЧасти = Неопределено Тогда   		
		
		Для каждого ТабличнаяЧасть Из МетаданныеОбъект.ТабличныеЧасти Цикл
			
			КолонкиТабличнойЧасти = ПодготовитьТаблицуОписанияКолонок(); 			
			Для каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
				ДобавитьОписаниеКолонки(КолонкиТабличнойЧасти, Реквизит);	
			КонецЦикла; 
			
			ДобавитьОписаниеКолонки(КолонкиТабличнойЧасти, ТабличнаяЧасть.СтандартныеРеквизиты.НомерСтроки);
			
			КолонкиТабличныхЧастей.Вставить(ТабличнаяЧасть.Имя, Новый Структура("Колонки, Показатели, ИмяТаблицыВТ", КолонкиТабличнойЧасти));
			
		КонецЦикла; 
		
		СмещениеРезультатСравненияТаблиц = МетаданныеОбъект.ТабличныеЧасти.Количество();
		
	Иначе
		
		Для каждого ДанныеТабличнойЧасти Из ТабличныеЧасти Цикл
			
			Колонки  									= Неопределено;
			СписокПоказателей 							= Неопределено;
			РежимКонтроля								= Неопределено;  
			ИмяТаблицыВТ								= Неопределено;
			ИмяТабличнойЧасти 							= ДанныеТабличнойЧасти.Ключ;
			ОписаниеТабличнойЧасти 						= ДанныеТабличнойЧасти.Значение;
			МетаданныеТабличнойЧасти					= МетаданныеОбъект.ТабличныеЧасти[ИмяТабличнойЧасти];
									
			Если ОписаниеТабличнойЧасти = Неопределено Тогда 			 
				
				КолонкиТабличнойЧасти = ПодготовитьТаблицуОписанияКолонок(); 			
				Для каждого Реквизит Из МетаданныеТабличнойЧасти.Реквизиты Цикл
					ДобавитьОписаниеКолонки(КолонкиТабличнойЧасти, Реквизит);	
				КонецЦикла; 
				
				ДобавитьОписаниеКолонки(КолонкиТабличнойЧасти, МетаданныеТабличнойЧасти.СтандартныеРеквизиты.НомерСтроки);	
				
			Иначе
				
				Если ТипЗнч(ОписаниеТабличнойЧасти) = Тип("Массив") Тогда  					
					РежимКонтроля 	= 1;
					СписокПоказателей		= Неопределено;
					Колонки			= ОписаниеТабличнойЧасти; 					
				Иначе					
					ОписаниеТабличнойЧасти.Свойство("РежимКонтроля", РежимКонтроля);
					ОписаниеТабличнойЧасти.Свойство("Колонки", Колонки);
					ОписаниеТабличнойЧасти.Свойство("Показатели", СписокПоказателей); 
					ОписаниеТабличнойЧасти.Свойство("ИмяТаблицы", ИмяТаблицыВТ);
				КонецЕсли;       				
				
				Если РежимКонтроля = 0 Тогда
					Продолжить;	
				КонецЕсли; 				
										
				КолонкиТабличнойЧасти = ПодготовитьТаблицуОписанияКолонок();
				
				Если Колонки = Неопределено Тогда
					
					Для каждого Реквизит Из МетаданныеТабличнойЧасти.Реквизиты Цикл
						Если СписокПоказателей = Неопределено Тогда
							ДобавитьОписаниеКолонки(КолонкиТабличнойЧасти, Реквизит);
						Иначе
							Если СписокПоказателей.Найти(Реквизит.Имя) = Неопределено Тогда
								ДобавитьОписаниеКолонки(КолонкиТабличнойЧасти, Реквизит);	
							КонецЕсли; 		
						КонецЕсли;								
					КонецЦикла; 							
					
				Иначе 						
					
					Если РежимКонтроля = 2 Тогда 		
						
						Для каждого Реквизит Из МетаданныеТабличнойЧасти.Реквизиты Цикл
							Если Колонки.Найти(Реквизит.Имя) = Неопределено И (СписокПоказателей = Неопределено ИЛИ СписокПоказателей.Найти(Реквизит.Имя) = Неопределено) Тогда
								ДобавитьОписаниеКолонки(КолонкиТабличнойЧасти, Реквизит);		
							КонецЕсли;  			 						
						КонецЦикла; 							 
						
					Иначе 				
						Для каждого Ит Из Колонки Цикл
							
							Реквизит = ?(МетаданныеТабличнойЧасти.Реквизиты.Найти(Ит) = Неопределено, МетаданныеТабличнойЧасти.СтандартныеРеквизиты[Ит], (МетаданныеТабличнойЧасти.Реквизиты[Ит]));
							
							Если СписокПоказателей = Неопределено Тогда
								ДобавитьОписаниеКолонки(КолонкиТабличнойЧасти, Реквизит);
							Иначе
								Если СписокПоказателей.Найти(Реквизит.Имя) = Неопределено Тогда
									ДобавитьОписаниеКолонки(КолонкиТабличнойЧасти, Реквизит);	
								КонецЕсли; 		
							КонецЕсли;  								
							
						КонецЦикла;  							
					КонецЕсли;	
					
				КонецЕсли; 	
				
				Если СписокПоказателей = Неопределено Тогда
					ДобавитьОписаниеКолонки(КолонкиТабличнойЧасти, МетаданныеТабличнойЧасти.СтандартныеРеквизиты.НомерСтроки);	
				КонецЕсли;   							
			
			КонецЕсли; 			
						
			КолонкиТабличныхЧастей.Вставить(ИмяТабличнойЧасти, Новый Структура("Колонки, Показатели, ИмяТаблицыВТ", КолонкиТабличнойЧасти, СписокПоказателей, ИмяТаблицыВТ));
			
			Если НЕ ЗначениеЗаполнено(ИмяТаблицыВТ) Тогда
				СмещениеРезультатСравненияТаблиц = СмещениеРезультатСравненияТаблиц + 1;	
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;    	
	
	Запрос = Новый Запрос;   
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;    
	Запрос.Текст = ТекстЗапросаСравненияОбъектаСсылочногоТипа(ИмяТаблицы, КолонкиШапки, КолонкиТабличныхЧастей);
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийОбъект.Ссылка);    
	
	Для каждого Ит Из КолонкиТабличныхЧастей Цикл
		Запрос.УстановитьПараметр(Ит.Ключ, ТекущийОбъект[Ит.Ключ].Выгрузить());		
	КонецЦикла;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	  					
	Если ЗначениеЗаполнено(КолонкиШапки) И ДетальностьИзменений <> 0 Тогда 
		                 	  				
		ВыборкаШапки = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Выбрать(); 		
		
		Если ВыборкаШапки.Следующий() Тогда
			
			Для каждого СтрокаРеквизита Из КолонкиШапки Цикл
				
				ИмяРеквизита	= СтрокаРеквизита.ИмяРеквизита;
				ЗначениеБД 		= ВыборкаШапки[ИмяРеквизита];
				ЗначениеТекущее = ТекущийОбъект[ИмяРеквизита];
				
				Если ЗначениеБД <> ЗначениеТекущее Тогда 					  
					
					Если НЕ ЕстьИзмененияРеквизитов Тогда
						
						ЕстьИзмененияРеквизитов = Истина;	
						
						Если ДетальностьИзменений = 0 Тогда
							Прервать;	
						КонецЕсли;	
						
					КонецЕсли; 				
					
					Если ДетальностьИзменений = 1 Тогда 						
						ДобавитьИзменениеВСтроку(ТекстИзменений, ЗначениеБД, ЗначениеТекущее, ИмяРеквизита); 						
					ИначеЕсли ДетальностьИзменений = 2 Тогда
						ДобавитьИзмнениеВТаблицу(ТаблицаИзменений, ЗначениеБД, ЗначениеТекущее, ИмяРеквизита);	
					Иначе 						
						ДобавитьИзменениеВСтроку(ТекстИзменений, ЗначениеБД, ЗначениеТекущее, ИмяРеквизита);
						ДобавитьИзмнениеВТаблицу(ТаблицаИзменений, ЗначениеБД, ЗначениеТекущее, ИмяРеквизита);
					КонецЕсли; 					
					
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КолонкиТабличныхЧастей) Тогда
		
		Индекс = СмещениеРезультатСравненияТаблиц;
		
		Для каждого ОписаниеКолонок Из КолонкиТабличныхЧастей Цикл 				
			
			ИмяТаблицы 			= ОписаниеКолонок.Ключ;
			СписокПоказателей 	= ОписаниеКолонок.Значение.Показатели;  
			СписокКолонок		= ОписаниеКолонок.Значение.Колонки;
			РезультатТаблица 	= РезультатЗапроса[Индекс];
			
			Если НЕ РезультатТаблица.Пустой() Тогда 				
				          				
				Если НЕ ЕстьИзмененияТабличныхЧастей Тогда
					
					ЕстьИзмененияТабличныхЧастей = Истина;	
					
					Если ДетальностьИзменений = 0 Тогда
						Прервать;	
					КонецЕсли;	
					
				КонецЕсли;				
				
				Если ЗначениеЗаполнено(СписокПоказателей) Тогда 
					ТекстИзменений = ТекстИзменений + СтрШаблон(ШаблонВыводаИзменениеТабличнойЧастиПоПоказателям, ИмяТаблицы, СтрСоединить(СписокПоказателей, ","));	
				Иначе  				
					
					ВыборкаИзмененийТабличнойЧасти 	= РезультатТаблица.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаИзмененийТабличнойЧасти.Следующий() Цикл
					
						Выборка = ВыборкаИзмененийТабличнойЧасти.Выбрать();	
						
						Если Выборка.Количество() = 2 Тогда
							
							Выборка.Следующий();
							СтрокаТабличнойЧасти = Новый Структура;
							
							Для каждого Ит Из СписокКолонок Цикл  							
								СтрокаТабличнойЧасти.Вставить(Ит.ИмяРеквизита, Выборка[Ит.ИмяРеквизита]);	
							КонецЦикла;
							
							Выборка.Следующий();
							
							Для каждого Ит Из СписокКолонок Цикл  
								
								ИмяКолонки = Ит.ИмяРеквизита;								
								
								Если Выборка[ИмяКолонки] <> СтрокаТабличнойЧасти[ИмяКолонки] Тогда
									                  						
									Если Выборка._СГПоле = 1 Тогда										
										ЗначениеТекущее = Выборка[ИмяКолонки];
										ЗначениеБД      = СтрокаТабличнойЧасти[ИмяКолонки]; 										
									Иначе    										
										ЗначениеТекущее = СтрокаТабличнойЧасти[ИмяКолонки];
										ЗначениеБД      = Выборка[ИмяКолонки]; 											
									КонецЕсли; 									
																		
									Если ДетальностьИзменений = 1 Тогда 						
										ДобавитьИзменениеВСтроку(ТекстИзменений, ЗначениеБД, ЗначениеТекущее, ИмяКолонки, ИмяТаблицы, Выборка.НомерСтроки); 						
									ИначеЕсли ДетальностьИзменений = 2 Тогда
										ДобавитьИзмнениеВТаблицу(ТаблицаИзменений, ЗначениеБД, ЗначениеТекущее, ИмяКолонки, ИмяТаблицы, Выборка.НомерСтроки);	
									Иначе
										ДобавитьИзменениеВСтроку(ТекстИзменений, ЗначениеБД, ЗначениеТекущее, ИмяКолонки, ИмяТаблицы, Выборка.НомерСтроки);
										ДобавитьИзмнениеВТаблицу(ТаблицаИзменений, ЗначениеБД, ЗначениеТекущее, ИмяКолонки, ИмяТаблицы, Выборка.НомерСтроки);
									КонецЕсли;
									
								КонецЕсли; 
								
							КонецЦикла;   
							
						Иначе
							
							Если Выборка.Следующий() Тогда
								
								Если ДетальностьИзменений = 1 Тогда 						
									ДобавитьИзменениеВСтроку(ТекстИзменений, Неопределено, Неопределено, Выборка._СГПоле, ИмяТаблицы, Выборка.НомерСтроки); 						
								ИначеЕсли ДетальностьИзменений = 2 Тогда
									ДобавитьИзмнениеВТаблицу(ТаблицаИзменений, Неопределено, Неопределено, Выборка._СГПоле, ИмяТаблицы, Выборка.НомерСтроки);	
								Иначе
									ДобавитьИзменениеВСтроку(ТекстИзменений, Неопределено, Неопределено, Выборка._СГПоле, ИмяТаблицы, Выборка.НомерСтроки);
									ДобавитьИзмнениеВТаблицу(ТаблицаИзменений, Неопределено, Неопределено, Выборка._СГПоле, ИмяТаблицы, Выборка.НомерСтроки);
								КонецЕсли;
								
							КонецЕсли;  							
							
						КонецЕсли;
					
					КонецЦикла; 
					
				КонецЕсли; 		
			
			КонецЕсли; 
			
			Индекс = Индекс + 1;
			
		КонецЦикла; 		
		 	
	КонецЕсли; 		
	
	ОписаниеИзменений.Вставить("ИнформацияОбИзменении", ТекстИзменений);
	ОписаниеИзменений.Вставить("ТаблицаИзменений", ТаблицаИзменений);
	  	
	Возврат ЕстьИзмененияРеквизитов ИЛИ ЕстьИзмененияТабличныхЧастей;
	
КонецФункции      

// Создает временные таблицы по переданному источнику
//
// Параметры:
//  МенеджерВТ		 - МенеджерВременныхТаблиц - менеджер временных таблиц
//  ИсточникДанных	 - Массив из Структура,Структура,ТаблицаЗначений,ТабличнаяЧасть - источник данных для формирования временных таблиц 
//								Структура:
//								* Колонки - Строка,Массив - список колонок   
//								* Источник - ТаблицаЗначений,ТабличнаяЧасть - источник данных для формирования временной таблицы                                 
//                              * ИмяТаблицы - Строка - имя временной таблицы
//
Процедура СоздатьВременнуюТаблицуПоИсточникуДанных(МенеджерВТ, ИсточникДанных) Экспорт
	
	ТекстыЗапроса			= Новый Массив;
	ИндексТаблицы 			= 0; 
	ТипИсточника 			= ТипЗнч(ИсточникДанных);     
	КоллекцияИсточников		= Новый Массив;  
	ШаблонКолонкиВыборки 	= Символы.Таб + "Таблица.%1 КАК %1";
	ШаблонТекстаЗапроса 	= 
	"ВЫБРАТЬ  
	|%1
	|ПОМЕСТИТЬ %2
	|ИЗ
	|	&Таблица_%3 КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////"; 
	
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Если ТипИсточника = Тип("Структура") Тогда
		КоллекцияИсточников.Добавить(ИсточникДанных);	
	ИначеЕсли ТипИсточника = Тип("Массив") Тогда
		КоллекцияИсточников = ИсточникДанных;	
	Иначе 	 
		
		Если ТипИсточника = Тип("ТаблицаЗначений") Тогда 
			Источник = ИсточникДанных;	 		
		Иначе
			Источник = ИсточникДанных.Выгрузить();			
		КонецЕсли;
		
		ОписаниеИсточника = Новый Структура;	
		ОписаниеИсточника.Вставить("ИмяТаблицы", "Вт_Таблица");
		ОписаниеИсточника.Вставить("Источник", Источник); 
		ОписаниеИсточника.Вставить("Колонки", Источник.Колонки);
		
		КоллекцияИсточников.Добавить(ОписаниеИсточника);
				
	КонецЕсли;
	
	Для каждого Ит Из КоллекцияИсточников Цикл   		
		
		КолонкиВыборки 		= Новый Массив;   
		ТипИсточникаКолонок = ТипЗнч(Ит.Колонки);
		
		Если ТипИсточникаКолонок = Тип("КоллекцияКолонокТаблицыЗначений") Тогда   
			Для каждого Колонка Из Ит.Колонки Цикл 
				КолонкиВыборки.Добавить(СтрШаблон(ШаблонКолонкиВыборки, Колонка.Имя));  					
			КонецЦикла;	
		ИначеЕсли ТипИсточникаКолонок = Тип("ОбъектМетаданных") Тогда
			
			Для каждого Колонка Из Ит.Колонки.Реквизиты Цикл 
				КолонкиВыборки.Добавить(СтрШаблон(ШаблонКолонкиВыборки, Колонка.Имя));  					
			КонецЦикла;	 
			
			Для каждого Колонка Из Ит.Колонки.СтандартныеРеквизиты Цикл 
				КолонкиВыборки.Добавить(СтрШаблон(ШаблонКолонкиВыборки, Колонка.Имя));  					
			КонецЦикла;
			
		ИначеЕсли ТипИсточникаКолонок = Тип("Строка") Тогда	 
			МассивКолонок = СтрРазделить(Ит.Колонки, ",", Ложь);
			Для каждого Колонка Из МассивКолонок Цикл 
				КолонкиВыборки.Добавить(СтрШаблон(ШаблонКолонкиВыборки, Колонка));  					
			КонецЦикла;	
		Иначе
			Для каждого Колонка Из Ит.Колонки Цикл 
				КолонкиВыборки.Добавить(СтрШаблон(ШаблонКолонкиВыборки, Колонка));  					
			КонецЦикла;	
		КонецЕсли;  	
		
		ТекстВыборкаКолонки = СтрСоединить(КолонкиВыборки, "," + Символы.ПС);
		ТекстЗапроса 		= СтрШаблон(ШаблонТекстаЗапроса, ТекстВыборкаКолонки, Ит.ИмяТаблицы, ИндексТаблицы);
		
		ТекстыЗапроса.Добавить(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("Таблица_" + ИндексТаблицы, Ит.Источник);  
		
		ИндексТаблицы = ИндексТаблицы + 1;
		
	КонецЦикла;  
	
	Запрос.Текст = СтрСоединить(ТекстыЗапроса, Символы.ПС);			
	Запрос.Выполнить();	
	
КонецПроцедуры    

// Создает дерево соответствий по указанным значениям колонок
//
// Параметры:
//  КоллекцияСтрок			 - ТаблицаЗначений	 - источник данных
//  ИменаКолонок			 - Строка	 - строка с колонками группировки
//  СтрокаСвойств			 - Строка	 - строка с колонками значений
//  ИсключатьПустыеЗначения	 - Булево	 - признак исключения пустых значений ключей
//  МС_СМ					 - Число	 - признак типа результат: 0 - структура или 1 - соответствие (массив структура или структура массивов)
// 
// Возвращаемое значение:
//   - Соответствие - дерево соответствий
//
Функция СоздатьКоллекциюСтрокПоУникальнымЗначениямКолонок(КоллекцияСтрок, ИменаКолонок, СтрокаСвойств = "", ИсключатьПустыеЗначения = Истина, МС_СМ = 0) Экспорт
	
	Результат 				= Новый Соответствие;
	ИспользоватьСтруктуру 	= МС_СМ = 1 И ЗначениеЗаполнено(СтрокаСвойств);
	
	Если ТипЗнч(ИменаКолонок) = Тип("Строка") Тогда
		МассивИменКолонок = СтрРазделить(ИменаКолонок, ",", Ложь);	
	Иначе
		МассивИменКолонок = ИменаКолонок;	
	КонецЕсли;	
	
	КрайнийИндекс = МассивИменКолонок.ВГраница();
	
	Для каждого СтрокаКоллекции Из КоллекцияСтрок Цикл
		
		ТекущаяКоллекция = Результат;
		
		Для Индекс = 0 По КрайнийИндекс Цикл
			
			ИмяКолонки 			= СокрЛП(МассивИменКолонок[Индекс]);
			Значение 			= СтрокаКоллекции[ИмяКолонки];
			ЭлементКоллекции 	= ТекущаяКоллекция[Значение];
			
			Если ИсключатьПустыеЗначения И НЕ ЗначениеЗаполнено(Значение) Тогда
				Продолжить;	
			КонецЕсли; 
			
			Если Индекс = КрайнийИндекс Тогда 				
				
				Если ЭлементКоллекции = Неопределено Тогда 					
										
					Если ИспользоватьСтруктуру Тогда  
						
						КоллекцияЗначений = Новый Структура(СтрокаСвойств); 
						
						Для каждого Ит Из КоллекцияЗначений Цикл
							КоллекцияЗначений.Вставить(Ит.Ключ, Новый Массив);	
						КонецЦикла;   					
						
					Иначе
						КоллекцияЗначений = Новый Массив;							
					КонецЕсли;   				
					
					ТекущаяКоллекция.Вставить(Значение, КоллекцияЗначений); 
					
				Иначе
					КоллекцияЗначений = ЭлементКоллекции;		
				КонецЕсли;				
				
				Если ИспользоватьСтруктуру Тогда  				       				
					Для каждого Ит Из КоллекцияЗначений Цикл
						КоллекцияЗначений[Ит.Ключ].Добавить(СтрокаКоллекции[Ит.Ключ]);	
					КонецЦикла;						
				Иначе
					
					Если ЗначениеЗаполнено(СтрокаСвойств) Тогда	
						Если СтрНайти(СтрокаСвойств, ",") > 0 Тогда
							ЗначениеМассива = Новый Структура(СтрокаСвойств);
							ЗаполнитьЗначенияСвойств(ЗначениеМассива, СтрокаКоллекции);	
						Иначе	
							ЗначениеМассива = СтрокаКоллекции[СокрЛП(СтрокаСвойств)];
						КонецЕсли;						
					Иначе
						ЗначениеМассива = СтрокаКоллекции;		
					КонецЕсли; 	
					
					КоллекцияЗначений.Добавить(ЗначениеМассива);	
					
				КонецЕсли;
				
			Иначе
				
				Если ЭлементКоллекции = Неопределено Тогда					
					Коллекция = Новый Соответствие;					
					ТекущаяКоллекция.Вставить(Значение, Коллекция);
				Иначе
					Коллекция = ЭлементКоллекции;		
				КонецЕсли;					
				
				ТекущаяКоллекция = Коллекция;
				
			КонецЕсли;			
			
		КонецЦикла; 		
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Создает строку из кодов символов строки
//
// Параметры:
//  СтрокаИсходная	 - Строка	 - исходная строка
//  Разделитель		 - СТрока	 - разделитель кодов
// 
// Возвращаемое значение:
//   - Строка - строка из кодов символов
//
Функция СтрокаИзКодовСимволов(СтрокаИсходная, Разделитель = "") Экспорт
	
	Результат = "";
	
	Для Сч = 1 По СтрДлина(СтрокаИсходная) Цикл
		Результат = Результат + Строка(Формат(КодСимвола(СтрокаИсходная, Сч), "ЧГ=0")) + Разделитель;	
	КонецЦикла; 	
	
	Результат = Лев(Результат, СтрДлина(Результат) - СтрДлина(Разделитель));
	
	Возврат Результат;
	
КонецФункции

// Дополнить строку до указанной длины
//
// Параметры:
//  ИсходнаяСтрока	 - Строка	 - исходная строка
//  Дополнение		 - Строка	 - дополняющая исходную подстрока
//  ТребуемаяДлина	 - Число	 - необходимая длина строки
//  СНачала			 - Булево 	 - признак добавление в начало
// 
// Возвращаемое значение:
//   - Строка - дополненая указаной подсрокой
//
Функция ДополнитьСтроку(ИсходнаяСтрока, Дополнение, ТребуемаяДлина, СНачала = Истина)
	
	Результат 		= ИсходнаяСтрока; 
	ДлинаСтроки 	= СтрДлина(ИсходнаяСтрока);
	ДлинаДополнения = СтрДлина(Дополнение);   
	
	Пока ДлинаСтроки < ТребуемаяДлина Цикл
		
		Если ДлинаСтроки + ДлинаДополнения > ТребуемаяДлина Тогда
			Прервать;	
		КонецЕсли;
		
		Если СНачала Тогда
			Результат = Дополнение + Результат;
		Иначе
			Результат = Результат + Дополнение;	
		КонецЕсли;  
		
		ДлинаСтроки = СтрДлина(Результат);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает дату из строки по указанному формату
//
// Параметры:
//  ФорматДаты	 - Строка	 - формат даты
//  Дано		 - Строка	 - исходная строка
//  Ошибка		 - Булево	 - признак ошибки в обработке
// 
// Возвращаемое значение:
//   - Дата - дата из строки 
//
Функция СтрокаВДату(Знач ФорматДаты, Знач Дано, Ошибка = Ложь) Экспорт 
	
	Попытка 
        СтрокаДата = Формат('00010101', "ДФ=" + ФорматДаты) // - необязательная проверка первого правильности параметра 
    Исключение 
        Ошибка = Истина; 
        Возврат '00010101'; 
    КонецПопытки; 
    Коллекция = Новый Соответствие; 
    Для СтрокаДата = 1 По СтрДлина(ФорматДаты) + 7 Цикл 
        Коллекция[Сред(ФорматДаты + "dMyHhms", СтрокаДата, 1)] = 0    // - инициализация частей даты 
    КонецЦикла; 
    Для СтрокаДата = 1 По 12 Цикл 
        Дано = СтрЗаменить(Дано, Формат(Дата(1, СтрокаДата, 1), "ДФ=MMММ"), Формат(СтрокаДата, "ЧЦ=4; ЧВН=")); // - замена названий месяцев числами 
        Дано = СтрЗаменить(Дано, Формат(Дата(1, СтрокаДата, 1), "ДФ=MMМ" ), Формат(СтрокаДата, "ЧЦ=3; ЧВН=")) 
    КонецЦикла; 
    Для СтрокаДата = 1 По СтрДлина(ФорматДаты) Цикл 
        Коллекция[Сред(ФорматДаты, СтрокаДата, 1)] = 10 * Коллекция[Сред(ФорматДаты, СтрокаДата, 1)] + СтрНайти("123456789", Сред(Дано, СтрокаДата, 1)); // - накопление частей даты 
        Ошибка = Ошибка ИЛИ СтрНайти("dMyHhms", Сред(ФорматДаты, СтрокаДата, 1)) И НЕ СтрНайти("0123456789", Сред(Дано, СтрокаДата, 1)) // - необязательная проверка на цифры 
	КонецЦикла;  
	
	Если Коллекция["y"] < 50 Тогда
		Дополнение = 2000;
	ИначеЕсли Коллекция["y"] < 100 Тогда
		Дополнение = 1900;	     
	Иначе
		Дополнение = 0;	
	КонецЕсли;
	
    Коллекция["y"] = Коллекция["y"] + Дополнение; // - дополнение двух цифр года до четырех   
	
    Попытка 
        Возврат Дата(Коллекция["y"], Коллекция["M"], Коллекция["d"], Коллекция["H"] + Коллекция["h"], Коллекция["m"], Коллекция["s"]) 
    Исключение 
        Ошибка = Истина; 
        Возврат '00010101'; 
	КонецПопытки; 
	
КонецФункции

// Создает строку csv из таблицы значений 
//
// Параметры:
//  Данные				 - ТаблицаЗначений,СтрокаТаблицыЗначений	 - источник данных
//  Разделитель			 - Строка	 - разделитель колонок 
//  ВыводитьИменаКолонок - Булево	 - признак вывода колонок
// 
// Возвращаемое значение:
//   - Строка - строка csv
//
Функция ЗначениеВТекстCSV(Данные, Разделитель = ";", ВыводитьИменаКолонок = Ложь) Экспорт
		
	Результат 	= "";
	ТипДанных 	= ТипЗнч(Данные); 
	
	Если ТипДанных = Тип("ТаблицаЗначений") Тогда
		Колонки 			= Данные.Колонки;	
		КоллекцияДанных 	= Данные;
	ИначеЕсли ТипДанных = Тип("СтрокаТаблицыЗначений") Тогда 	
		Колонки 			= Данные.Владелец().Колонки;	
		КоллекцияДанных 	= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Данные);
	Иначе
		Возврат Результат;
	КонецЕсли; 	
	
	Если ВыводитьИменаКолонок Тогда
		
		ПодготовленнаяСтрока = "";
		
		Для Каждого Колонка Из Колонки Цикл
			ПодготовленнаяСтрока = ПодготовленнаяСтрока + Колонка.Заголовок + Разделитель;
		КонецЦикла;
		
		ПодготовленнаяСтрока = Лев (ПодготовленнаяСтрока, СтрДлина(ПодготовленнаяСтрока) - 1);
		
		Результат = Результат + ПодготовленнаяСтрока + Символы.ПС;
		
	КонецЕсли; 	 
	
	Для Каждого Ит Из КоллекцияДанных Цикл
		
		ПодготовленнаяСтрока = ""; 		
		
		Для Каждого Колонка Из Колонки Цикл
			
			Значение 	= Ит[Колонка.Имя];
			ТипЗначения = ТипЗнч(Значение);
			
			Если ТипЗначения = Тип("Число") Тогда
				ПреобразованноеПоле = Формат(Значение, "ЧРД=,; ЧГ=0");	
			Иначе
				ПреобразованноеПоле = Строка(Ит[Колонка.Имя]);	
			КонецЕсли; 			
			
			// По правилам CSV если поле содержит двойные кавычки они должны повторятся дважды
			Если СтрНайти(ПреобразованноеПоле, """") Тогда
				ПреобразованноеПоле = СтрЗаменить(ПреобразованноеПоле, """", """""");
			КонецЕсли;
			
			// По правилам CSV если поле содержит перенос строки или запятую оно должно заключатся в двойные кавычки
			Если СтрНайти(ПреобразованноеПоле, Разделитель) ИЛИ СтрНайти(ПреобразованноеПоле, Символы.ПС) ИЛИ СтрНайти(ПреобразованноеПоле, """") Тогда
				ПреобразованноеПоле = """" + ПреобразованноеПоле + """";
			КонецЕсли;

			ПодготовленнаяСтрока = ПодготовленнаяСтрока + ПреобразованноеПоле + Разделитель;
			
		КонецЦикла;
		
		ПодготовленнаяСтрока = Лев(ПодготовленнаяСтрока, СтрДлина(ПодготовленнаяСтрока) - 1);
		
		Результат = Результат + ПодготовленнаяСтрока + Символы.ПС;
		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции  

// Проверяет наличие объектов с указанным значением реквизита
//
// Параметры:
//  ОбъектыИБ	 - Массив	 - массив объектов БД
//  ИмяРеквизита - Строка	 - имя проверяемого реквизита
//  Значение	 - Произвольный	 - проверяемое значение
// 
// Возвращаемое значение:
//   - Булево - результат проверки
//
Функция ЕстьЗначениеРеквизитаВКоллекцииОбъектовИБ(ОбъектыИБ, ИмяРеквизита, Значение) Экспорт
	           	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		МассивЗначений = Значение;
	Иначе
		МассивЗначений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Значение);	
	КонецЕсли; 
	
	Данные = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ОбъектыИБ, ИмяРеквизита);
	
	Для каждого Ит Из Данные Цикл 			 
		Если МассивЗначений.Найти(Ит.Значение) <> Неопределено Тогда
			Возврат Истина;			
		КонецЕсли; 	
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции
 
// Получает строку по аналогии синонима из имени
//
// Параметры:
//  ИсходнаяСтрока	 - Строка	 - исходная строка
//  Разделитель		 - Строка	 - разделитель слов 
// 
// Возвращаемое значение:
//   - Строка - разделенная по словам строка
//
Функция ЗРег(Знач ИсходнаяСтрока, Разделитель = " ") Экспорт
	
	Результат = "";
	
	Для Сч = 1 По СтрДлина(ИсходнаяСтрока)  Цикл
		
		ТекСимвол = Сред(ИсходнаяСтрока, Сч, 1);		
		
		Если ПустаяСтрока(Результат) Тогда 
			ТекСимвол = ВРег(ТекСимвол);	
		Иначе
			Если ТекСимвол = ВРег(ТекСимвол) Тогда 		
				Результат = Результат + Разделитель;
				ТекСимвол = НРег(ТекСимвол);
			КонецЕсли;	
		КонецЕсли;		 
		
		Результат = Результат + ТекСимвол; 
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Вычисляет значение идентификатора из строки соответствии с правилами именования идентификаторов.
// 
// Параметры:
// 	СтрНаименование - Строка - 
// 	
// Возвращаемое значение:
// 	Строка - Идентификатор, соответствующий правилам именования идентификаторов.
//
Функция ПолучитьИдентификатор(СтрНаименование) Экспорт
	
	Разделители	=  ".,+,-,/,*,?,=,<,>,(,)%!@#$%&*""№:;{}[]?()\|/`~'^_";
	
	Идентификатор 	= "";
	БылСпецСимвол 	= Ложь;  
	БылПробел 		= Ложь;
	
	Для НомСимвола = 1 По СтрДлина(СтрНаименование) Цикл
		
		Символ = Сред(СтрНаименование, НомСимвола, 1);
		
		Если СтрНайти(Разделители, Символ) <> 0 Тогда
			БылСпецСимвол = Истина; 
		ИначеЕсли Символ = " " Тогда 
			Если НЕ БылПробел Тогда  
				Идентификатор = Идентификатор + "_";
				БылПробел = Истина;	
			КонецЕсли;
		ИначеЕсли БылСпецСимвол Тогда 
			БылПробел 		= Ложь;
			БылСпецСимвол 	= Ложь;
			Идентификатор 	= Идентификатор + ВРег(Символ);
		Иначе    
			БылПробел 	  = Ложь;
			Идентификатор = Идентификатор + Символ;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Идентификатор;
	
КонецФункции

// Возвращает соответствие, где Ключ - полное имя метаданных, Значение - массив объектов этих метаданных 
//
// Параметры:
//  МассивОбъектовИБ	 - Массив	 - исходный массив объектов ИБ
//  МассивИменМетаданных - Массив	 - массив метаданных
// 
// Возвращаемое значение:
//   - Соответствие - соответствие имен метаданных и объектов
//
Функция СоответствиеПоПолномуИмениМетаданных(МассивОбъектовИБ, МассивИменМетаданных = Неопределено) Экспорт
	
	Результат = Новый Соответствие;
	
	Если МассивИменМетаданных = Неопределено Тогда
		МассивИменМетаданных = Новый Массив;		
	КонецЕсли;  	
	
	Для каждого Ит Из МассивОбъектовИБ Цикл
		
		ИмяМетаданных = Ит.Метаданные().ПолноеИмя();
		ЭлементМассив = Результат.Получить(ИмяМетаданных);
		
		Если ЭлементМассив = Неопределено Тогда
			
			ЭлементМассив = Новый Массив;
			
			Результат.Вставить(ИмяМетаданных, ЭлементМассив);
			МассивИменМетаданных.Добавить(ИмяМетаданных);
			
		КонецЕсли;	
		
		ЭлементМассив.Добавить(Ит);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив, элементы которого присутствуют в исходных массивах
//
// Параметры:
//  Массив1	 - Массив	 - первый массив 
//  Массив2	 - Массив	 - второй массив
// 
// Возвращаемое значение:
//   - Массив - результирующий массив
//
Функция ПересечениеМассивов(Массив1, Массив2) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из Массив1 Цикл
		
		Если Массив2.Найти(Элемент) <> Неопределено Тогда
			
			Результат.Добавить(Элемент);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции  

// Запускает регламентное задание
//
// Параметры:
//  ИмяЗадания	 - Строка	 		- имя регламентного задания
//  Параметры	 - Произвольный	 	- параметры фонового задания 
//  ИзменятьКлюч - Булево	 		- признак изменения ключа фонового задания
// 
// Возвращаемое значение:
//   -  УникальныйИдентификатор, Неопределено - идентификатор задания
//
Функция ЗапускРегламентногоЗадания(ИмяЗадания, Параметры = Неопределено, ИзменятьКлюч = Истина) Экспорт   
	
	Результат 						= Неопределено;
	РегламентноеЗаданиеМетаданные 	= Метаданные.РегламентныеЗадания[ИмяЗадания];
	ИмяМетода 						= РегламентноеЗаданиеМетаданные.ИмяМетода;
	
	Если Параметры = Неопределено Тогда
		Ключ 				= РегламентноеЗаданиеМетаданные.Ключ;	
		ПараметрыЗадания 	= РегламентноеЗаданиеМетаданные.Параметры;
	Иначе
		ПараметрыЗадания 	= ?(ТипЗнч(Параметры) = Тип("Массив"), Параметры, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметры));		
		Ключ				= ?(ИзменятьКлюч, ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Параметры), РегламентноеЗаданиеМетаданные.Ключ);  	
	КонецЕсли; 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", ИмяМетода);    
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно); 
	
	Если ИзменятьКлюч Тогда
		Отбор.Вставить("Ключ", Ключ);	
	КонецЕсли;
	                                          
	СписокЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	Если СписокЗаданий.Количество() = 0 Тогда  	
		НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = 'Запуск вручную: %1'"), РегламентноеЗаданиеМетаданные.Синоним);		
		Задание 					= ФоновыеЗадания.Выполнить(ИмяМетода, ПараметрыЗадания, Ключ, НаименованиеФоновогоЗадания);   
		Результат 					= Задание.УникальныйИдентификатор; 		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции  

// Получает массив, содержащий ключи структуры.
//
// Параметры:
//  Структура - Структура - структура, ключи которой преобразуются в массив.
//
// Возвращаемое значение:
//  Массив - массив, содержащий ключи структуры.
//
Функция КлючиСтруктурыВМассив(Структура) Экспорт
	
	Результат = Новый Массив;
	
	Для Каждого Элемент Из Структура Цикл   
		Результат.Добавить(Элемент.Ключ);		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции



// Преобразует массив структур в таблицу значений. При необходимости ограничивает набор колонок.
//
// Параметры:
//   КоллекцияСтруктур - Массив из Структура - массив структур для преобразования
//   Колонки - Строка - имена колонок через запятую, которые должны быть включены в результат
//           - Неопределено - включаются все колонки по ключам структур
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица значений, заполненная данными из массива структур
//   - Неопределено - если передан пустой массив или неопределено
Функция МассивСтруктурВТаблицуЗначений(КоллекцияСтруктур, Колонки = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(КоллекцияСтруктур) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Результат = Новый ТаблицаЗначений;  	 
	
	Если ЗначениеЗаполнено(Колонки) Тогда
		
		КонтрольКолонок 	= Неопределено;
		ОписаниеКолонок 	= Новый Структура(Колонки);  
		
		Для каждого Элемент Из ОписаниеКолонок Цикл
			ОписаниеКолонок.Вставить(Элемент.Ключ, Новый Массив);	
		КонецЦикла;  	
		
	Иначе
		КонтрольКолонок 	= Новый Соответствие;
		ОписаниеКолонок 	= Новый Структура;	
	КонецЕсли;	
	
	Если КонтрольКолонок = Неопределено  Тогда   
		
		// список колонок известен
		
		Для каждого ОписаниеКолонки Из ОписаниеКолонок Цикл
			
			ДобавитьСтроки	= НЕ ЗначениеЗаполнено(Результат);
			ИмяКолонки  	= ОписаниеКолонки.Ключ;
			ТипыКолонки 	= Новый Массив;	 
			ЗначенияКолонки = Новый Массив;
			 		
			Для Каждого ТекущаяСтруктура Из КоллекцияСтруктур Цикл   			
				
				Значение = ТекущаяСтруктура[ИмяКолонки];
				
				ТипыКолонки.Добавить(ТипЗнч(Значение));	
				ЗначенияКолонки.Добавить(Значение);
				
				Если ДобавитьСтроки Тогда
					Результат.Добавить();	
				КонецЕсли;				
				
			КонецЦикла;	
			
			ТипыКолонки			= ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТипыКолонки);
			ОписаниеТипаКолонки = Новый ОписаниеТипов(ТипыКолонки);
			
			Результат.Колонки.Добавить(ИмяКолонки, ОписаниеТипаКолонки); 
			
			ОписаниеКолонок.Вставить(ИмяКолонки, ЗначенияКолонки);
			             	
		КонецЦикла;		
		
	Иначе  
		
		// список колонок определяется по ключам структур 
		
		Для Индекс = 0 По КоллекцияСтруктур.Количество() - 1 Цикл   			
			                       		
			Для каждого Элемент Из КоллекцияСтруктур[Индекс] Цикл
				
				Значение	= Элемент.Значение;
				ТипЗначения	= ТипЗнч(Значение);
				ИмяКолонки 	= Элемент.Ключ;
				
				ТипыКолонки = КонтрольКолонок.Получить(ИмяКолонки);
				
				Если ТипыКолонки = Неопределено Тогда  
					КонтрольКолонок.Вставить(ИмяКолонки, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗначения)); 
					ОписаниеКолонок.Вставить(ИмяКолонки, Новый Массив);
				Иначе
					ТипыКолонки.Добавить(ТипЗначения);				
				КонецЕсли;
				
				ОписаниеКолонок[ИмяКолонки].Вставить(Индекс, Значение);
				
			КонецЦикла;
			
			Результат.Добавить();									
			
		КонецЦикла; 
		
		Для каждого Элемент Из КонтрольКолонок Цикл  
			ТипыКолонки			= ОбщегоНазначенияКлиентСервер.СвернутьМассив(Элемент.Значение);
			ОписаниеТипаКолонки = Новый ОписаниеТипов(ТипыКолонки);
			Результат.Колонки.Добавить(Элемент.Ключ, ОписаниеТипаКолонки);		
		КонецЦикла;
		
	КонецЕсли;
	
	Для каждого Элемент Из ОписаниеКолонок Цикл
		Результат.ЗагрузитьКолонку(Элемент.Значение, Элемент.Ключ);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Создает массив структур по образу дерева значений
//
// Параметры:
//  МассивСтрок				 - Массив - массив-результат, содержит описания строк
//  Дерево					 - ДеревоЗначений - исходное дерево значений
//  КлючиСтруктурыСтрокой	 - Строка - список колонок дерева
//  КлючМассиваСтрок		 - Строка - имя поля, содержащего строки
//
Процедура ДеревоЗначенийВМассивСтруктур(МассивСтрок, Дерево, КлючиСтруктурыСтрокой, КлючМассиваСтрок = "Строки") Экспорт
	
	Для Каждого ТекущийУзел Из Дерево.Строки Цикл  		
		
		ОписаниеСтроки = Новый Структура(КлючиСтруктурыСтрокой);		
		ОписаниеСтроки.Вставить(КлючМассиваСтрок);		
		
		ЗаполнитьЗначенияСвойств(ОписаниеСтроки, ТекущийУзел);
		
		МассивСтрок.Добавить(ОписаниеСтроки, Новый Массив);
		
		Если ТекущийУзел.Строки.Количество() > 0 Тогда		
			ДеревоЗначенийВМассивСтруктур(ОписаниеСтроки[КлючМассиваСтрок], ТекущийУзел, КлючиСтруктурыСтрокой, КлючМассиваСтрок);		
		КонецЕсли;		
		
	КонецЦикла; 	
	
КонецПроцедуры

// Копирует структуру и данные дерева значений из источника в приемник.
//
// Параметры:
//   Источник - ДеревоЗначений - дерево значений, из которого выполняется копирование
//   Приемник - ДеревоЗначений - дерево значений, в которое выполняется копирование
//   Очищать - Булево - очистить приемник перед копированием. По умолчанию: Истина
//
Процедура СкопироватьДеревоЗначений(Источник, Приемник, Очищать = Истина) Экспорт

	Если Очищать Тогда
		Приемник.Строки.Очистить();
		Приемник.Колонки.Очистить();
	КонецЕсли;

	Для Каждого Колонка Из Источник.Колонки Цикл
		Приемник.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;

	КопироватьСтроки(Источник.Строки, Приемник.Строки);

КонецПроцедуры

// Возвращает цвет, обратный исходному
//
// Параметры:
//  ИсходныйЦвет - Цвет	 - усходный цвет
// 
// Возвращаемое значение:
//   - Цвет - изменненый цвет
//
Функция ИнвертироватьЦвет(ИсходныйЦвет) Экспорт
	                    
	Красный = ПобитовоеНе(ИсходныйЦвет.Красный);
	Зеленый = ПобитовоеНе(ИсходныйЦвет.Зеленый);
	Синий 	= ПобитовоеНе(ИсходныйЦвет.Красный);
	
	Возврат Новый Цвет(Красный, Зеленый, Синий);
	
КонецФункции

// Преобразует адрес ресурса в структуру
//
// Параметры:
//  АдресURL - Строка - 
// 
// Возвращаемое значение:
//   - Структура
//
Функция АдресРесурсаВСтруктуру(Знач АдресURL)
	
	Результат 	= Новый Структура("Параметры, Протокол, ЗащищенныеСоединение, Сервер, Порт, ПолныйПуть, ПутьБезПараметров", Новый Структура);	
	ПРП 		= СтрНайти(АдресURL, "://"); 	
	
	Если ПРП > 0 Тогда 
		Результат.Протокол 				= НРег(Лев(АдресURL, ПРП - 1));	
		АдресURL 						= Прав(АдресURL, СтрДлина(АдресURL) - 2 - ПРП);  
		Результат.ЗащищенныеСоединение 	= СтрЗаканчиваетсяНа(Результат.Протокол, "s");
	Иначе
		Результат.ЗащищенныеСоединение  = Ложь;
	КонецЕсли;  
	
	ПС				= СтрНайти(АдресURL, "/");
	Сервер 			= Лев(АдресURL, ПС - 1);	
	
	ПДв = СтрНайти(Сервер, ":");
	Если ПДв > 0 Тогда 
		Результат.Сервер 	= Лев(Сервер, ПДв - 1);
		Результат.Порт 		= Прав(Сервер, СтрДлина(Сервер) - 2 - ПДв);
	Иначе
		Результат.Сервер 	= Сервер;
		Результат.Порт 		= Неопределено;
	КонецЕсли; 	
	
	АдресURL					= Прав(АдресURL, СтрДлина(АдресURL) - ПС + 1);
	Результат.ПолныйПуть 		= АдресURL;
	ПВЗ							= СтрНайти(АдресURL, "?");
	
	Если ПВЗ > 0 Тогда 	
		
		Результат.ПутьБезПараметров = Лев(АдресURL, ПВЗ - 1);
		АдресURL					= Прав(АдресURL, СтрДлина(АдресURL) - ПВЗ);
		МассивСтрок					= СтрРазделить(АдресURL, "&");  
		
		Для каждого Ит Из МассивСтрок Цикл   		
			ПЗР = СтрНайти(Ит, "=");
			Результат.Параметры.Вставить(Лев(Ит, ПЗР - 1), Прав(Ит, СтрДлина(Ит) - ПЗР)); 		
		КонецЦикла; 
		
	Иначе	
		Результат.ПутьБезПараметров = АдресURL;	
	КонецЕсли; 		
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьЗаписиРегистра(ВыборкаЗаписей, МенеджерРегистра, КолонкиОтбора = Неопределено, КоличествоВТранзакции = 0) Экспорт
	
	НПП 			= 0;
	МассивИзмерений = ?(ЗначениеЗаполнено(КолонкиОтбора), СтрРазделить(КолонкиОтбора, ",", Ложь), Неопределено);
	
	Если КоличествоВТранзакции = 0 Тогда
		Если МассивИзмерений = Неопределено Тогда
			
			Набор = МенеджерРегистра.СоздатьНаборЗаписей();
			
			Пока ВыборкаЗаписей.Следующий() Цикл			
				ЗаполнитьЗначенияСвойств(Набор.Добавить(), ВыборкаЗаписей);		
			КонецЦикла; 		
			
			Набор.Записать(РежимЗамещения.Удаление); 
			
		Иначе
			
			Пока ВыборкаЗаписей.Следующий() Цикл
				
				Набор = МенеджерРегистра.СоздатьНаборЗаписей();
				Для каждого Измерение Из МассивИзмерений Цикл
					Набор.Отбор[Измерение].Установить(ВыборкаЗаписей[Измерение]);	
				КонецЦикла; 
				
				Набор.Записать();			
				
			КонецЦикла;	
			
		КонецЕсли; 	
	Иначе
		
		Если МассивИзмерений = Неопределено Тогда
			
			Пока ВыборкаЗаписей.Следующий() Цикл
				
				Если НПП = 0 Тогда 					
					Набор = МенеджерРегистра.СоздатьНаборЗаписей();				
				КонецЕсли;			
				
				ЗаполнитьЗначенияСвойств(Набор.Добавить(), ВыборкаЗаписей);	 			
				
				Если НПП = КоличествоВТранзакции Тогда
					
					Набор.Записать(РежимЗамещения.Удаление); 					 
					
					НПП = 0;
					
				Иначе
					НПП = НПП + 1;				
				КонецЕсли; 			
				
			КонецЦикла;	
			
			Если ЗначениеЗаполнено(Набор) Тогда  			
				Набор.Записать(РежимЗамещения.Удаление); 				
			КонецЕсли; 
			
		Иначе
			
			Пока ВыборкаЗаписей.Следующий() Цикл
				
				Если НПП = 0 Тогда
					НачатьТранзакцию();	
				КонецЕсли; 	
				
				Набор = МенеджерРегистра.СоздатьНаборЗаписей();
				Для каждого Измерение Из МассивИзмерений Цикл
					Набор.Отбор[Измерение].Установить(ВыборкаЗаписей[Измерение]);	
				КонецЦикла; 
				
				Набор.Записать();
				
				Если НПП = КоличествоВТранзакции Тогда
					
					Если ТранзакцияАктивна() Тогда
						ЗафиксироватьТранзакцию();	
					КонецЕсли; 
					
					НПП = 0;
					
				Иначе
					НПП = НПП + 1;				
				КонецЕсли; 			
				
			КонецЦикла;	
			
			Если ТранзакцияАктивна() Тогда
				ЗафиксироватьТранзакцию();	
			КонецЕсли;	
			
		КонецЕсли;  	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьЭлементыСсылочногоТипа(ВыборкаОбъектов, КоличествоВТранзакции = 0) Экспорт
	
	Если КоличествоВТранзакции = 0 Тогда
		Пока ВыборкаОбъектов.Следующий() Цикл
			Объект = ВыборкаОбъектов.Ссылка.ПолучитьОбъект();	
			Объект.Удалить();			
		КонецЦикла;	
	Иначе
		
		НПП = 0 ;
		
		Пока ВыборкаОбъектов.Следующий() Цикл
			
			Если НПП = 0 Тогда
				НачатьТранзакцию();	
			КонецЕсли; 	
			
			Объект = ВыборкаОбъектов.Ссылка.ПолучитьОбъект();	
			Объект.Удалить();
			
			Если НПП = КоличествоВТранзакции Тогда
				
				Если ТранзакцияАктивна() Тогда
					ЗафиксироватьТранзакцию();	
				КонецЕсли; 
				
				НПП = 0;
				
			Иначе
				НПП = НПП + 1;				
			КонецЕсли; 			
			
		КонецЦикла;	
		
		Если ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти 

// См. https://wonderland.v8.1c.ru/blog/novye-instrumenty-dlya-raboty-s-dvoichnymi-dannymi-obespechivayut-kak-posledovatelnyy-dostup-k-danny/
// См. https://wonderland.v8.1c.ru/blog/rasshirenie-funktsionalnosti-raboty-s-dvoichnymi-dannymi/
#Область Потоки

// Преобразует произвольный объект в двоичные данные
//
// Параметры:
//  Объект				 - Произвольный	 - произвольный объект
//  ПараметрыКонвертации - Структура	 - дополнительные параметры
// 
// Возвращаемое значение:
//   - ДвоичныеДанные - двоичные данные объекта 
//
Функция ОбъектВДвоичныеДанные(Объект, ПараметрыКонвертации = Неопределено) Экспорт	
	                          	
	Поток = Новый ПотокВПамяти();
	
	Если ПараметрыКонвертации = Неопределено Тогда
		Объект.Записать(Поток);
	Иначе
		
		ТипОбъекта = ТипЗнч(Объект);
		
		Если ТипОбъекта = Тип("ТабличныйДокумент") Тогда
			Объект.Записать(Поток, ПараметрыКонвертации.ТипФайла);	
		КонецЕсли; 
		
	КонецЕсли;
	   
	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
КонецФункции

#КонецОбласти 

#Область Метаданные
 
// Возвращает Истина, если переданный тип является ссылочным
//
// Параметры:
//  ТипЗначения	 - Тип	 - тип значения
// 
// Возвращаемое значение:
//   - Булево - признак, что тип ссылочный
//
Функция ЭтоСсылочныйТип(ТипЗначения) Экспорт
	
	Результат = Ложь;
	
	Если ТипЗначения <> Тип("Дата") И ТипЗначения <> Тип("Строка") 
			И ТипЗначения <> Тип("Число") И ТипЗначения <> Тип("Булево") Тогда  	 
	
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
		Если ОбъектМетаданных <> Неопределено Тогда   		
			
			ИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
			Позиция = СтрНайти(ИмяОбъектаМетаданных, ".");
			Если Позиция > 0 Тогда 
				ИмяБазовогоТипа = Лев(ИмяОбъектаМетаданных, Позиция - 1);
				Результат = ИмяБазовогоТипа = "Справочник"
				Или ИмяБазовогоТипа = "Документ"
				Или ИмяБазовогоТипа = "БизнесПроцесс"
				Или ИмяБазовогоТипа = "Задача"
				Или ИмяБазовогоТипа = "ПланСчетов"
				Или ИмяБазовогоТипа = "ПланОбмена"
				Или ИмяБазовогоТипа = "ПланВидовХарактеристик"
				Или ИмяБазовогоТипа = "ПланВидовРасчета"; 			 	
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает текст запроса к таблице изменений объекта ИБ
//
// Параметры:
//  МассивМетаданных		 - Массив	 - массив метаданных
//  Колонки					 - Строка	 - строка с именами колонок 
//  ОграничениеПоУзлам		 - Булево	 - признак добавления условия по узлам 
//  ДляДинамическогоСписка	 - Булево	 - признак обертывания во вложенный запрос
// 
// Возвращаемое значение:
//   - Строка - текст запроса
//
Функция ТекстЗапросаКТаблицеИзмененийОбъектов(МассивМетаданных, Колонки = "", ОграничениеПоУзлам = Истина, ДляДинамическогоСписка = Ложь) Экспорт
	
	Первый			= Истина;
	Результат 		= "";		
	ТекстКолонки	= ""; 	
	
	Если ЗначениеЗаполнено(Колонки) Тогда
		
		МассивКолонок = СтрРазделить(Колонки, ",");
		
		Для каждого Ит Из МассивКолонок Цикл  			
			ТекстКолонки = "Таблица." + Ит + "," + Символы.ПС;				 					
		КонецЦикла; 
		
		ТекстКолонки = Лев(ТекстКолонки, СтрДлина(ТекстКолонки) - 2) + Символы.ПС;
		
	Иначе
		ТекстКолонки = "Таблица.Узел КАК Узел,
	              	  	|Таблица.НомерСообщения КАК НомерСообщения,
	              	  	|Таблица.Ссылка КАК Ссылка
						|";
	КонецЕсли; 	
	
	Для каждого МетаданныеОбъекта Из МассивМетаданных Цикл
		
		Если ПравоДоступа("Просмотр", МетаданныеОбъекта) Тогда
               
			Если Не Первый Тогда
				Результат = Результат + ОбщегоНазначения.ТекстОбъединитьВсе();	
			КонецЕсли; 
			
			Результат = Результат + "ВЫБРАТЬ " + ?(Первый И НЕ ДляДинамическогоСписка, "РАЗРЕШЕННЫЕ", "") + " 
			|	" + ТекстКолонки + "
			|ИЗ
			|	" + МетаданныеОбъекта.ПолноеИмя() + ".Изменения КАК Таблица";
			
			Если ОграничениеПоУзлам Тогда
				Результат = Результат + Символы.ПС + "ГДЕ Таблица.Узел В (&Узел)" + Символы.ПС;	
			КонецЕсли;  
			
			Если Первый Тогда
				Первый = Ложь;  			
			КонецЕсли; 
		
		КонецЕсли;
		
	КонецЦикла;	 
	
	Если ДляДинамическогоСписка Тогда
		Результат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ (" + Результат + ") КАК Данные ";		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции
      
// Получает метаданные объекта по форме
//
// Параметры:
//  Форма	 - Форма, Строка	 - форма или имя формы
// 
// Возвращаемое значение:
//   -  ОбъектМетаданных - объект метаданных, владелец формы
//
Функция МетаданныеОбъектаПоФорме(Форма) Экспорт
	
	Если ТипЗнч(Форма) = Тип("Строка") Тогда
		ПолноеИмяФормы = Форма;
	Иначе
		ПолноеИмяФормы = Форма.ИмяФормы;	
	КонецЕсли;   
	
	Результат 			= Неопределено;
	МетаданныеФормы 	= Метаданные.НайтиПоПолномуИмени(ПолноеИмяФормы);
	
	Если МетаданныеФормы <> Неопределено Тогда  
		
		РодительМетаданные = МетаданныеФормы.Родитель();
		
		Если ТипЗнч(РодительМетаданные) <> Тип("ОбъектМетаданныхКонфигурация") Тогда  		
			Результат = РодительМетаданные;		
		КонецЕсли;	
		
	КонецЕсли; 	
	
	Возврат Результат;		

КонецФункции 

// Возвращает приведенное значение типа
//
// Параметры:
//  ТипЗначения	 - Тип, ОписаниеТипов	 - тип значения
//  Значение	 - Произвольный		 - приводимое к Типу значение
// 
// Возвращаемое значение:
//   - Произвольный - значение заданного типа
//
Функция ПривестиЗначениеКТипу(ТипЗначения, Значение = Неопределено) Экспорт
	
	Если ТипЗнч(ТипЗначения) = Тип("ОписаниеТипов") Тогда  
		ОписаниеТипов = ТипЗначения;
	Иначе
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗначения);
		
		ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
		
	КонецЕсли; 		
	
	Возврат ОписаниеТипов.ПривестиЗначение(Значение);
	
КонецФункции 

// Создает таблицу значений согласно переданной коллекции реквизитов
//
// Параметры:
//  МетаданныеРеквзиитов - КоллекцияОбъектовМетаданных	 - коллекция метаданных реквизитов
//  Колонки				 - Строка, Массив	 - список колонок
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - таблица с указанным списком колонок
//
Функция ИнициализироватьТаблицуПоМетаданным(МетаданныеРеквзиитов, Колонки = Неопределено) Экспорт
	                                    	
	Результат = Новый ТаблицаЗначений;	
	
	Если ТипЗнч(Колонки) = Тип("Строка") Тогда 
		СписокКолонок = СтрРазделить(Колонки, ",", Ложь);	
	ИначеЕсли ТипЗнч(Колонки) = Тип("Массив") Тогда   
		СписокКолонок = Колонки; 
	Иначе     
		СписокКолонок = Неопределено;  
	КонецЕсли; 	
	
	Если ЗначениеЗаполнено(СписокКолонок) Тогда    	
		Для каждого Реквизит Из МетаданныеРеквзиитов Цикл 
			Если СписокКолонок.Найти(Реквизит.Имя) <> Неопределено Тогда 
				Результат.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
			КонецЕсли; 
		КонецЦикла;
	Иначе
		Для каждого Реквизит Из МетаданныеРеквзиитов Цикл 
			Результат.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
		КонецЦикла;  
	КонецЕсли; 
	
	Возврат Результат; 	
	
КонецФункции  

#КонецОбласти 

#Область ТабличныйДокумент

// Возвращает значение из ячейки табличного документа
//
// Параметры:
//  ОбластьДокумента - ТабличныйДокумент	 - исходный документ
//  НомерСтроки		 - Число	 - номер строки 
//  НомерКолонки	 - Число	 - номер колонки
// 
// Возвращаемое значение:
//   - Произвольный - значение из ячейки
//
Функция ЗначениеЯчейкиТД(ОбластьДокумента, НомерСтроки, НомерКолонки) Экспорт
	
	Результат 			= Неопределено; 	
	Область 			= ОбластьДокумента.ПолучитьОбласть("R" + Формат(НомерСтроки, "ЧГ=0") + "C" + Формат(НомерКолонки, "ЧГ=0"));   	
	ТекущаяОбласть 		= Область.ТекущаяОбласть;
	
	Если ТекущаяОбласть.СодержитЗначение Тогда
		Результат = ТекущаяОбласть.Значение;
	Иначе
		
		Результат = СокрЛП(ТекущаяОбласть.Текст);   
		
		Если ЗначениеЗаполнено(Результат) Тогда
			Результат = ПривестиСтрокуКПростомуТипу(Результат); 			
		Иначе
			Результат = Неопределено; // здесь можно анализировать наличие картинки	
		КонецЕсли;	
		
	КонецЕсли; 	
	
	Возврат Результат;
	
КонецФункции

// Возвращает текст из всех ячеек указанной области
//
// Параметры:
//  Макет		 - ТабличныйДокумент	 - исходный документ
//  ИмяОбласти	 - Строка	 - имя области
// 
// Возвращаемое значение:
//   - Строка - текст из всех областей
//
Функция ТекстОбласти(Макет, ИмяОбласти = "") Экспорт
		
	Результат = "";
	
	Если ЗначениеЗаполнено(ИмяОбласти) Тогда
		ОбластьТабличногоДокумента = Макет.ПолучитьОбласть(ИмяОбласти);	
	Иначе
		ОбластьТабличногоДокумента = Макет;		
	КонецЕсли; 		
		
	Если ОбластьТабличногоДокумента <> Неопределено Тогда 		
		
		Области = ОбластьТабличногоДокумента.Области; 		
		
		Если Области.Количество() > 1 Тогда
			Для каждого Ит Из Области Цикл
				Если Ит.Имя <> ИмяОбласти Тогда
					Результат = Результат + Ит.Текст + Символы.ПС;	
				КонецЕсли; 					
			КонецЦикла;
		Иначе
			Результат = ОбластьТабличногоДокумента.ТекущаяОбласть.Текст;	
		КонецЕсли; 
		
	КонецЕсли; 	
	
	Возврат СокрЛП(Результат);
	
КонецФункции  

// Расширяет область табличного документа
//
// Параметры:
//  ОбластьМакета	 - ТабличныйДокумент	 - исходный документ
//  КоличествоЯчеек	 - Число	 - размер расширения
//  Линия			 - Линия	 - обводит область рамкой указанной линией
//
Процедура РасширитьОбласть(ОбластьМакета, КоличествоЯчеек, Линия = Неопределено) Экспорт
	
	Если КоличествоЯчеек > 1 Тогда 	 
	
		Область = ОбластьМакета.ТекущаяОбласть;		
		
		НоваяОбласть = ОбластьМакета.Область(Область.Верх, Область.Лево, Область.Низ + КоличествоЯчеек - 1, Область.Право + ОбластьМакета.ШиринаТаблицы - 1);
		НоваяОбласть.Объединить();
		
		Если Линия <> Неопределено Тогда 		 
			НоваяОбласть.Обвести(Линия, Линия, Линия, Линия);	
		КонецЕсли; 
	
	КонецЕсли;
	
КонецПроцедуры 

// Преобразует табличный документ в документ HTML с картинками 
//
// Параметры:
//  ТабДок	 - ТабличныйДокумент	 - исходный документ
// 
// Возвращаемое значение:
//   - ДокументHTML - полученный документ
//
Функция ТабличныйДокументВДокументHTML(ТабДок) Экспорт
	
	ЧтениеHTML 		= Новый ЧтениеHTML;
	ПостроительDOM 	= Новый ПостроительDOM;
	
	// Через поток??? Поток = Новый ПотокВПамяти(); ТабДок.Записать(Поток, ТипФайлаТабличногоДокумента.HTML5);ЧтениеHTML.ОткрытьПоток(Поток);Возврат ПостроительDOM.Прочитать(ЧтениеHTML);
	
	ФайлВФорматеHTML = ПолучитьИмяВременногоФайла(); 
	
	ТабДок.Записать(ФайлВФорматеHTML, ТипФайлаТабличногоДокумента.HTML5);
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.ОткрытьФайл(ФайлВФорматеHTML);
	ПостроительDOM = Новый ПостроительDOM;
	
	Результат = ПостроительDOM.Прочитать(ЧтениеHTML);
	
	ЧтениеHTML.Закрыть();
	УдалитьФайлы(ФайлВФорматеHTML); 
	
	Возврат Результат;
   
КонецФункции

// Преобразует табличный документ в текст HTML
//
// Параметры:
//  ТабДок	 - ТабличныйДокумент	 - исходный документ
//  Вложения - Массив	 - массив  вложения HTML документа 
// 
// Возвращаемое значение:
//   - Строка - текст html
//
Функция ТабличныйДокументВТекстHTML(ТабДок, Вложения = Неопределено) Экспорт
	                                   
	НПП 				= 0;	
	ДокументHTML 		= ТабличныйДокументВДокументHTML(ТабДок);	 	
	
	Для Каждого Картинка Из ДокументHTML.Картинки Цикл
		
		ИмяКартинки = "image" + Формат(НПП, "ЧЦ=3; ЧВН=");
		
		АтрибутИсточникКартинки = Картинка.Атрибуты.ПолучитьИменованныйЭлемент("src");
		АтрибутИсточникКартинки.ТекстовоеСодержимое = "cid:" + ИмяКартинки; 
		
		ДвоичныеДанныеКартинки = ПоместитьВоВременноеХранилище(ТабДок.Области.Шапка.Картинка.ПолучитьДвоичныеДанные());
		
		Вложение = Новый Структура("Представление, АдресВоВременномХранилище, Идентификатор", ИмяКартинки, ДвоичныеДанныеКартинки, ИмяКартинки);
	                                        
		Вложения.Добавить(Вложение);
		
		НПП = НПП + 1;
		
	КонецЦикла; 	 	
	
	Возврат ИсходныйТекстДокументаHTML(ДокументHTML);
	
КонецФункции 

#КонецОбласти 

#Область ДокументHTML

// Возвращает текст документа HTML
//
// Параметры:
//  ДокументHTML - ДокументHTML	 - документ HTML
// 
// Возвращаемое значение:
//   - Строка - текст html
//
Функция ИсходныйТекстДокументаHTML(ДокументHTML) Экспорт
   ЗаписьDOM = Новый ЗаписьDOM; 
   ЗаписьHTML = Новый ЗаписьHTML;
   ЗаписьHTML.УстановитьСтроку(); 
   ЗаписьDOM.Записать(ДокументHTML, ЗаписьHTML);
   Возврат ЗаписьHTML.Закрыть();
КонецФункции  

#КонецОбласти

#Область XDTO

// Записывает объект XDTO в приемник
//
// Параметры:
//  ИсточникДанных	 - ОбъектXDTO	 - объект XDTO
//  Приемник		 - Строка,Поток	 - если строка то запись в файл, если поток, то запись в поток, если Неопределено, то в строку
//  Фабрика			 - ФабрикаXDTO	 - фабрика XDTO
//  ЭтоJSON			 - Булево	 - признак JSON сериализации 
//
Процедура ЗаписатьОбъектXDTO(ИсточникДанных, Приемник = Неопределено, Фабрика = Неопределено, ЭтоJSON = Ложь) Экспорт
	
	ТипПриемника = ТипЗнч(Приемник);	
	Запись		 = ?(ЭтоJSON, Новый ЗаписьJSON(), Новый ЗаписьXML());
	
	Если Фабрика = Неопределено Тогда
		Фабрика = ФабрикаXDTO;
	КонецЕсли;
	
	ИсточникДанных.Проверить();	 
	
	Если Приемник = Неопределено ИЛИ Приемник = "" Тогда
		
		Запись.УстановитьСтроку();
		
		Если ЭтоJSON Тогда			
			Фабрика.ЗаписатьJSON(Запись, ИсточникДанных, НазначениеТипаXML.Явное);
		Иначе
			Фабрика.ЗаписатьXML(Запись, ИсточникДанных, , , , НазначениеТипаXML.Явное);
		КонецЕсли; 	
		
		Приемник = Запись.Закрыть();
		
	Иначе 				
		
		Если ТипПриемника = Тип("Поток") ИЛИ ТипПриемника = Тип("ПотокВПамяти") ИЛИ ТипПриемника = Тип("ФайловыйПоток") Тогда
			Запись.ОткрытьПоток(Приемник);			
		ИначеЕсли ТипПриемника = Тип("Строка") Тогда 
			Запись.ОткрытьФайл(Приемник);	
		Иначе                   
			ВызватьИсключение СтрШаблон(НСтр("ru='Приемник не определен %1'"), ТипПриемника);
		КонецЕсли;	
		
		Если ЭтоJSON Тогда			
			Фабрика.ЗаписатьJSON(Запись, ИсточникДанных, НазначениеТипаXML.Явное);
		Иначе
			Фабрика.ЗаписатьXML(Запись, ИсточникДанных, , , , НазначениеТипаXML.Явное);
		КонецЕсли;	
		
		Запись.Закрыть();
		
		Приемник.Перейти(0, ПозицияВПотоке.Начало);
		
	КонецЕсли;	  	
	    	
КонецПроцедуры 

// Читает объект XDTO 
//
// Параметры:
//  ИсточникДанных	 - Строка,Поток	 - источник для создания объекта XDTO
//  Фабрика			 - ФабрикаXDTO	 - фабрика XDTO
//  ЭтоJSON			 - Булево	 - признак JSON сериализации
// 
// Возвращаемое значение:
//   - ОбъектXDTO - объект
//
Функция ПрочитатьОбъектXDTO(ИсточникДанных, Фабрика = Неопределено, ЭтоJSON = Ложь) Экспорт
	
	Результат 		= Неопределено;
	ТипИсточника 	= ТипЗнч(ИсточникДанных);
	Чтение			= ?(ЭтоJSON, Новый ЧтениеJSON, Новый ЧтениеXML);
	
	Если Фабрика = Неопределено Тогда
		Фабрика = ФабрикаXDTO;
	КонецЕсли; 	 
	
	Если ТипИсточника = Тип("Поток") ИЛИ ТипИсточника = Тип("ПотокВПамяти") ИЛИ ТипИсточника = Тип("ФайловыйПоток") Тогда  		
		Чтение.ОткрытьПоток(ИсточникДанных);
	ИначеЕсли ТипИсточника = Тип("ДвоичныеДанные") Тогда  			
		Чтение.ОткрытьПоток(ИсточникДанных.ОткрытьПотокДляЧтения());	
	Иначе 		     
		Если НЕ ЭтоJSON И СтрНачинаетсяС(СокрЛ(ИсточникДанных), "<")
				ИЛИ ЭтоJSON И СтрНачинаетсяС(СокрЛ(ИсточникДанных), "{") Тогда 
			Чтение.УстановитьСтроку(ИсточникДанных);
		Иначе
			Чтение.ОткрытьФайл(ИсточникДанных);	
		КонецЕсли; 			
	КонецЕсли;  	
	
	Чтение.Прочитать();
	
	URIПространстваИмен = Чтение.URIПространстваИмен; 
	ИмяТипаXDTO 		= Чтение.Имя;
	ТипXDTO 			= Фабрика.Тип(URIПространстваИмен, ИмяТипаXDTO); 	
	
	Результат = Фабрика.ПрочитатьXML(Чтение, ТипXDTO);
	
	Чтение.Закрыть();
	
	Возврат Результат;
	
КонецФункции 

// Создает таблицу значений из СпискаXDTO
//
// Параметры:
//  КоллекцияXDTO	 - СписокXDTO	 - исходный список XDTO 
//  СтруктураЗамены	 - Структура	 - структура имен колонок 
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - таблица с колонка СпискаXDTO, если не указана замена имен
//
Функция СформироватьТаблицуИзКоллекцииXDTO(КоллекцияXDTO, СтруктураЗамены = Неопределено) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	Если КоллекцияXDTO <> Неопределено Тогда  
		
		Если СтруктураЗамены = Неопределено Тогда
			
			ТипКоллекцииСтатусов = КоллекцияXDTO.ВладеющееСвойство.Тип;
			
			Для каждого Ит Из ТипКоллекцииСтатусов.Свойства Цикл
				Результат.Колонки.Добавить(Ит.Имя);	
			КонецЦикла;
			
			Для каждого СтрокаXDTO Из КоллекцияXDTO Цикл
				ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрокаXDTO);	
			КонецЦикла;
			
		Иначе
			
			Для каждого Ит Из СтруктураЗамены Цикл
				
				ОписаниеКолонки = Ит.Значение;
				
				Если ТипЗнч(ОписаниеКолонки) = Тип("Структура") Тогда
					Результат.Колонки.Добавить(ОписаниеКолонки.Имя, ОписаниеКолонки.Тип);		
				Иначе
					Результат.Колонки.Добавить(ОписаниеКолонки);
				КонецЕсли; 
				
			КонецЦикла; 
			
			Для каждого СтрокаXDTO Из КоллекцияXDTO Цикл
				
				НоваяСтрока = Результат.Добавить();
				
				Для каждого Ит Из СтруктураЗамены Цикл
					
					ОписаниеКолонки = Ит.Значение;
					
					Если ТипЗнч(ОписаниеКолонки) = Тип("Структура") Тогда
						НоваяСтрока[ОписаниеКолонки.Имя] = СтрокаXDTO[Ит.Ключ];		
					Иначе
						НоваяСтрока[ОписаниеКолонки] = СтрокаXDTO[Ит.Ключ];
					КонецЕсли; 
												
				КонецЦикла;   				
					
			КонецЦикла;
			
		КонецЕсли; 		 
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает дубликат объекта XDTO, копированием свойств
//
// Параметры:
//  ИсточникXDTO 	- ОбъектXDTO	- объект XDTO
//  Ключ	 		- Булево	 	- имя поля XDTO для копирования 
// 
// Возвращаемое значение:
//   - ОбъектXDTO - копия исходного объекта
//
Функция СкопироватьОбъектXDTO(ИсточникXDTO, Ключ = "") Экспорт
	
	Результат = Неопределено; 	
	
	Если ИсточникXDTO <> Неопределено Тогда
		
		ТипXDTO 			= ИсточникXDTO.Тип();
		Результат 			= ФабрикаXDTO.Создать(ТипXDTO);		
		
		Если ЗначениеЗаполнено(Ключ) Тогда
			СвойствоКлюча = ТипXDTO.Свойства.Получить(Ключ);
			Если СвойствоКлюча = Неопределено Тогда
				СвойстваИсточника = ТипXDTO.Свойства;
			Иначе
				СвойстваИсточника = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СвойствоКлюча);
			КонецЕсли; 
		Иначе	
			СвойстваИсточника = ТипXDTO.Свойства;
		КонецЕсли; 
		
		Для каждого Свойство Из СвойстваИсточника Цикл
			    			
			ИмяСвойства		= Свойство.Имя;
			ЗначениеXDTO 	= ИсточникXDTO[ИмяСвойства];
			ТипЗначения  	= ТипЗнч(Свойство.Тип);
			ЭтоСписок		= Свойство.ВерхняяГраница > 1 ИЛИ Свойство.ВерхняяГраница = -1;
			
			Если ЗначениеXDTO <> Неопределено Тогда  
			
				Если ТипЗначения = Тип("ТипЗначенияXDTO") Тогда 
					Если ЭтоСписок Тогда
						Для каждого ЭлементСпискаXDTO Из ЗначениеXDTO Цикл
							Результат[ИмяСвойства].Добавить(ЭлементСпискаXDTO);	
						КонецЦикла; 							
					Иначе
						Результат[ИмяСвойства] = ЗначениеXDTO;
					КонецЕсли;  							
				КонецЕсли;					
					
				Если ТипЗначения = Тип("ТипОбъектаXDTO") Тогда 					
					Если ЭтоСписок Тогда
						Для каждого ЭлементСпискаXDTO Из ЗначениеXDTO Цикл
							Результат[ИмяСвойства].Добавить(ЭлементСпискаXDTO);	
						КонецЦикла; 							
					Иначе
						Результат[ИмяСвойства] = СкопироватьОбъектXDTO(ЗначениеXDTO);
					КонецЕсли; 				
				КонецЕсли; 
			
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие свойства у объекта XDTO
//
// Параметры:
//  ДанныеXDTO			 - ОбъектXDTO	 - исходный объект XDTO
//  ИмяСвойства			 - Строка	 - имя свойства
//  СвойстваXDTO 		 - СвойствоXDTO	 - проверяемое СвойствоXDTO
// 
// Возвращаемое значение:
//   - Булево - Истина, если свойство есть
//
Функция ЕстьСвойствоXDTO(ДанныеXDTO, ИмяСвойства, СвойстваXDTO = Неопределено) Экспорт
	 	
	Если ТипЗнч(ДанныеXDTO) = Тип("ОбъектXDTO") Тогда
		КоллекцияСвойств = ДанныеXDTO.Свойства();	
	ИначеЕсли ТипЗнч(ДанныеXDTO) = Тип("ТипОбъектаXDTO") Тогда 
		КоллекцияСвойств = ДанныеXDTO.Свойства;	
	ИначеЕсли ТипЗнч(ДанныеXDTO) = Тип("КоллекцияСвойствXDTO") Тогда 
		КоллекцияСвойств = ДанныеXDTO;	
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
	СвойстваXDTO = КоллекцияСвойств.Получить(ИмяСвойства);
	
	Возврат СвойстваXDTO <> Неопределено;
	
КонецФункции

// Возвращает значение поля объекта XDTO
//
// Параметры:
//  ОбъектXDTO	 - ОбъектXDTO - исходный объект
//  ИмяПоляXDTO	 - Строка	 - полный путь до значения 
// 
// Возвращаемое значение:
//   - Произвольный - значение указанного свойства
//
Функция ЗначениеXDTO(ОбъектXDTO, ИмяПоляXDTO) Экспорт
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ИмяПоляXDTO) Тогда 
		
		Если Найти(ИмяПоляXDTO, ".") > 0 Тогда  		
			
			ДанныеXDTO 	= ОбъектXDTO;
			МассивСтрок = СтрРазделить(ИмяПоляXDTO, ".");		
			
			Для Сч = 0 По МассивСтрок.ВГраница() Цикл
				
				ИмяСвойства = МассивСтрок[Сч];
				
				Если ЕстьСвойствоXDTO(ДанныеXDTO, ИмяСвойства) Тогда
					ДанныеXDTO = ДанныеXDTO[ИмяСвойства];
				Иначе
					Возврат Неопределено;	
				КонецЕсли;				
				
			КонецЦикла;			
			
			Результат = ДанныеXDTO;
			
		Иначе 		
			Результат = ДанныеXDTO[ИмяПоляXDTO];  					
		КонецЕсли;
		
	Иначе
		Результат = ОбъектXDTO;	
	КонецЕсли; 	 
	
	Возврат Результат;
	
КонецФункции   

// Возвращает количество элементов в списках контейнера
//
// Параметры:
//  КонтейнерКоллекцийXDTO	 - ОбъектXDTO	 - исходный объект XDTO
//  БезВложенныхСписков		 - Булево 	 - признак проверки вложенных списков XDTO 
// 
// Возвращаемое значение:
//   - Число - количество элементов в списках
//
Функция КоличествоВСпискахXDTO(КонтейнерКоллекцийXDTO, БезВложенныхСписков = Истина) Экспорт
	
	Результат = 0;
	
	Для каждого Ит Из КонтейнерКоллекцийXDTO.Свойства() Цикл
		
		Если ТипЗнч(КонтейнерКоллекцийXDTO[Ит.Имя]) = Тип("СписокXDTO") Тогда
			Результат = Результат + КонтейнерКоллекцийXDTO[Ит.Имя].Количество();	
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти  

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции   
     
Процедура КопироватьСтроки(КоллекцияСтрокИсточника, КоллекцияСтрокПриемника)

	Для Каждого ТекущаяСтрокаИсточника Из КоллекцияСтрокИсточника Цикл

		НоваяСтрокаПриемника = КоллекцияСтрокПриемника.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПриемника, ТекущаяСтрокаИсточника);

		Если ЗначениеЗаполнено(ТекущаяСтрокаИсточника.Строки) Тогда
			КопироватьСтроки(ТекущаяСтрокаИсточника.Строки, НоваяСтрокаПриемника.Строки);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
         
Процедура ДобавитьЭлементыОтображенияСтрокиТаблицы(Форма, ИмяТаблицыОтображения, Родитель, СвойстваКлюча, СвойстваСписка, КлючСписка = Неопределено, Список = Неопределено) 
	
	ДействияСписка		= Неопределено;
	ДействияКлюча 		= Неопределено;
	ЭлементыФормы 		= Форма.Элементы;                                                                              		
	КоличествоСтрок		= Форма[ИмяТаблицыОтображения].Количество();
	СвойстваКлюча       = Новый Структура;
	СвойстваСписка      = Новый Структура;
	СвойстваГруппы 		= Новый Структура("Вид, Группировка", ВидГруппыФормы.ОбычнаяГруппа, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	Идентификатор 		= СтрЗаменить(Новый УникальныйИдентификатор, "-", ""); 
	
	СвойстваКлюча.Вставить("Заголовок", СвойстваКлюча.ЗаголовокКлюча);
	СвойстваКлюча.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	СвойстваКлюча.Вставить("ПутьКДанным",  ИмяТаблицыОтображения + "[" + КоличествоСтрок + "].КлючСписка");
	СвойстваКлюча.Вставить("КнопкаОчистки", Истина);  
	
	СвойстваСписка.Вставить("Заголовок", СвойстваСписка.ЗаголовокСписка);
	СвойстваСписка.Вставить("Вид", ВидПоляФормы.ПолеВвода);
	СвойстваСписка.Вставить("ПутьКДанным", ИмяТаблицыОтображения + "[" + КоличествоСтрок + "].СписокЗначений");
	СвойстваСписка.Вставить("КнопкаОчистки", Истина);	
	        	
	Если СвойстваКлюча.Свойство("ДействияКлюча", ДействияКлюча) Тогда
		СвойстваКлюча.Вставить("Действия", ДействияКлюча);		
	КонецЕсли; 
	
	Если СвойстваСписка.Свойство("ДействияСписка", ДействияСписка) Тогда
		СвойстваСписка.Вставить("Действия", ДействияСписка);		
	КонецЕсли;	 
	
	НоваяСтрока 					= Форма[ИмяТаблицыОтображения].Добавить();		
	НоваяСтрока.ИдентификаторКлюча 	= Идентификатор;
	НоваяСтрока.КлючСписка 			= КлючСписка;
	НоваяСтрока.СписокЗначений 		= ?(Список = Неопределено, Новый СписокЗначений, Список);
	
	ГруппаЭлементаНабора = СоздатьЭлементФормы(ЭлементыФормы, "Группа_" + Идентификатор, СвойстваГруппы, Тип("ГруппаФормы"), Родитель, Неопределено);
	
	СоздатьЭлементФормы(ЭлементыФормы, "ПолеКлюча_" + Идентификатор, СвойстваКлюча, Тип("ПолеФормы"), ГруппаЭлементаНабора, Неопределено);
	СоздатьЭлементФормы(ЭлементыФормы, "ПолеСписка_" + Идентификатор, СвойстваСписка, Тип("ПолеФормы"), ГруппаЭлементаНабора, Неопределено);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуСоСписком(Таблица, ИмяКолонки, ИсточникДанных)
	
	Для каждого Ит Из ИсточникДанных Цикл
		Если ТипЗнч(Ит.Значение) = Тип("Соответствие") Тогда
			ЗаполнитьТаблицуСоСписком(Таблица, ИмяКолонки, Ит.Значение);
		ИначеЕсли ТипЗнч(Ит.Значение) = Тип("Массив") Тогда 
			
			НоваяСтрока = Таблица.Добавить();
			
			Для каждого Элемент Из Ит.Значение Цикл  				
				НоваяСтрока[ИмяКолонки].Добавить(Элемент[ИмяКолонки]);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент, , ИмяКолонки);	
			КонецЦикла;  
			
		Иначе       			
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока[ИмяКолонки].Добавить(ИсточникДанных[ИмяКолонки]);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсточникДанных, , ИмяКолонки);   		
		КонецЕсли; 	
	КонецЦикла; 
	
КонецПроцедуры

Функция ПривестиСтрокуКПростомуТипу(Знач ЗначениеЯчейки)
	
	Результат = ЗначениеЯчейки; 	
	
	Попытка
		Результат = Число(ЗначениеЯчейки);
	Исключение
		
		Если ВРег(ЗначениеЯчейки) = "ИСТИНА" ИЛИ ВРег(ЗначениеЯчейки) = "TRUE" Тогда
			Результат = Истина;
		ИначеЕсли ВРег(ЗначениеЯчейки) = "ЛОЖЬ" ИЛИ ВРег(ЗначениеЯчейки) = "FALSE" Тогда
			Результат = Ложь;
		Иначе
			Попытка
				Результат = Дата(ЗначениеЯчейки);	
			Исключение   
				Результат = Неопределено;	
			КонецПопытки; 			
		КонецЕсли;	
		
	КонецПопытки; 	
	
	Возврат Результат;
	
КонецФункции

#Область СлужебныеПроцедурыФункцииЕстьИзмененияОбъектаСсылочногоТипа

Функция КоллекцияШаблоновЗапросовКонтрольИзмененияОбъектаСсылочногоТипа()
		  		   
	Результат = Новый Структура;  		
	
	ШаблонСравненияТабличнойЧастиПоПоказателям = "ВЫБРАТЬ 
												|""#ИмяТабличнойЧасти#"" КАК ИмяТабличнойЧасти, 
												|#ИтоговыеПоказатели#
												|#ИтоговыеКолонки#												
												|ИЗ (ВЫБРАТЬ
												|#ПоказателиПосле#
												|#Колонки#												
												|ИЗ
												|	#ТабличнаяЧасть# КАК Таблица
												|
												|ОБЪЕДИНИТЬ ВСЕ 
												|
												|ВЫБРАТЬ 
												|#ПоказателиДо#
												|#Колонки#												 								 
												|ИЗ #Таблица#.#ИмяТабличнойЧасти# КАК Таблица
												|ГДЕ 
												|	Таблица.Ссылка = &Ссылка) КАК ДанныеСравнения
												|СГРУППИРОВАТЬ ПО
												|#КолонкиГруппировки#
												|ИМЕЮЩИЕ 
												|	#УсловияПоПоказателям#
												|";   	
	
	ШаблонСравненияТабличнойЧасти = "ВЫБРАТЬ 
									|""#ИмяТабличнойЧасти#"" КАК ИмяТабличнойЧасти, 
									|#ИтоговыеКолонки#, 
									|СУММА(ДанныеСравнения._СГПоле) 
									|ИЗ (ВЫБРАТЬ 				              
									|#Колонки#,
									|1 КАК _СГПоле
									|ИЗ
									|	#ТабличнаяЧасть# КАК Таблица
									|
									|ОБЪЕДИНИТЬ ВСЕ 
									|
									|ВЫБРАТЬ 
									|#Колонки#,
									|-1 КАК _СГПоле 								 
									|ИЗ #Таблица#.#ИмяТабличнойЧасти# КАК Таблица
									|ГДЕ 
									|	Таблица.Ссылка = &Ссылка) КАК ДанныеСравнения
									|СГРУППИРОВАТЬ ПО
									|#КолонкиГруппировки#
									|ИМЕЮЩИЕ 
									|	СУММА(ДанныеСравнения._СГПоле) <> 0
									|
									|ИТОГИ ПО  									
	       							|	ДанныеСравнения.НомерСтроки";
	
	ШаблонВтТабличнойЧастиПередЗаписью = "ВЫБРАТЬ				              
							  			|#Колонки#
							  			|ПОМЕСТИТЬ Вт_#ИмяТабличнойЧасти#
							  			|ИЗ
							  			|	&#ИмяТабличнойЧасти# КАК Таблица";								  
							  
	ШаблонЗапросаКонтроляРеквизитовШапки = "ВЫБРАТЬ 
									|	#Колонки# 	
									|
									|ИЗ #Таблица# КАК Таблица
									|ГДЕ 
							  		|	Таблица.Ссылка = &Ссылка";  	 	
	
	ШаблонПоляТаблицы						= "Таблица.#ИмяРеквизита#"; 
	ШаблонВыборкиПоляТаблицы				= "#Колонка# КАК #ИмяРеквизита#";
	ШаблонУсловияПоказателя					= "СУММА(ДанныеСравнения.#ИмяРеквизита#) <> 0"; 	
	ШаблонВыбораИтоговогоПоказателя			= "СУММА(ДанныеСравнения.#ИмяРеквизита#) КАК #ИмяРеквизита#";
	ШаблонВыборкиПоказателя					= "#Знак#Таблица.#ИмяРеквизита# КАК #ИмяРеквизита#";
	ШаблонУничтоженияВТ						= "УНИЧТОЖИТЬ Вт_#ИмяТабличнойЧасти#" + ОбщегоНазначения.РазделительПакетаЗапросов();
	ШаблонСтроковогоПоляНеограниченнойДлины = "ВЫРАЗИТЬ(Таблица.#ИмяРеквизита# КАК СТРОКА(1024))";
	
	Результат.Вставить("ШаблонСравненияТабличнойЧастиПоПоказателям", 	ШаблонСравненияТабличнойЧастиПоПоказателям);
	Результат.Вставить("ШаблонУсловияПоказателя", 						ШаблонУсловияПоказателя); 
	Результат.Вставить("ШаблонВыбораИтоговогоПоказателя", 				ШаблонВыбораИтоговогоПоказателя);
	Результат.Вставить("ШаблонВыборкиПоказателя", 						ШаблонВыборкиПоказателя);	
	Результат.Вставить("ШаблонСравненияТабличнойЧасти", 				ШаблонСравненияТабличнойЧасти);  	
	Результат.Вставить("ШаблонВтТабличнойЧастиПередЗаписью", 			ШаблонВтТабличнойЧастиПередЗаписью);	
	Результат.Вставить("ШаблонЗапросаКонтроляРеквизитовШапки", 			ШаблонЗапросаКонтроляРеквизитовШапки);
	Результат.Вставить("ШаблонУничтоженияВТ", 							ШаблонУничтоженияВТ); 
	Результат.Вставить("ШаблонВыборкиПоляТаблицы", 						ШаблонВыборкиПоляТаблицы);	
	Результат.Вставить("ШаблонПоляТаблицы", 							ШаблонПоляТаблицы);  
	Результат.Вставить("ШаблонСтроковогоПоляНеограниченнойДлины", 		ШаблонСтроковогоПоляНеограниченнойДлины);
	
	
	Возврат Результат;
	
КонецФункции
 
Функция ТекстЗапросаСравненияОбъектаСсылочногоТипа(ИмяТаблицы, ОписаниеКолонокШапки, ОписаниеКолонокТабличныхЧастей)
	
	Результат 								= "";
	ТекстЗапросаКолонкиШапки 				= ""; 
	ТекстЗапросаКШапкеОбъекта				= "";
	ТекстЗапросВтКТабличнымЧастям 			= "";
	ТекстЗапросаСравненияТабличныхЧастей	= ""; 
	ТекстЗапросаУничтожениеВТ 				= "";
	РазделительКолонок						= "," + Символы.ПС;
	РазделительУсловий						= " ИЛИ " + Символы.ПС;
	КоллекцияШаблонов 						= КоллекцияШаблоновЗапросовКонтрольИзмененияОбъектаСсылочногоТипа();
	
	Если ЗначениеЗаполнено(ОписаниеКолонокШапки) Тогда 		  
		
		ШаблонЗаполнения = КоллекцияШаблонов.ШаблонПоляТаблицы;
		
		Для каждого Ит Из ОписаниеКолонокШапки Цикл			  		
			ТекстЗапросаКолонкиШапки = ТекстЗапросаКолонкиШапки + СтрЗаменить(ШаблонЗаполнения, "#ИмяРеквизита#", Ит.ИмяРеквизита) + РазделительКолонок; 			
		КонецЦикла; 
		
		ТекстЗапросаКолонкиШапки = Лев(ТекстЗапросаКолонкиШапки, СтрДлина(ТекстЗапросаКолонкиШапки) - СтрДлина(РазделительКолонок));		
		ТекстЗапросаКШапкеОбъекта = СтрЗаменить(КоллекцияШаблонов.ШаблонЗапросаКонтроляРеквизитовШапки, "#Таблица#", ИмяТаблицы);
		ТекстЗапросаКШапкеОбъекта = СтрЗаменить(ТекстЗапросаКШапкеОбъекта, "#Колонки#", ТекстЗапросаКолонкиШапки);    	
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеКолонокТабличныхЧастей) Тогда		
		
		Для каждого Ит Из ОписаниеКолонокТабличныхЧастей Цикл
			
			ТекстЗапросаСравнениеТабличнойЧасти		= "";
			ТекстЗапросаВыборкаПоказателейВнутриВЗ	= "";
			ТекстЗапросаУсловияПоПоказателям		= "";
			ТекстЗапросаИтоговыеПоказатели			= "";
			ТекстЗапросаВыборкаПоказателей			= "";
			ТекстВыборкиПоля						= "";
			ТекстПоляГруппировки               	 	= "";
			ТекстЗапросаВыборкаПолей				= "";  		
			
			ИмяТабличнойЧасти 						= Ит.Ключ;
			КолонкиТабличнойЧасти 					= Ит.Значение.Колонки;
			ПоказателиТабличнойЧасти 				= Ит.Значение.Показатели; 
			ИмяТаблицыВТ							= Ит.Значение.ИмяТаблицыВТ;    
			НеЗагружатьТабличнуюЧасть				= ЗначениеЗаполнено(ИмяТаблицыВТ);
			
			Для каждого ОписаниеКолонки Из КолонкиТабличнойЧасти Цикл
				
				Если ОписаниеКолонки.ЭтоСтрокаНеограниченноДлины Тогда
					ШаблонЗаполнения = КоллекцияШаблонов.ШаблонСтроковогоПоляНеограниченнойДлины;	
				Иначе
					ШаблонЗаполнения = КоллекцияШаблонов.ШаблонПоляТаблицы;	
				КонецЕсли;  				
				
				ТекстВыборкиПоля 			= СтрЗаменить(КоллекцияШаблонов.ШаблонВыборкиПоляТаблицы, "#Колонка#", ШаблонЗаполнения);
				ТекстЗапросаВыборкаПолей 	= ТекстЗапросаВыборкаПолей + СтрЗаменить(ТекстВыборкиПоля, "#ИмяРеквизита#", ОписаниеКолонки.ИмяРеквизита) + РазделительКолонок;
				ТекстПоляГруппировки		= ТекстПоляГруппировки + СтрЗаменить(КоллекцияШаблонов.ШаблонПоляТаблицы, "#ИмяРеквизита#", ОписаниеКолонки.ИмяРеквизита) + РазделительКолонок;
				
			КонецЦикла; 
			
			ТекстЗапросаВыборкаПолей = Лев(ТекстЗапросаВыборкаПолей, СтрДлина(ТекстЗапросаВыборкаПолей) - СтрДлина(РазделительКолонок));
			ТекстПоляГруппировки = Лев(ТекстПоляГруппировки, СтрДлина(ТекстПоляГруппировки) - СтрДлина(РазделительКолонок));
			
			Если ЗначениеЗаполнено(ПоказателиТабличнойЧасти) Тогда
				
				Для каждого Показатель Из ПоказателиТабличнойЧасти Цикл    					
					ТекстЗапросаВыборкаПоказателей 			= ТекстЗапросаВыборкаПоказателей + СтрЗаменить(КоллекцияШаблонов.ШаблонПоляТаблицы, "#ИмяРеквизита#", Показатель) + РазделительКолонок;
					ТекстЗапросаВыборкаПоказателейВнутриВЗ 	= ТекстЗапросаВыборкаПоказателейВнутриВЗ + СтрЗаменить(КоллекцияШаблонов.ШаблонВыборкиПоказателя, "#ИмяРеквизита#", Показатель) + РазделительКолонок;
					ТекстЗапросаИтоговыеПоказатели			= ТекстЗапросаИтоговыеПоказатели + СтрЗаменить(КоллекцияШаблонов.ШаблонВыбораИтоговогоПоказателя, "#ИмяРеквизита#", Показатель) + РазделительКолонок;
					ТекстЗапросаУсловияПоПоказателям		= ТекстЗапросаУсловияПоПоказателям +  СтрЗаменить(КоллекцияШаблонов.ШаблонУсловияПоказателя, "#ИмяРеквизита#", Показатель) + РазделительУсловий;  					
				КонецЦикла; 			
				
				ТекстЗапросаУсловияПоПоказателям = Лев(ТекстЗапросаУсловияПоПоказателям, СтрДлина(ТекстЗапросаУсловияПоПоказателям) - СтрДлина(РазделительУсловий));
				                      				
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(КоллекцияШаблонов.ШаблонСравненияТабличнойЧастиПоПоказателям, "#Таблица#", ИмяТаблицы);  			
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#Колонки#", ТекстЗапросаВыборкаПолей);
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#КолонкиГруппировки#", СтрЗаменить(ТекстПоляГруппировки, "Таблица.", "ДанныеСравнения.")); 				
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#ИтоговыеКолонки#", СтрЗаменить(ТекстЗапросаВыборкаПолей, "Таблица.", "ДанныеСравнения."));
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#ИтоговыеПоказатели#", ТекстЗапросаИтоговыеПоказатели);
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#ПоказателиПосле#", СтрЗаменить(ТекстЗапросаВыборкаПоказателейВнутриВЗ, "#Знак#", "-"));	
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#ПоказателиДо#", СтрЗаменить(ТекстЗапросаВыборкаПоказателейВнутриВЗ, "#Знак#", ""));
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#УсловияПоПоказателям#", ТекстЗапросаУсловияПоПоказателям);	
				            				
			Иначе				
				
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(КоллекцияШаблонов.ШаблонСравненияТабличнойЧасти, "#Таблица#", ИмяТаблицы);  			
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#Колонки#", ТекстЗапросаВыборкаПолей);
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#КолонкиГруппировки#", СтрЗаменить(ТекстПоляГруппировки, "Таблица.", "ДанныеСравнения."));
				ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#ИтоговыеКолонки#", СтрЗаменить(ТекстЗапросаВыборкаПолей, "Таблица.", "ДанныеСравнения."));
			          			
			КонецЕсли; 
			
			ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#ТабличнаяЧасть#", ?(НеЗагружатьТабличнуюЧасть, ИмяТаблицыВТ, "Вт_" + ИмяТабличнойЧасти));
			ТекстЗапросаСравнениеТабличнойЧасти = СтрЗаменить(ТекстЗапросаСравнениеТабличнойЧасти, "#ИмяТабличнойЧасти#", ИмяТабличнойЧасти);
			
			Если НЕ НеЗагружатьТабличнуюЧасть Тогда   			
				
				ТекстЗапросКТабличнойЧасти = СтрЗаменить(КоллекцияШаблонов.ШаблонВтТабличнойЧастиПередЗаписью, "#Таблица#", ИмяТаблицы);
				ТекстЗапросКТабличнойЧасти = СтрЗаменить(ТекстЗапросКТабличнойЧасти, "#ИмяТабличнойЧасти#", ИмяТабличнойЧасти);  			 
				ТекстЗапросКТабличнойЧасти = СтрЗаменить(ТекстЗапросКТабличнойЧасти, "#Колонки#", ТекстЗапросаВыборкаПоказателей + ТекстЗапросаВыборкаПолей); 
				ТекстЗапросКТабличнойЧасти = ТекстЗапросКТабличнойЧасти + ОбщегоНазначения.РазделительПакетаЗапросов();				
				
				ТекстЗапросаУничтожениеВТ = ТекстЗапросаУничтожениеВТ + СтрЗаменить(КоллекцияШаблонов.ШаблонУничтоженияВТ, "#ИмяТабличнойЧасти#", ИмяТабличнойЧасти);
				
			КонецЕсли; 		  			
			
			ТекстЗапросВтКТабличнымЧастям = ТекстЗапросВтКТабличнымЧастям + ТекстЗапросКТабличнойЧасти;
			ТекстЗапросаСравненияТабличныхЧастей = ТекстЗапросаСравненияТабличныхЧастей + ТекстЗапросаСравнениеТабличнойЧасти + ОбщегоНазначения.РазделительПакетаЗапросов();
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Результат = ТекстЗапросВтКТабличнымЧастям + ТекстЗапросаСравненияТабличныхЧастей + ТекстЗапросаУничтожениеВТ + ТекстЗапросаКШапкеОбъекта;
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьТаблицуОписанияКолонок()
	
	ТипСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(512));
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИмяРеквизита", ТипСтрока);
	Результат.Колонки.Добавить("ЭтоСтрокаНеограниченноДлины", ТипБулево);  
	Результат.Колонки.Добавить("ЭтоСоставнойТип", ТипБулево);
	Результат.Колонки.Добавить("ИмяТабличнойЧасти", ТипСтрока);
		
	Возврат Результат;
	
КонецФункции     

Функция ПодготовитьТаблицуИзменений()
	
	ТипСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(512));
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Результат = Новый ТаблицаЗначений;  
	Результат.Колонки.Добавить("ИмяРеквизита", ТипСтрока);
	Результат.Колонки.Добавить("ИмяТаблицы", ТипСтрока); 
	Результат.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(15));
	Результат.Колонки.Добавить("ЗначениеБД");
	Результат.Колонки.Добавить("ЗначениеТекущее");  
	Результат.Колонки.Добавить("ДобавленаУдалена", ТипБулево);	
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьОписаниеКолонки(ТаблицаОписания, МетаданныеРеквизита)
	
	ТипРеквизита = МетаданныеРеквизита.Тип;
	
	Результат 								= ТаблицаОписания.Добавить();
	Результат.ИмяРеквизита 					= МетаданныеРеквизита.Имя;
	Результат.ЭтоСтрокаНеограниченноДлины 	= ТипРеквизита.СодержитТип(Тип("Строка")) И ТипРеквизита.КвалификаторыСтроки.Длина = 0; 
	Результат.ЭтоСоставнойТип				= ТипРеквизита.Типы().Количество() > 1;	 
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьИзмнениеВТаблицу(ТаблицаИзмнений, ЗначениеБД, ЗначениеТекущее, ИмяРеквизита, ИмяТаблицы = "", НомерСтроки = Неопределено)
	
	НоваяСтрока 			= ТаблицаИзмнений.Добавить(); 
	НоваяСтрока.ИмяТаблицы 	= ИмяТаблицы;
	НоваяСтрока.НомерСтроки = НомерСтроки;	
	
	Если ЗначениеБД = ЗначениеТекущее Тогда
		НоваяСтрока.ДобавленаУдалена = ИмяРеквизита;	
	Иначе  	
		НоваяСтрока.ЗначениеБД 		= ЗначениеБД;
		НоваяСтрока.ЗначениеТекущее = ЗначениеТекущее;
		НоваяСтрока.ИмяРеквизита 	= ИмяРеквизита;	
	КонецЕсли;	
	
КонецПроцедуры  

Процедура ДобавитьИзменениеВСтроку(ТекстИзменений, ЗначениеБД, ЗначениеТекущее, ИмяРеквизита, ИмяТаблицы = "", НомерСтроки = Неопределено)
	                     		
	Если ЗначениеБД = ЗначениеТекущее Тогда 
		
		Если ИмяРеквизита = 1 Тогда
			ХарактерИзменения = НСтр("ru = 'Добавлена'");	
		Иначе
			ХарактерИзменения = НСтр("ru = 'Удалена'");		
		КонецЕсли;	
		
		Шаблон 			= НСтр("ru = 'Изменена табличная часть ""%1"". %2 строка табличной части №%3.'") + Символы.ПС;	
		ТекстИзменений 	= ТекстИзменений + СтрШаблон(Шаблон, ИмяТаблицы, ХарактерИзменения, НомерСтроки); 
		
	Иначе  
		
		Если ЗначениеЗаполнено(ЗначениеТекущее) Тогда 
			НовоеЗначение = ЗначениеТекущее;	
		Иначе
			НовоеЗначение = НСтр("ru = '<пустое значение>'");	
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ЗначениеБД) Тогда	
			СтароеЗначение = ЗначениеБД;
		Иначе 		
			СтароеЗначение = НСтр("ru = '<пустое значение>'");	
		КонецЕсли; 			
		
		Если ЗначениеЗаполнено(ИмяТаблицы) Тогда 
			Шаблон			= НСтр("ru = 'Изменена табличная часть ""%1"". В строке №%2 старое значение колонки %3 - %4, установленное значение %5.'") + Символы.ПС;		   	
			ТекстИзменений 	= ТекстИзменений + СтрШаблон(Шаблон, ИмяТаблицы, НомерСтроки, ИмяРеквизита, СтароеЗначение, НовоеЗначение);
		Иначе 
			Шаблон 			= НСтр("ru = 'Изменен реквизит %1. Старое значение %2, установленное значение %3.'") + Символы.ПС;	
			ТекстИзменений 	= ТекстИзменений + СтрШаблон(Шаблон, ИмяРеквизита, СтароеЗначение, НовоеЗначение);	
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти  

#КонецОбласти