
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаКлюча = Неопределено;
	
	Если Параметры.Свойство("НастройкаКлюча", НастройкаКлюча) Тогда 		
		
		Для каждого Ит Из НастройкаКлюча Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПолейКлюча.Добавить(), Ит);	
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПолейКлюча

&НаКлиенте
Процедура ТаблицаПолейКлючаПолеКлючаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ТаблицаПолейКлюча.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда  
		Если ЗначениеЗаполнено(ТекущаяСтрока.ПолеКлюча) Тогда 
			ТекущаяСтрока.Заголовок = ЗаголовокПоля(ТекущаяСтрока.ПолеКлюча);	
		Иначе
			ТекущаяСтрока.Заголовок = "";	
		КонецЕсли;				                                                                                                   
	КонецЕсли;                                  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Завершить(Команда)
	
	Результат = Новый Массив;
	
	Для каждого Ит Из ТаблицаПолейКлюча Цикл
		
		ОписаниеПоля = Новый Структура("ПолеКлюча, Заголовок");
		ЗаполнитьЗначенияСвойств(ОписаниеПоля, Ит);
		
		Результат.Добавить(ОписаниеПоля);	
		
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаголовокПоля(ТипПоля)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипПоля, "Заголовок");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 