#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает встроенный документ
//
// Параметры:
//  Правило	 - СправочникСсылка	 - правило инициализации документа
// 
// Возвращаемое значение:
//   - ТабличныйДокумент, ТекстовыйДокумент - результат
//
Функция ВыполнитьПравило(Правило) Экспорт
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(Правило) Тогда  		
		Хранилище = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Правило, "Хранилище");	
		Результат = Хранилище.Получить();   		
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли