#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет объект данным по табличному документу
//
// Параметры:
// ТабличныйДокумент - ТабличныйДокумент - проверяемый табличный документ
//
Процедура ЗаполнитьОписаниеМакета(ТабличныйДокумент = Неопределено) Экспорт
	
	Если ТабличныйДокумент = Неопределено Тогда
		Макет = Хранилище.Получить();	
	Иначе
		Макет = ТабличныйДокумент;
	КонецЕсли; 
	
	Области.Очистить();
	Параметры.Очистить();
	
	ДобавитьОбластиТабличногоДокумента(Макет); 
	
КонецПроцедуры  

#КонецОбласти 
	
#Область ОбработчикиСобытий   

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОписаниеМакета();	 		
	
КонецПроцедуры 

#КонецОбласти    

#Область СлужебныеПроцедурыИФункции   

Процедура ДобавитьОбластиТабличногоДокумента(ТабличныйДокумент, Индекс = 0, ИсключаемаяОбласть = "")
	
	Если ТипШаблона = 0 ИЛИ ТипШаблона = 1 Тогда 	 
	
		Для каждого Область Из ТабличныйДокумент.Области Цикл 		
			
			ИмяОбласти = Область.Имя;
			
			Если ИмяОбласти = ИсключаемаяОбласть ИЛИ Области.Найти(Область.Имя, "ИмяОбласти") <> Неопределено Тогда
				Продолжить;	
			КонецЕсли;		
			
			КлючСвязи		= Строка(Новый УникальныйИдентификатор);
			ОбластьМакета 	= ТабличныйДокумент.ПолучитьОбласть(Область.Имя);
			
			СтрокаОбласти 				= Области.Добавить();
			СтрокаОбласти.ИмяОбласти 	= ИмяОбласти;
			СтрокаОбласти.КлючСвязи		= КлючСвязи;
			СтрокаОбласти.Родитель		= Индекс;    
			
			Если Область.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда 		 
				
				Для НомерСтроки = 1 По ОбластьМакета.ПолучитьРазмерОбластиДанныхПоВертикали() Цикл
					Для НомерКолонки = 1 По ОбластьМакета.ПолучитьРазмерОбластиДанныхПоГоризонтали() Цикл
						ТекЯчейка = ОбластьМакета.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
						Если ТекЯчейка.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
							СтрокаПараметра 				= Параметры.Добавить();
							СтрокаПараметра.ИмяПараметра 	= ТекЯчейка.Параметр;
							СтрокаПараметра.КлючСвязи		= КлючСвязи;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
			КонецЕсли;
			
			ДобавитьОбластиТабличногоДокумента(ОбластьМакета, Области.Количество(), ИмяОбласти);
			
		КонецЦикла;	
	
	КонецЕсли;
	
КонецПроцедуры   

#КонецОбласти 

#КонецЕсли 