
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресХранилища = Параметры.АдресХранилища;
	           		
	Данные = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если ЗначениеЗаполнено(Данные) Тогда
		ЗаполнитьПоМетаданным(Данные);	
	Иначе
		ЗаполнитьПоМетаданным();			
	КонецЕсли; 		
	
КонецПроцедуры   

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьДанные(Команда)	
	
	ПодготовитьДанные();
	
	Закрыть(АдресХранилища);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоМетаданным(ДанныеЗаполнения = Неопределено)
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(Параметры.Секция);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда	
		
	Иначе 		 		
		
		Для каждого Ит Из МетаданныеОбъекта.Реквизиты Цикл  		
			НоваяСтрока 				= СписокРеквизитов.Добавить(); 
			НоваяСтрока.Флаг 			= Ложь; 
			НоваяСтрока.Представление 	= Ит.Имя + " (" + Ит.Синоним + ")";	
			НоваяСтрока.Имя 			= Ит.Имя;  		
		КонецЦикла; 		
		
		Для каждого Ит Из МетаданныеОбъекта.ТабличныеЧасти Цикл  		
			НоваяСтрока 				= СписокТабличныхЧастей.Добавить(); 
			НоваяСтрока.Флаг 			= Ложь; 
			НоваяСтрока.Представление 	= Ит.Имя + " (" + Ит.Синоним + ")";	
			НоваяСтрока.Имя 			= Ит.Имя;  		
		КонецЦикла;	 	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДанные()
	
	Отбор 					= Новый Структура("Флаг", Истина);
	Результат 				= Новый Структура("Реквизиты", "ТабличныеЧасти", Новый Массив, Новый Массив);  
	ВыбранныеРеквизиты 		= СписокРеквизитов.НайтиСтроки(Отбор);
	ВыбранныеТабличныеЧасти = СписокТабличныхЧастей.НайтиСтроки(Отбор);
	
	Для каждого Ит Из ВыбранныеРеквизиты Цикл
		Результат.Реквизиты.Добавить(Ит.Имя);			
	КонецЦикла;  
	
	Для каждого Ит Из ВыбранныеТабличныеЧасти Цикл
		Результат.ТабличныеЧасти.Добавить(Ит.Имя);			
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);	
	
КонецПроцедуры


#КонецОбласти





 

