#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Идентификатор.Доступность = Не ЗначениеЗаполнено(Объект.Ссылка);	
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ПриИзмененииНаименованияНаСервере();	
	
КонецПроцедуры  

#КонецОбласти  

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	Элементы.Идентификатор.Доступность = Истина;
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииНаименованияНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Заголовок) Тогда
		Объект.Заголовок = Объект.Наименование;	
	КонецЕсли;	  
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) ИЛИ НЕ ЗначениеЗаполнено(Объект.Идентификатор) Тогда
		Объект.Идентификатор = рнсОбщегоНазначения.ПолучитьИдентификатор(Объект.Наименование);	
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти  





 

