
#Область ОбработчикиФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	                	
	ПравилоОбъект 	= РеквизитФормыВЗначение("Объект");  	
	Данные 			= ПравилоОбъект.Хранилище.Получить();  
	
	Если Данные <> Неопределено Тогда 
		Если Объект.ТипШаблона = 0 Тогда
			ДокументТабличный 			= Данные;	
		ИначеЕсли Объект.ТипШаблона = 1 Тогда 
			ДокументТабличный.Макет 	= Истина;
			ДокументТабличный 			= Данные;
		ИначеЕсли Объект.ТипШаблона = 2 Тогда 
			ДокументФорматированный 	= Данные;
		ИначеЕсли Объект.ТипШаблона = 3 Тогда 
			ДокументТекстовый 			= Данные;
		КонецЕсли; 				 			
	КонецЕсли; 	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущуюСтраницу();		
	
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ТипШаблона = 0 Тогда
		Значение = ДокументТабличный;	
	ИначеЕсли Объект.ТипШаблона = 1 Тогда 
		Значение = ДокументТабличный;  		
	ИначеЕсли Объект.ТипШаблона = 2 Тогда 
		Значение = ДокументФорматированный;
	ИначеЕсли Объект.ТипШаблона = 3 Тогда 
		Значение = ДокументТекстовый;
	КонецЕсли; 
	
	ТекущийОбъект.Хранилище = Новый ХранилищеЗначения(Значение); 
	
КонецПроцедуры    

#КонецОбласти 

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ТипШаблонаПриИзменении(Элемент)
	     	
	УстановитьТекущуюСтраницу();
	ИзменениеТабличногоДокументаНаСервере();
	        	
КонецПроцедуры

&НаКлиенте
Процедура ОбластиПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Области.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Элементы.Параметры.ОтборСтрок = Неопределено;	
	Иначе
		Элементы.Параметры.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСвязи", ТекущаяСтрока.КлючСвязи);	
	КонецЕсли;    		
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции   

&НаСервере
Процедура ИзменениеТабличногоДокументаНаСервере()
	
	Если Объект.ТипШаблона = 0 Тогда
		ДокументТабличный.Макет = Ложь;
	ИначеЕсли Объект.ТипШаблона = 1 Тогда
		ДокументТабличный.Макет = Истина;
	КонецЕсли;  		
	
КонецПроцедуры   

&НаКлиенте
Процедура УстановитьТекущуюСтраницу()
	
	Если Объект.ТипШаблона = 0 Тогда
		ТекущаяСтраница = Элементы.СтраницаТабличныйДокумент;		
	ИначеЕсли Объект.ТипШаблона = 1 Тогда 
		ТекущаяСтраница = Элементы.СтраницаТабличныйДокумент; 		
	ИначеЕсли Объект.ТипШаблона = 2 Тогда 
		ТекущаяСтраница = Элементы.СтраницаФорматированныйДокумент;
	ИначеЕсли Объект.ТипШаблона = 3 Тогда 
		ТекущаяСтраница = Элементы.СтраницаТекстовыйДокумент;
	КонецЕсли;
	
	Для каждого Ит Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Ит.Видимость = Ложь;	
	КонецЦикла; 	
	
	Элементы.СтраницаОсновное.Видимость = Истина;
	ТекущаяСтраница.Видимость 			= Истина;
	Элементы.Страницы.ТекущаяСтраница 	= ТекущаяСтраница;
	
КонецПроцедуры
 
#КонецОбласти  