#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

// Возвращает данные для выполнения запроса из источника 
//
// Параметры:
//  ИсточникЗапроса	 - СправочникСсылка.рнсПравилаПолученияДанныхИБ, СправочникСсылка.рнсНастройкиВыполненияПравил, Строка	 - источник запроса
//  ПараметрыСКД	 - Структура	 - дополнительные параметры 
//  ИмяВТ			 - Строка	 - имя временной Таблицы
// 
// Возвращаемое значение:
//   - Структура - данные для выполнения запроса
//
Функция ПолучитьПараметрыВыполненияЗапроса(ИсточникЗапроса, ПараметрыСКД = Неопределено, ИмяВТ = "") Экспорт
	
	Результат 		= Неопределено;
	ТипИсточника 	= ТипЗнч(ИсточникЗапроса);
	      	
	Если ТипИсточника = Тип("СправочникСсылка.рнсПравилаПолученияДанныхИБ") Тогда  		
		
		СКД 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсточникЗапроса, "СхемаКомпоновкиДанных");
		Настройки 	= СКД.ПолучитьНастройки(); 	
		
	ИначеЕсли ТипИсточника = Тип("СправочникСсылка.рнсНастройкиВыполненияПравил") Тогда 
				                        		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рнсНастройкиВыполненияПравил.Владелец.СхемаКомпоновкиДанных КАК СхемаКомпоновкиДанных,
		|	рнсНастройкиВыполненияПравил.ХранилищеНастроекКомпоновкиДанных КАК ХранилищеНастроекКомпоновкиДанных,
		|	рнсНастройкиВыполненияПравил.ТекстЗапроса КАК ТекстЗапроса,
		|	рнсНастройкиВыполненияПравил.ХранилищеПараметров КАК ХранилищеПараметров
		|ИЗ
		|	Справочник.рнсНастройкиВыполненияПравил КАК рнсНастройкиВыполненияПравил
		|ГДЕ
		|	рнсНастройкиВыполненияПравил.Ссылка = &Ссылка"; 		
		
		Запрос.УстановитьПараметр("Ссылка", ИсточникЗапроса);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда 	
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТекстЗапроса) Тогда
				
				КоллекцияПараметров = ВыборкаДетальныеЗаписи.ХранилищеПараметров.Получить();
				
				Если ЗначениеЗаполнено(ПараметрыСКД) Тогда
					Для каждого Ит Из ПараметрыСКД Цикл
						КоллекцияПараметров.Вставить(Ит.Ключ, Ит.Значение);	
					КонецЦикла; 						
				КонецЕсли;
				
				Результат = Новый Структура("ТекстЗапроса, Параметры", 
												рнсСлужебный.ЗапросВоВременнуюТаблицу(ВыборкаДетальныеЗаписи.ТекстЗапроса, ИмяВТ), КоллекцияПараметров);	
				
				Если ЗначениеЗаполнено(ИмяВТ) Тогда
					Результат.Вставить("ИмяВременнойТаблицы", ИмяВТ);	
				КонецЕсли;
				
			Иначе
				СКД 		= ВыборкаДетальныеЗаписи.СхемаКомпоновкиДанных.Получить();
				Настройки	= ВыборкаДетальныеЗаписи.ХранилищеНастроекКомпоновкиДанных.Получить();	
			КонецЕсли; 			 			
		КонецЕсли; 			 
		
	Иначе
		
		Правило 	= Справочники.рнсПравилаПолученияДанныхИБ.НайтиПоКоду(ИсточникЗапроса); 
		СКД 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Правило, "СхемаКомпоновкиДанных");
		Настройки 	= СКД.ПолучитьНастройки();
		
	КонецЕсли; 
	
	Если СКД <> Неопределено Тогда 	 
	
		Если СКД.НаборыДанных.Количество() = 1 
			И ТипЗнч(СКД.НаборыДанных[0]) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			
			КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных; 	
			МакетКомпоновки 	= КомпоновщикМакета.Выполнить(СКД, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));  		
			
			Набор = МакетКомпоновки.НаборыДанных.Найти(СКД.НаборыДанных[0].Имя);
			
			Если Набор <> Неопределено Тогда  
				
				КоллекцияПараметров = Новый Структура;
				Для каждого Ит Из МакетКомпоновки.ЗначенияПараметров Цикл
					КоллекцияПараметров.Вставить(Ит.Имя, Ит.Значение);	
				КонецЦикла;  
				
				Если ЗначениеЗаполнено(ПараметрыСКД) Тогда
					Для каждого Ит Из ПараметрыСКД Цикл
						КоллекцияПараметров.Вставить(Ит.Ключ, Ит.Значение);	
					КонецЦикла; 						
				КонецЕсли; 
				
				Результат = Новый Структура("ТекстЗапроса, Параметры", 
												рнсСлужебный.ЗапросВоВременнуюТаблицу(Набор.Запрос, ИмяВТ), КоллекцияПараметров);
												
				Если ЗначениеЗаполнено(ИмяВТ) Тогда
					Результат.Вставить("ИмяВременнойТаблицы", ИмяВТ);	
				КонецЕсли;									
				
			КонецЕсли;  		
			
		КонецЕсли; 
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции   

// Получает данные для выполнения запроса, возвращающий... WMS4.6  
//
// Параметры:
//  КоллекцияНастройкиКлючи	 - Соответствие	 - Пара ключ - настройка и значение - ?
//  ИмяТаблицы				 - Строка	 - имя таблицы
//  ПрефиксПараметра		 - Строка	 - префикс параметра
//  Псевдоним				 - Строка	 - псевдоним таблицы
// 
// Возвращаемое значение:
//   - Структура - данные для выполнения запроса
//
Функция ПолучитьПараметрыВыполненияЗапросаКлючейПоПравилам(КоллекцияНастройкиКлючи, ИмяТаблицы, ПрефиксПараметра = "", Псевдоним = "Таблица") Экспорт
	
	ТекстИсключения					= НСтр("ru = '""Запрос по настройке %1 не может быть получен.""'");
	МассивЗапросов					= Новый Массив;
	Индекс 							= 0;
	ПараметрыЗапроса 				= Новый Структура;
	ШаблонТекстаЗапросаПоНастройке 	= "ВЫБРАТЬ
										|	" + Псевдоним + ".Ссылка КАК Ссылка
										|ИЗ
										|	(#ТекстЗапросаИзНастройки#) КАК Данные
										|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ИмяТаблицы + " КАК " + Псевдоним + "
										|		ПО (ИСТИНА)
										|ГДЕ " + Псевдоним + ".Ссылка В (&" + ПрефиксПараметра + "СП_СписокКлючей#Индекс#)";
	
	Для каждого Ит Из КоллекцияНастройкиКлючи Цикл  	 
		
		ДанныеНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ит.Ключ, "Владелец.ВариантВыполнения, ТекстЗапроса, ХранилищеПараметров, Представление, Владелец");
		
		Если ДанныеНастройки.ВладелецВариантВыполнения = Перечисления.рнсВариантВыполненияПравила.ЗапросСОбъединением  Тогда 		 
			
			ТекстЗапроса 			= ДанныеНастройки.ТекстЗапроса;
			КоллекцияПараметров 	= ДанныеНастройки.ХранилищеПараметров.Получить(); 		
			
			Для каждого ПараметрЗапроса Из КоллекцияПараметров Цикл  									 
				ИмяПараметра = ПараметрЗапроса.Ключ + "_" + Индекс;  						  						
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&" + ПараметрЗапроса.Ключ, "&" + ПрефиксПараметра + ИмяПараметра);	
				ПараметрыЗапроса.Вставить(ИмяПараметра, ПараметрЗапроса.Значение);   						
			КонецЦикла; 
			
			ПараметрыЗапроса.Вставить("СП_СписокКлючей" + Индекс, Ит.Значение);
			
			ТекстЗапросаПоНастройке = СтрЗаменить(ШаблонТекстаЗапросаПоНастройке, "#Индекс#", Формат(Индекс, "ЧЦ=10; ЧН=0; ЧГ=0"));                         
			МассивЗапросов.Добавить(СтрЗаменить(ТекстЗапросаПоНастройке, "#ТекстЗапросаИзНастройки#", ТекстЗапроса));		
			
			Индекс = Индекс + 1;
			
		Иначе
			ВызватьИсключение СтрШаблон(ТекстИсключения, ДанныеНастройки.Представление);
		КонецЕсли; 	
	
	КонецЦикла; 	
	
	Результат 				= Новый Структура("ТекстЗапроса, Параметры");
	Результат.ТекстЗапроса 	= СтрСоединить(МассивЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	Результат.Параметры 	= ПараметрыЗапроса;	
	
	Возврат Результат;
	
КонецФункции  

#КонецОбласти  

#КонецЕсли



 
 
 