#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий   

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если РежимРаботы = 0 Тогда
		
		ТипЗначения = Неопределено;		
		
	ИначеЕсли РежимРаботы = 1 Тогда
		
		НастройкаПоУмолчанию 	= Неопределено;
		ИмяКолонкиРезультата 	= Неопределено;  		
		ИгнорироватьСтруктуру   = Ложь;
		
		ПроверяемыеРеквизиты.Добавить("ТипЗначения");
		
	ИначеЕсли РежимРаботы = 2 Тогда
		
		ТипЗначения 			= Неопределено;
		НастройкаПоУмолчанию 	= Неопределено;
		ИмяКолонкиРезультата 	= Неопределено;
		ЕдинственноеЗначение 	= Ложь;  
		ИгнорироватьСтруктуру   = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры
    
#КонецОбласти  

#КонецЕсли
