// ТипДанныхВыбора - данные для выбора
// 0 - метаданные объектов ИБ
// 1 - пакеты XDTO  
// 2 - доступные типы 
// 3 - формы конфигурации
//
// ТипРезультата - какие данные вернет форма при закрытии
// для ссылочных типов и регистров:
// 0 - массив полных имен метаданных
// 1 - массив имен типов 
// 2 - описание типов выбранных метаданных
// для типов XDTO:
// 0 - массив структур ИмяТипаXDTO, URIПространстваИмен
// 1 - массив ТипОбъектаXDTO, ТипЗначенийXDTO
// для доступные типов
// 0 - массив имен типов 
// 1 - описание типов выбранных метаданных
//
// Ограничения
// Для метаданных конфигурации(только если набор пустой) 										
// Структура - Ключ - ПоСоставуПланаОбмена
//			  Значение - узел плана обмена, имя плана обмена
//			  Ключ - ПоКоллекцииМетаданных
//			  Значение - Строка, Массив строк имен коллекция метаданных 	
// Для пакетов XDTO  										
// Структура - Ключ - ПространствоИмен
//			  Значение - массив пространств имен
// 			  Ключ - БазовыйТип
//			  Значение - Соответствие: Ключ - ПространствоИмен, Значение - массив имен базовых типов
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрешитьМножественныйВыбор	= Неопределено;
	Набор						= Неопределено;
	Отмеченные					= Неопределено; 	
	Ограничения					= Неопределено;	 
	         
	Параметры.Свойство("МножественныйВыбор", РазрешитьМножественныйВыбор);
	Параметры.Свойство("СтандартныйРежимВыбора", СтандартныйРежимВыбора); 
	Параметры.Свойство("Отмеченные", Отмеченные);
	Параметры.Свойство("Набор", Набор);
	Параметры.Свойство("Ограничения", Ограничения); 	 

	// проверить для XDTO !!!
	ОтмеченныеМетаданные 	= СписокОтмеченных(Отмеченные);  
	МножественныйВыбор		= ОтмеченныеМетаданные.Количество() > 1;	
	
	Если Параметры.ТипДанныхВыбора = 1 Тогда  															  
															  
		Заголовок 													= НСтр("ru = 'Выбор типа XDTO'");
		Элементы.СтраницыДанныеВыбора.ТекущаяСтраница 				= Элементы.СтраницаДеревоПакетовXDTO; 		  
		Элементы.ДеревоПакетовXDTOКоличествоОтмеченных.Видимость 	= РазрешитьМножественныйВыбор; 
		Элементы.ДеревоПакетовXDTOФлаг.Видимость 					= РазрешитьМножественныйВыбор;
		
		СформироватьДеревоПакетовXDTO(Набор, Ограничения, ОтмеченныеМетаданные)	
		
	ИначеЕсли Параметры.ТипДанныхВыбора = 2 Тогда 
		
		Заголовок 													= НСтр("ru = 'Выбор типа'");
		Элементы.СтраницыДанныеВыбора.ТекущаяСтраница 				= Элементы.СтраницаДеревоМетаданных;
		Элементы.ГруппаРежим.Видимость 								= Ложь;		
		Элементы.МножественныйВыбор.Заголовок 						= НСтр("ru = 'Составной тип'");
		Элементы.ДеревоМетаданныхКоличествоОтмеченных.Видимость 	= РазрешитьМножественныйВыбор; 
		Элементы.ДеревоМетаданныхФлаг.Видимость 					= РазрешитьМножественныйВыбор;
		
		СформироватьДеревоСсылочныхТиповИБ(Набор, Ограничения, ОтмеченныеМетаданные); 
		
	ИначеЕсли Параметры.ТипДанныхВыбора = 3 Тогда
		
		Заголовок 													= НСтр("ru = 'Выбор формы'");
		Элементы.СтраницыДанныеВыбора.ТекущаяСтраница 				= Элементы.СтраницаДеревоМетаданных;		
		Элементы.ДеревоМетаданныхКоличествоОтмеченных.Видимость 	= РазрешитьМножественныйВыбор; 
		Элементы.ДеревоМетаданныхФлаг.Видимость 					= РазрешитьМножественныйВыбор;
		
		СформироватьДеревоМетаданныхИБ(Набор, Ограничения, ОтмеченныеМетаданные, Новый Структура("ВыборФорм"));
		
	Иначе
		
		Заголовок 													= НСтр("ru = 'Выбор метаданных'");
		Элементы.СтраницыДанныеВыбора.ТекущаяСтраница 				= Элементы.СтраницаДеревоМетаданных;		
		Элементы.ДеревоМетаданныхКоличествоОтмеченных.Видимость 	= РазрешитьМножественныйВыбор; 
		Элементы.ДеревоМетаданныхФлаг.Видимость 					= РазрешитьМножественныйВыбор;
		
		СформироватьДеревоМетаданныхИБ(Набор, Ограничения, ОтмеченныеМетаданные);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  	
	
	ПриИзмененииРежимаВыбора();	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Элементы.ИмяТаблицы.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокВыбораМетаданных(ТипМетаданных));	
	
КонецПроцедуры   

#КонецОбласти 

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ДеревоПакетовXDTOВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МножественныйВыборПриИзменении(Элемент)
	
	Если Параметры.ТипДанныхВыбора = 1 Тогда 		 		  
		Элементы.ДеревоПакетовXDTOКоличествоОтмеченных.Видимость 	= МножественныйВыбор;	
		Элементы.ДеревоПакетовXDTOФлаг.Видимость 					= МножественныйВыбор;
	Иначе 				
		Элементы.ДеревоМетаданныхКоличествоОтмеченных.Видимость 	= МножественныйВыбор;
		Элементы.ДеревоМетаданныхФлаг.Видимость 					= МножественныйВыбор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипТаблицыПриИзменении(Элемент)
	
	Элементы.ИмяТаблицы.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокВыбораМетаданных(ТипМетаданных));
	
КонецПроцедуры 

&НаКлиенте
Процедура ДеревоМетаданныхФлагПриИзменении(Элемент)
	
	УстановитьПометкуСтрокиДерева(Элемент.Родитель.Родитель.Имя); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПакетовXDTOФлагПриИзменении(Элемент)
	
	УстановитьПометкуСтрокиДерева(Элемент.Родитель.Родитель.Имя);	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКоманд

&НаКлиенте
Процедура СнятьПометки(Команда) 
	
	Если Параметры.ТипДанныхВыбора = 1 Тогда
		УстановитьПометкуВПодчиненныхУзлах(ДеревоПакетовXDTO, Ложь);
	Иначе
		УстановитьПометкуВПодчиненныхУзлах(ДеревоМетаданных, Ложь);	
	КонецЕсли;  
	 	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	Если Параметры.ТипДанныхВыбора = 1 Тогда
		УстановитьПометкуВПодчиненныхУзлах(ДеревоПакетовXDTO, Истина);
	Иначе
		УстановитьПометкуВПодчиненныхУзлах(ДеревоМетаданных, Истина);	
	КонецЕсли;  
	 
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	Результат = Неопределено;
	
	Если СтандартныйРежимВыбора Тогда
		
		Если ЗначениеЗаполнено(ИмяМетаданных) И ЗначениеЗаполнено(ТипМетаданных) Тогда 	
			
			Результат = Новый Массив;
			ПолноеИмя = ПолноеИмяМетаданных(ИмяМетаданных, ТипМетаданных); 						

			Если Параметры.ТипРезультата = 1 Тогда  				
				Результат.Добавить(СтрЗаменить(ПолноеИмя, ".", "Ссылка."));								
			Иначе 				
				Результат.Добавить(ПолноеИмя);				
			КонецЕсли; 			
			
		КонецЕсли;
		
	Иначе 		 	
		
		ТекущееДерево	= ?(Параметры.ТипДанныхВыбора = 1, ДеревоПакетовXDTO, ДеревоМетаданных);
		КорневыеУзлы	= ТекущееДерево.ПолучитьЭлементы();
		ВыбранныеУзлы 	= Новый Массив; 
		
		ОпределитьВыбранныеУзлыДерева(КорневыеУзлы, ВыбранныеУзлы); 
		
		Результат = ПодготовитьРезультат(ВыбранныеУзлы);		
		  				
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры  

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Если Параметры.ТипРезультата = 1 Тогда
		Результат = Неопределено;	
	ИначеЕсли Параметры.ТипРезультата = 2 Тогда 
		Если Параметры.ТипДанныхВыбора = 1 Тогда
			Результат = Неопределено;	
		Иначе
			Результат = Новый ОписаниеТипов;	
		КонецЕсли; 			
	Иначе
		Результат = Неопределено;		
	КонецЕсли; 
	
	Закрыть(Результат);	
	
КонецПроцедуры  

&НаКлиенте
Процедура РасширенныйРежимВыбора(Команда)
	
	СтандартныйРежимВыбора = Ложь;
	ПриИзмененииРежимаВыбора();	
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартныйРежимВыбора(Команда)
	
	СтандартныйРежимВыбора = Истина;
	ПриИзмененииРежимаВыбора();	
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущийУзел = Элементы[Элемент.Имя].ТекущиеДанные;
	
	Если ТекущийУзел <> Неопределено Тогда		
		
		Если МножественныйВыбор Тогда
			ТекущийУзел.Флаг = НЕ ТекущийУзел.Флаг;
			УстановитьПометкуВПодчиненныхУзлах(ТекущийУзел, ТекущийУзел.Флаг);	
		Иначе
			МассивУзлов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущийУзел);
			Закрыть(ПодготовитьРезультат(МассивУзлов));
		КонецЕсли;  		 	
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ОпределитьВыбранныеУзлыДерева(УзлыДерева, Результат)
	           	
	Для каждого ТекущийУзел Из УзлыДерева Цикл
		
		ПодчиненныеУзлы = ТекущийУзел.ПолучитьЭлементы();
		
		Если ПодчиненныеУзлы.Количество() = 0 Тогда			
			Если ТекущийУзел.Флаг Тогда  			
				Результат.Добавить(ТекущийУзел);	
			КонецЕсли;     		
		Иначе  		
			Если ТекущийУзел.КоличествоОтмеченных > 0 Тогда 			
				ОпределитьВыбранныеУзлыДерева(ПодчиненныеУзлы, Результат);				
			КонецЕсли;   		
		КонецЕсли; 	
				
	КонецЦикла;	
	
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьПометкуСтрокиДерева(ИмяДерева)
	
	ДеревоФормы = ЭтаФорма[ИмяДерева];  
	ТекущийУзел = Элементы[ИмяДерева].ТекущиеДанные;
	
	Если ТекущийУзел = Неопределено Тогда
		Возврат;	
	КонецЕсли; 	
	
	Количество				= 1;
	ЗначениеФлага			= ?(ТекущийУзел.Флаг = 2, 0, ТекущийУзел.Флаг); 
	УзелРодитель 			= ТекущийУзел.ПолучитьРодителя();    
	КоличествоПодчиненных	= ТекущийУзел.ПолучитьЭлементы().Количество();	
	
	Если КоличествоПодчиненных > 0 Тогда
		
		Если МножественныйВыбор Тогда   		
			Количество 							= УстановитьПометкуВПодчиненныхУзлах(ТекущийУзел, ЗначениеФлага);
			ТекущийУзел.КоличествоОтмеченных 	= ?(ЗначениеФлага <> 0, Количество, 0);  		
		Иначе			   
			
			УстановитьПометкуВПодчиненныхУзлах(ТекущийУзел, 0); 
			
			ТекущийУзел.КоличествоОтмеченных 	= 0;
			ЗначениеФлага 						= 0;
			
		КонецЕсли;	
		
	Иначе 			
		Если НЕ МножественныйВыбор И ЗначениеФлага <> 0 Тогда
			УстановитьПометкуВПодчиненныхУзлах(ДеревоФормы, 0);				
		КонецЕсли; 	
	КонецЕсли;     
	
	ТекущийУзел.Флаг = ЗначениеФлага;		
	
	Пока УзелРодитель <> Неопределено Цикл  		
		
		Если МножественныйВыбор Тогда
			УзелРодитель.КоличествоОтмеченных = УзелРодитель.КоличествоОтмеченных + ?(ЗначениеФлага <> 0, Количество, -Количество);			
		Иначе
			УзелРодитель.КоличествоОтмеченных = ?(ЗначениеФлага <> 0, 1, 0);	
		КонецЕсли;   		
		
		Если УзелРодитель.ПолучитьЭлементы().Количество() = УзелРодитель.КоличествоОтмеченных Тогда    		
			УзелРодитель.Флаг = 2; // необх просмотр подчиненных элементов	
		Иначе
			Если УзелРодитель.КоличествоОтмеченных = 0 Тогда 
				УзелРодитель.Флаг = 0;
			Иначе
				УзелРодитель.Флаг = 2;
			КонецЕсли;
		КонецЕсли; 		
				
		УзелРодитель 	= УзелРодитель.ПолучитьРодителя();	 		
		
	КонецЦикла; 	 		
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриИзмененииРежимаВыбора()
	   			
	Если СтандартныйРежимВыбора Тогда
		
		Элементы.Страницы.ТекущаяСтраница 		= Элементы.СтраницаСтандартныйВыбор; 	
		Элементы.МножественныйВыбор.Видимость 	= Ложь;
		Элементы.СтандартныйРежимВыбора.Пометка = Истина;
		Элементы.УпрощенныйРежимВыбора.Пометка 	= Ложь;
		
		Если НЕ ЗначениеЗаполнено(ТипМетаданных) И Элементы.ТипТаблицы.СписокВыбора.Количество() = 1 Тогда
			ТипМетаданных = Элементы.ТипТаблицы.СписокВыбора[0];	
		КонецЕсли; 		
		
	Иначе
		Элементы.Страницы.ТекущаяСтраница 		= Элементы.СтраницаРасширенныйВыбор; 	
		Элементы.МножественныйВыбор.Видимость 	= Истина; 
		Элементы.СтандартныйРежимВыбора.Пометка = Ложь;
		Элементы.УпрощенныйРежимВыбора.Пометка 	= Истина;
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбораМетаданных(ТипТаблицы)
	
	Результат = Новый Массив;
	
	Если ЗначениеЗаполнено(ТипТаблицы) Тогда
		Для каждого Ит Из Метаданные[ТипТаблицы] Цикл
			Результат.Добавить(Ит.Имя);		
		КонецЦикла; 			
	КонецЕсли; 
	
	Возврат Результат; 
	
КонецФункции 

&НаКлиенте
Функция УстановитьПометкуВПодчиненныхУзлах(Узел, Значение, ПолеФлажка = "Флаг")
	                      	
	ВыполнитьОбходСтрок = Истина;
	КоллекцияЭлементов 	= Узел.ПолучитьЭлементы(); 
	Результат			= 0;
	
	Если ТипЗнч(Узел) = Тип("ДанныеФормыЭлементДерева") Тогда  		
		ВыполнитьОбходСтрок 		= Узел.КоличествоОтмеченных > 0 И Значение = 0 ИЛИ Значение > 0;	
		Узел.КоличествоОтмеченных 	= ?(Значение = 0, 0, КоллекцияЭлементов.Количество());
	КонецЕсли; 	 		
		
	Для каждого Ит Из КоллекцияЭлементов Цикл
		
		Ит[ПолеФлажка] 			= Значение;	
		КоличествоПодчиненных 	= Ит.ПолучитьЭлементы().Количество();
		
		Если КоличествоПодчиненных = 0 Тогда
			Результат = Результат + 1;			
		Иначе
			Если ВыполнитьОбходСтрок Тогда 			
				Результат = Результат + УстановитьПометкуВПодчиненныхУзлах(Ит, Значение);
			КонецЕсли; 	
		КонецЕсли;				
		
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция ПодготовитьРезультат(МассивУзлов)
	           
	Результат = Неопределено;  
	
	Если НЕ ЗначениеЗаполнено(МассивУзлов) Тогда
		Возврат	Результат;
	КонецЕсли;
	
	Если Параметры.ТипДанныхВыбора = 1 Тогда 	
		
		Результат = Новый Массив;		  			
			
		Для каждого Ит Из МассивУзлов Цикл
			Если Параметры.ТипРезультата = 1 Тогда  
				// Фабрика работает только на сервере, на клиенте возврат Неопределено
				// оставлю Результат.Добавить(ФабрикаXDTO.Тип(Ит.ПространствоИмен, Ит.ИмяТипа)); 				 						
			Иначе
				Результат.Добавить(Новый Структура("ИмяТипаXDTO, URIПространстваИмен", Ит.ИмяТипа, Ит.ПространствоИмен));			
			КонецЕсли;	
		КонецЦикла;				
		
	ИначеЕсли Параметры.ТипДанныхВыбора = 2 Тогда
		
		ИтоговыйМассив = Новый Массив;		 			
			
		Для каждого Ит Из МассивУзлов Цикл						
			Если Параметры.ТипРезультата = 1 Тогда
				ИтоговыйМассив.Добавить(Тип(Ит.Тип)); 						
			Иначе
				ИтоговыйМассив.Добавить(Ит.Тип);			
			КонецЕсли;	
		КонецЦикла; 				
		
		Если Параметры.ТипРезультата = 1 Тогда	
			Результат = Новый ОписаниеТипов(ИтоговыйМассив);					
		Иначе 				
			Результат = ИтоговыйМассив;				
		КонецЕсли; 			
		
	Иначе  
		
		ИтоговыйМассив  = Новый Массив; 		  			
			
		Для каждого Ит Из МассивУзлов Цикл
			Если Параметры.ТипРезультата = 1 Тогда
				ИтоговыйМассив.Добавить(Ит.Тип);
			ИначеЕсли Параметры.ТипРезультата = 2 Тогда
				ИтоговыйМассив.Добавить(Тип(Ит.Тип)); 						
			Иначе
				ИтоговыйМассив.Добавить(Ит.ПолноеИмяМетаданных);			
			КонецЕсли;	
		КонецЦикла; 				
		
		Если Параметры.ТипРезультата = 2 Тогда	
			Результат = Новый ОписаниеТипов(ИтоговыйМассив);					
		Иначе 				
			Результат = ИтоговыйМассив;				
		КонецЕсли;			
		
	КонецЕсли; 	
	
	Возврат Результат;
	
КонецФункции 

&НаСервере
Функция СписокОтмеченных(ОтмеченныеМетаданные)
	
	Результат 				= Неопределено; 
	ТипКоллекцииОтмеченных 	= ТипЗнч(ОтмеченныеМетаданные);
	
	Если ОтмеченныеМетаданные = Неопределено Тогда  
		Если Параметры.ТипДанныхВыбора = 1 Тогда   
			Результат = Новый Соответствие;
		Иначе
			Результат = Новый Массив;
		КонецЕсли;			
	Иначе
		Если ТипКоллекцииОтмеченных = Тип("ОписаниеТипов") Тогда
			Для каждого Ит Из ОтмеченныеМетаданные.Типы() Цикл 
				МетаданныеОбъекта = Метаданные.НайтиПоТипу(Ит);
				Если МетаданныеОбъекта = Неопределено Тогда 
					Результат.Добавить(Ит);	
				Иначе 
					Результат.Добавить(МетаданныеОбъекта.ПолноеИмя());	
				КонецЕсли;					
			КонецЦикла; 
		ИначеЕсли ТипКоллекцииОтмеченных = Тип("Массив") Тогда 
			Результат = ОтмеченныеМетаданные;  
		ИначеЕсли ТипКоллекцииОтмеченных = Тип("СписокЗначений") Тогда
			Результат = ОтмеченныеМетаданные.ВыгрузитьЗначения();	
		Иначе    
			
			Если Параметры.ТипДанныхВыбора = 1 Тогда   
				Результат = ОтмеченныеМетаданные;
			Иначе
				Результат = Новый Массив;
				Результат.Добавить(ОтмеченныеМетаданные);
			КонецЕсли; 			
			
		КонецЕсли;		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// пакеты XDTO

&НаСервере
Процедура СформироватьДеревоПакетовXDTO(НаборыПакетов, Ограничения, Отмеченные)
	
	НаборПакетовXDTO				= Неопределено;
	КоллекцияБазовыхТипов			= Неопределено;
	МассивПространствИмен 			= Неопределено;
	КорневыеЭлементы 				= ДеревоПакетовXDTO.ПолучитьЭлементы();
	КартинкаГруппы					= БиблиотекаКартинок.ВнешнийИсточникДанныхКуб;
	КартинкаУзлаТипа				= БиблиотекаКартинок.ВыбратьТип;
	КартинкаУзлаОбъекта				= БиблиотекаКартинок.Реквизит; 
	ЕстьОграничения					= ЗначениеЗаполнено(Ограничения);
	ЕстьОграниченияПоБазовомуТипу 	= ЕстьОграничения И Ограничения.Свойство("БазовыйТип", КоллекцияБазовыхТипов); 	
	
	Если ЗначениеЗаполнено(НаборыПакетов) Тогда
		
		НаборПакетовXDTO = Новый Массив;
		
		Для каждого Ит Из НаборыПакетов Цикл
			ПакетXDTO = Метаданные.ПакетыXDTO.Найти(Ит);
			Если ПакетXDTO <> Неопределено Тогда
				НаборПакетовXDTO.Добавить(ПакетXDTO);		
			КонецЕсли; 	
		КонецЦикла;
		
	Иначе
		НаборПакетовXDTO = Метаданные.ПакетыXDTO;				
	КонецЕсли;
	
	Если ЕстьОграничения И Ограничения.Свойство("ПространствоИмен", МассивПространствИмен)Тогда
		
		КоллекцияПакетовXDTO = Новый Массив;
		
		Для каждого ПакетXDTO Из НаборПакетовXDTO Цикл
			Если МассивПространствИмен.Найти(ПакетXDTO.ПространствоИмен) <> Неопределено Тогда
				КоллекцияПакетовXDTO.Добавить(ПакетXDTO);	
			КонецЕсли; 	
		КонецЦикла;	
		
	Иначе
		КоллекцияПакетовXDTO = НаборПакетовXDTO;	
	КонецЕсли;	 	
	
	Для каждого ПакетXDTO Из КоллекцияПакетовXDTO Цикл
		
		ПространствоИмен 		= ПакетXDTO.ПространствоИмен;  		
		ДанныеПакетаXDTO 		= ФабрикаXDTO.Пакеты.Получить(ПространствоИмен); 		
		КоличествоОтмеченных	= 0;		   		
		
		Если ЗначениеЗаполнено(Отмеченные) Тогда
			МассивОтмеченных = Отмеченные.Получить(ПространствоИмен);	
		КонецЕсли; 			 
		
		УзелГруппы 					= КорневыеЭлементы.Добавить();
		УзелГруппы.Представление 	= ПакетXDTO.Синоним + " [" + ПакетXDTO.Имя + "]";
		УзелГруппы.ИмяТипа 			= ПакетXDTO.Имя; 
		УзелГруппы.ПространствоИмен	= ПространствоИмен;
		УзелГруппы.Картинка			= КартинкаГруппы;
		ПодчиненныеУзлы 			= УзелГруппы.ПолучитьЭлементы();
		
		Для каждого Ит Из ДанныеПакетаXDTO Цикл
			
			ТипЭлемента = ТипЗнч(Ит);
			БазовыйТип  = Ит.БазовыйТип;
			
			Если ЕстьОграниченияПоБазовомуТипу Тогда
				
				ОграничениеБазовыхТипов = КоллекцияБазовыхТипов.Получить(БазовыйТип.URIПространстваИмен);				
				
				Если ОграничениеБазовыхТипов = Неопределено Тогда
					Продолжить;
				Иначе
					Если ОграничениеБазовыхТипов.Найти(БазовыйТип.Имя) = Неопределено Тогда
						Продолжить;	
					КонецЕсли;	
				КонецЕсли;				 	   				 
			
			КонецЕсли; 			
			
			Узел 					= ПодчиненныеУзлы.Добавить();
			Узел.ИмяТипа 			= Ит.Имя;
			Узел.Представление 		= Ит.Имя;
			Узел.Флаг				= ?(ЗначениеЗаполнено(МассивОтмеченных), МассивОтмеченных.Найти(Ит.Имя) <> Неопределено, Ложь);
			Узел.БазовыйТип         = Строка(Ит.БазовыйТип); 			
			Узел.ПространствоИмен	= ПространствоИмен;
			
			Если ТипЭлемента = Тип("ТипЗначенияXDTO") Тогда
				Узел.Картинка = КартинкаУзлаТипа;	
			ИначеЕсли ТипЭлемента = Тип("ТипОбъектаXDTO") Тогда 	
			 	Узел.Картинка = КартинкаУзлаОбъекта;
			КонецЕсли; 							
			
			КоличествоОтмеченных = КоличествоОтмеченных + ?(Узел.Флаг, 1, 0);			
			
		КонецЦикла;  		
		
		УзелГруппы.КоличествоОтмеченных 	= КоличествоОтмеченных;
		УзелГруппы.Флаг 					= КоличествоОтмеченных > 0;
		
	КонецЦикла; 	
	
КонецПроцедуры 

// доступные типы 

&НаСервере
Процедура СформироватьДеревоСсылочныхТиповИБ(НаборыМетаданных, Ограничения, ОтмеченныеМетаданные)
	
	КорневыеЭлементы 		= ДеревоМетаданных.ПолучитьЭлементы();
	МассивПростыхТипов 		= ТипыДанных(); 
	ПараметрыФормирования	= Новый Структура("Перечисления", Истина);
	
	Для Каждого ОписаниеТипа Из МассивПростыхТипов Цикл			
			
		Узел 						= КорневыеЭлементы.Добавить();
		Узел.Представление 			= ОписаниеТипа.ИмяТипа;
		Узел.Флаг					= ОтмеченныеМетаданные.Найти(ОписаниеТипа.ИмяТипа) <> Неопределено;
		Узел.Картинка				= ОписаниеТипа.Картинка;
		Узел.ИмяМетаданных 			= "";
		Узел.ПолноеИмяМетаданных 	= ""; 
		Узел.Тип 					= ОписаниеТипа.ИмяТипа;
		               
	КонецЦикла;	
	
	СформироватьДеревоМетаданныхИБ(1, Неопределено, ОтмеченныеМетаданные, ПараметрыФормирования); 	
	
КонецПроцедуры 

&НаСервере
Функция ТипыДанных()
	
	Результат = Новый Массив;  
	Результат.Добавить(Новый Структура("ИмяТипа, Картинка", "Булево", БиблиотекаКартинок.ПолеВводаОткрыть));
	Результат.Добавить(Новый Структура("ИмяТипа, Картинка", "Строка", БиблиотекаКартинок.ПолеВводаОткрыть));  	
	Результат.Добавить(Новый Структура("ИмяТипа, Картинка", "Дата", БиблиотекаКартинок.ПолеВводаОткрыть));
	Результат.Добавить(Новый Структура("ИмяТипа, Картинка", "Число", БиблиотекаКартинок.ПолеВводаОткрыть));
	Результат.Добавить(Новый Структура("ИмяТипа, Картинка", "NULL", БиблиотекаКартинок.ПолеВводаОткрыть)); 
	Результат.Добавить(Новый Структура("ИмяТипа, Картинка", "Неопределено", БиблиотекаКартинок.ПолеВводаОткрыть));
	Результат.Добавить(Новый Структура("ИмяТипа, Картинка", "УникальныйИдентификатор", БиблиотекаКартинок.ПолеВводаОткрыть)); 
	
	Возврат Результат;
	
КонецФункции  

// метаданные 

&НаСервереБезКонтекста
Функция ПолучитьМетаданныеКонфигурации(ТолькоСсылочногоТипа, ТолькоРегистры, ДополнительныеПараметры = Неопределено)
	
	ПараметрыФормирования 	= Новый Структура("Перечисления", Ложь);
	Результат 				= ИнициализироватьТаблицуМетаданных(); 	
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДополнительныеПараметры);	
	КонецЕсли;
	
	Если ТолькоСсылочногоТипа Тогда	   		
		
		Если ПараметрыФормирования.Перечисления Тогда
			ДобавитьСтрокуКоллекцииМетаданных(Результат, "Перечисления");	
		КонецЕсли;
		
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "Справочники");		
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "Документы");
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "ПланыВидовХарактеристик");
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "ПланыСчетов");
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "ПланыВидовРасчета");
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "БизнесПроцессы");
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "Задачи");
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "ПланыОбмена"); 			
		
	КонецЕсли;
	
	Если ТолькоРегистры Тогда		
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "РегистрыСведений");
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "РегистрыНакопления");
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "РегистрыБухгалтерии");
		ДобавитьСтрокуКоллекцииМетаданных(Результат, "РегистрыРасчета");	 	
	КонецЕсли;  
	
	
	
	Возврат Результат; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМетаданныеИзСоставаПланаОбмена(Набор, ЗначениеОтбора)
	
	КоллекцияВидМетаданныхСтрокаТаблицы = Новый Соответствие;
	ТипОтбора 							= ТипЗнч(ЗначениеОтбора);
	Результат 							= ИнициализироватьТаблицуМетаданных();
	
	Если ТипОтбора = Тип("Строка") Тогда
		МетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(ЗначениеОтбора);	
	ИначеЕсли ТипОтбора = Тип("ОбъектМетаданных") Тогда
		МетаданныеПланаОбмена = ЗначениеОтбора;	
	Иначе
		МетаданныеПланаОбмена = ЗначениеОтбора.Метаданные();	
	КонецЕсли; 
	
	Для каждого Ит Из МетаданныеПланаОбмена.Состав Цикл
		
		ЭтоСсылочныйТип		= Неопределено;
		ПолноеИмя 			= Ит.Метаданные.ПолноеИмя(); 
		ПТ					= СтрНайти(ПолноеИмя, "."); 		
		ВидОбъекта 			= Лев(ПолноеИмя, ПТ - 1);
		ИмяКоллекции		= ВидОбъектаПоПолномуИмени(ПолноеИмя, ЭтоСсылочныйТип);
		
		Если Набор = 1 Тогда
			ДобавитьУзел = ЭтоСсылочныйТип;	
		ИначеЕсли Набор = 2 Тогда 
			ДобавитьУзел = НЕ ЭтоСсылочныйТип;
		Иначе
			ДобавитьУзел = Истина;	
		КонецЕсли; 
		
		Если ДобавитьУзел Тогда 		 
		
			Элемент = КоллекцияВидМетаданныхСтрокаТаблицы.Получить(ВидОбъекта);
			
			Если Элемент = Неопределено Тогда		
				
				Картинка						= БиблиотекаКартинок[ВидОбъекта];
				КоллекцияМетаданных 			= Новый Массив;			
				НоваяСтрока 					= ДобавитьСтрокуКоллекцииМетаданных(Результат, ИмяКоллекции);
				НоваяСтрока.КоллекцияМетаданных = КоллекцияМетаданных; 	
				
				КоллекцияВидМетаданныхСтрокаТаблицы.Вставить(ВидОбъекта, НоваяСтрока);
				
			Иначе 			
				КоллекцияМетаданных = Элемент.КоллекцияМетаданных;			
			КонецЕсли; 
			
			КоллекцияМетаданных.Добавить(Ит.Метаданные);
		
		КонецЕсли;
		
	КонецЦикла; 	
	
	Возврат Результат;
	
КонецФункции
   
&НаСервереБезКонтекста
Функция ДобавитьСтрокуКоллекцииМетаданных(Таблица, Знач ИмяКоллекции, КоллекцияМетаданных = Неопределено, Дополнительно = Неопределено)
	
	ЭтоРегистр 		= Ложь; 
	ЭтоСсылочныйТип = Ложь;
	Картинка		= Неопределено;
	Точка 			= СтрНайти(ИмяКоллекции, ".");
	
	Если Точка > 0 Тогда  
	
		ИмяКоллекцииОбъекта = Лев(ИмяКоллекции, Точка - 1);  
		
		Если Дополнительно = Неопределено Тогда  
			Дополнительно 	= Новый Структура;
			Кэш 			= Новый Структура;
			Дополнительно.Вставить("Кэш", Кэш);	
		Иначе 		
			Дополнительно.Свойство("Кэш", Кэш);			
		КонецЕсли;
		
		Если ОпределитьПараметрыКоллекции(ИмяКоллекцииОбъекта, Картинка, ЭтоСсылочныйТип, ЭтоРегистр) Тогда	
			
			СтрокаМетаданных = Неопределено;
			
			Если Кэш.Свойство(ИмяКоллекцииОбъекта, СтрокаМетаданных) Тогда 
				Результат = СтрокаМетаданных;	
				Результат.КоллекцияМетаданных.Добавить(КоллекцияМетаданных);
			Иначе
				
				Результат 						= Таблица.Добавить();	
				Результат.ИмяКоллекции 			= ИмяКоллекцииОбъекта;
				Результат.Картинка 				= Картинка;
				Результат.ЭтоСсылочныйТип 		= ЭтоСсылочныйТип;
				Результат.ЭтоРегистр 			= ЭтоРегистр;
				Результат.КоллекцияМетаданных 	= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КоллекцияМетаданных);  
				
				Кэш.Вставить(ИмяКоллекцииОбъекта, Результат);	
				
			КонецЕсли; 			 			
		
		КонецЕсли;     		
		
	Иначе   	
		
		Если ОпределитьПараметрыКоллекции(ИмяКоллекции, Картинка, ЭтоСсылочныйТип, ЭтоРегистр) Тогда
			
			Результат 						= Таблица.Добавить();
			Результат.ИмяКоллекции 			= ИмяКоллекции;
			Результат.Картинка 				= Картинка;
			Результат.ЭтоСсылочныйТип 		= ЭтоСсылочныйТип;
			Результат.ЭтоРегистр 			= ЭтоРегистр;
			Результат.КоллекцияМетаданных 	= КоллекцияМетаданных;
			
		КонецЕсли;		
		
	КонецЕсли; 	
	
	Возврат Результат;
	
КонецФункции       

&НаСервереБезКонтекста
Функция ОпределитьПараметрыКоллекции(ИмяКоллекции, Картинка, ЭтоСсылочныйТип, ЭтоРегистр)
	
	Результат 		= Истина;     
	ЭтоРегистр 		= Ложь; 
	ЭтоСсылочныйТип = Ложь;
	
	Если ИмяКоллекции = "Справочники" ИЛИ ИмяКоллекции = "Справочник" Тогда   
		ИмяКоллекции 	= "Справочники";
		Картинка 		= БиблиотекаКартинок.Справочник;
		ЭтоСсылочныйТип = Истина;  
	ИначеЕсли ИмяКоллекции = "Перечисления" ИЛИ ИмяКоллекции = "Перечисление" Тогда
		ИмяКоллекции 	= "Перечисления";
		Картинка 		= БиблиотекаКартинок.Перечисление;
		ЭтоСсылочныйТип = Истина;  	
	ИначеЕсли ИмяКоллекции = "Документы" ИЛИ ИмяКоллекции = "Документ" Тогда 
		ИмяКоллекции 	= "Документы";
		Картинка 		= БиблиотекаКартинок.Документ; 	
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ИмяКоллекции = "ПланыВидовХарактеристик" ИЛИ ИмяКоллекции = "ПланВидовХарактеристик" Тогда 
		ИмяКоллекции 	= "ПланыВидовХарактеристик";
		Картинка 		= БиблиотекаКартинок.ПланВидовХарактеристик;
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ИмяКоллекции = "ПланыСчетов" ИЛИ ИмяКоллекции = "ПланСчетов" Тогда 
		ИмяКоллекции 	= "ПланыСчетов";
		Картинка 		= БиблиотекаКартинок.ПланСчетов;
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ИмяКоллекции = "ПланыВидовРасчета" ИЛИ ИмяКоллекции = "ПланВидовРасчета" Тогда 
		ИмяКоллекции 	= "ПланыВидовРасчета";
		Картинка 		= БиблиотекаКартинок.ПланВидовРасчета;
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ИмяКоллекции = "БизнесПроцессы" ИЛИ ИмяКоллекции = "БизнесПроцесс" Тогда 	
		ИмяКоллекции 	= "БизнесПроцессы";
		Картинка 		= БиблиотекаКартинок.БизнесПроцесс;
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ИмяКоллекции = "Задачи" ИЛИ ИмяКоллекции = "Задача" Тогда 
		ИмяКоллекции 	= "Задачи";
		Картинка		= БиблиотекаКартинок.Задача;
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ИмяКоллекции = "ПланыОбмена" ИЛИ ИмяКоллекции = "ПланОбмена" Тогда 
		ИмяКоллекции 	= "ПланыОбмена";
		Картинка 		= БиблиотекаКартинок.ПланОбмена;
		ЭтоСсылочныйТип = Истина;
		
	ИначеЕсли ИмяКоллекции = "РегистрыСведений" ИЛИ ИмяКоллекции = "РегистрСведений" Тогда 
		ИмяКоллекции 	= "РегистрыСведений";
		Картинка 		= БиблиотекаКартинок.РегистрСведений;	
		ЭтоРегистр 		= Истина;
	ИначеЕсли ИмяКоллекции = "РегистрыНакопления" ИЛИ ИмяКоллекции = "РегистрНакопления" Тогда 	 
		ИмяКоллекции 	= "РегистрыНакопления";
		Картинка 		= БиблиотекаКартинок.РегистрНакопления;
		ЭтоРегистр 		= Истина;
	ИначеЕсли ИмяКоллекции = "РегистрыБухгалтерии" ИЛИ ИмяКоллекции = "РегистрБухгалтерии" Тогда
		ИмяКоллекции 	= "РегистрыБухгалтерии";
		Картинка 		= БиблиотекаКартинок.РегистрБухгалтерии;
		ЭтоРегистр 		= Истина;
	ИначеЕсли ИмяКоллекции = "РегистрыРасчета" ИЛИ ИмяКоллекции = "РегистрРасчета" Тогда 
		ИмяКоллекции 	= "РегистрыРасчета";
		Картинка 		= БиблиотекаКартинок.РегистрРасчета; 
		ЭтоРегистр 		= Истина;
		
	ИначеЕсли ИмяКоллекции = "ОбщиеФормы" Тогда  		
		Картинка = БиблиотекаКартинок.Форма;
		                      
	ИначеЕсли ИмяКоллекции = "РегламентныеЗадания" Тогда  
		ИмяКоллекции 	= "РегламентныеЗадания";
		Картинка 		= БиблиотекаКартинок.РегламентныеЗадания; 
		
	Иначе
		Результат = Ложь;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции



&НаСервереБезКонтекста
Функция ПолноеИмяМетаданных(ТипМетаданных, ИмяМетаданных) 	
	
	Возврат Метаданные[ТипМетаданных][ИмяМетаданных].ПолноеИмя();  
	
КонецФункции

&НаСервере
Процедура СформироватьДеревоМетаданныхИБ(НаборыМетаданных, Ограничения, МассивОтмеченных, ДополнительныеПараметры = Неопределено)
	                   
	КорневыеЭлементы 		= ДеревоМетаданных.ПолучитьЭлементы(); 	
	ТипНабораМетаданных		= ТипЗнч(НаборыМетаданных); 
	ЕстьОграничения			= ЗначениеЗаполнено(Ограничения);
	ВыборФорм				= ДополнительныеПараметры <> Неопределено И ДополнительныеПараметры.Свойство("ВыборФорм");
	
	Если ТипНабораМетаданных = Тип("Число") И НЕ ЕстьОграничения Тогда
		Если НаборыМетаданных = 1 Тогда
			МассивИменМетаданных = ПолучитьМетаданныеКонфигурации(Истина, Ложь, ДополнительныеПараметры);	
		ИначеЕсли НаборыМетаданных = 2 Тогда
			МассивИменМетаданных = ПолучитьМетаданныеКонфигурации(Ложь, Истина, ДополнительныеПараметры);
		Иначе
			МассивИменМетаданных = ПолучитьМетаданныеКонфигурации(Истина, Истина, ДополнительныеПараметры);
		КонецЕсли; 
	ИначеЕсли ТипНабораМетаданных = Тип("Массив") Тогда
		МассивИменМетаданных = НаборыМетаданных;	
	Иначе   		
		Если ЕстьОграничения Тогда
			
			ЗначениеОтбора = Неопределено;
			
			Если Ограничения.Свойство("ПоСоставуПланаОбмена", ЗначениеОтбора) Тогда
				МассивИменМетаданных = ПолучитьМетаданныеИзСоставаПланаОбмена(НаборыМетаданных, ЗначениеОтбора);	
			ИначеЕсли Ограничения.Свойство("ПоКоллекцииМетаданных", ЗначениеОтбора) Тогда 
				
				Дополнительно 		 = Неопределено;
				МассивИменМетаданных = ИнициализироватьТаблицуМетаданных();	
				             										 					
				Если ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
					МассивОтбор = ЗначениеОтбора;	
				Иначе
					МассивОтбор = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначениеОтбора);	
				КонецЕсли; 
				
				Для каждого Ит Из МассивОтбор Цикл
					
					Если СтрНайти(Ит, ".") > 0 Тогда  
						Коллекция = Метаданные.НайтиПоПолномуИмени(Ит);	
					Иначе
						Коллекция = Метаданные[Ит];		
					КонецЕсли;	
					
					ДобавитьСтрокуКоллекцииМетаданных(МассивИменМетаданных, Ит, Коллекция, Дополнительно);
					
				КонецЦикла; 			
				
			КонецЕсли;
			
		Иначе
			МассивИменМетаданных = ПолучитьМетаданныеКонфигурации(Истина, Истина, ДополнительныеПараметры);	
		КонецЕсли; 			
	КонецЕсли;
	
	Если ВыборФорм Тогда 
		
		КартинкаФормы 			= БиблиотекаКартинок.Форма;    
		ИмяМетаданныеГруппа    	= "ОбщиеФормы";
		
		Для каждого Ит Из МассивИменМетаданных Цикл
			
			КоличествоОтмеченныхВсего = 0;
			Если ЗначениеЗаполнено(Ограничения) Тогда
				КоллекцияМетаданных = Ит.КоллекцияМетаданных;	
			Иначе 		
				КоллекцияМетаданных = Метаданные[Ит.ИмяКоллекции];			  				
			КонецЕсли;   		
			
			Если КоллекцияМетаданных.Количество() > 0 Тогда 			
				
				УзелГруппы 					= КорневыеЭлементы.Добавить();
				УзелГруппы.Представление 	= ТРег(Ит.ИмяКоллекции);  			  
				УзелГруппы.Картинка			= Ит.Картинка;
				ПодчиненныеУзлы 			= УзелГруппы.ПолучитьЭлементы();			
				
				Для Каждого ОбъектМетаданных Из КоллекцияМетаданных Цикл
					Если ПравоДоступа("Просмотр", ОбъектМетаданных) Тогда  						
						
						УзелОбъекта 				= ПодчиненныеУзлы.Добавить(); 												
						УзелОбъекта.Представление 	= ОбъектМетаданных.Синоним; 					
						УзелОбъекта.Картинка		= Ит.Картинка; 
						
						Если Ит.ИмяКоллекции = ИмяМетаданныеГруппа Тогда
							
							УзелОбъекта.ИмяМетаданных 			= ОбъектМетаданных.Имя;
							УзелОбъекта.ПолноеИмяМетаданных 	= ОбъектМетаданных.ПолноеИмя();
							УзелОбъекта.Представление 			= ОбъектМетаданных.Синоним + " [" + ОбъектМетаданных.Имя + "]";
							УзелОбъекта.Флаг					= МассивОтмеченных.Найти(УзелОбъекта.ПолноеИмяМетаданных) <> Неопределено;  
							
							КоличествоОтмеченныхВсего = КоличествоОтмеченныхВсего + ?(УзелОбъекта.Флаг, 1, 0);
							
						Иначе
							
							УзлыФорм 				= УзелОбъекта.ПолучитьЭлементы();
							КоличествоОтмеченных 	= 0;
							
							Для каждого МетаданныеФормы Из ОбъектМетаданных.Формы Цикл 								
								
								Узел 						= УзлыФорм.Добавить(); 
								Узел.ПолноеИмяМетаданных 	= МетаданныеФормы.ПолноеИмя();
								Узел.Представление 			= МетаданныеФормы.Синоним + " [" + МетаданныеФормы.Имя + "]";
								Узел.Флаг					= МассивОтмеченных.Найти(Узел.ПолноеИмяМетаданных) <> Неопределено;
								Узел.ИмяМетаданных 			= МетаданныеФормы.Имя;
								Узел.Картинка				= КартинкаФормы;
								
								КоличествоОтмеченных 	  = КоличествоОтмеченных + ?(Узел.Флаг, 1, 0);
								КоличествоОтмеченныхВсего = КоличествоОтмеченныхВсего + ?(Узел.Флаг, 1, 0);
								
							КонецЦикла; 
							
							УзелОбъекта.КоличествоОтмеченных 	= КоличествоОтмеченных;
							УзелОбъекта.Флаг 					= КоличествоОтмеченных > 0; 
						
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла;
				
				УзелГруппы.КоличествоОтмеченных 	= КоличествоОтмеченныхВсего;
				УзелГруппы.Флаг 					= КоличествоОтмеченныхВсего > 0;	
				
				Элементы.ТипТаблицы.СписокВыбора.Добавить(Ит.ИмяКоллекции, Ит.ИмяКоллекции, Ложь, Ит.Картинка); 			
				
			КонецЕсли;  		
			
		КонецЦикла;		
		
	Иначе	
	
		Для каждого Ит Из МассивИменМетаданных Цикл
			                          		
			КоличествоОтмеченныхВсего = 0;
			
			Если ТипЗнч(Ит) = Тип("Строка") Тогда 
				
				Картинка 			= Неопределено;
				ИмяКоллекции 		= Ит;
				ЭтоСсылочныйТип 	= Ложь;  
				ЭтоРегистр 			= Ложь; 				
				
				ОпределитьПараметрыКоллекции(ИмяКоллекции, Картинка, ЭтоСсылочныйТип, ЭтоРегистр); 			
				
			Иначе
				Картинка 			= Ит.Картинка;
				ИмяКоллекции 		= Ит.ИмяКоллекции;
				ЭтоСсылочныйТип 	= Ит.ЭтоСсылочныйТип;  
				ЭтоРегистр 			= Ит.ЭтоРегистр;				
			КонецЕсли; 	
			
			Если ЗначениеЗаполнено(Ограничения) Тогда
				КоллекцияМетаданных = Ит.КоллекцияМетаданных;	
			Иначе  			
				КоллекцияМетаданных = Метаданные[ИмяКоллекции];			
			КонецЕсли;   		                   
			
			Если КоллекцияМетаданных.Количество() > 0 Тогда 			
				
				УзелГруппы 					= КорневыеЭлементы.Добавить();				
				УзелГруппы.Представление 	= ТРег(ИмяКоллекции);
				УзелГруппы.ИмяМетаданных 	= ИмяКоллекции;  
				УзелГруппы.Картинка			= Картинка;
				ПодчиненныеУзлы 			= УзелГруппы.ПолучитьЭлементы();			
				
				Для Каждого ОбъектМетаданных Из КоллекцияМетаданных Цикл
					Если ПравоДоступа("Просмотр", ОбъектМетаданных) Тогда  				
						
						ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
						
						Узел 						= ПодчиненныеУзлы.Добавить(); 
						Узел.ПолноеИмяМетаданных 	= ПолноеИмя;
						
						Если ЭтоСсылочныйТип Тогда
							Узел.Тип = СтрЗаменить(Узел.ПолноеИмяМетаданных, ".", "Ссылка.");	
						КонецЕсли;
						
						Узел.Представление 			= ОбъектМетаданных.Синоним + " [" + ОбъектМетаданных.Имя + "]";
						Узел.Флаг					= МассивОтмеченных.Найти(ПолноеИмя) <> Неопределено ИЛИ МассивОтмеченных.Найти(Узел.Тип) <> Неопределено;
						Узел.Картинка				= Картинка;
						Узел.ИмяМетаданных 			= ОбъектМетаданных.Имя; 									
						
						КоличествоОтмеченныхВсего = КоличествоОтмеченныхВсего + ?(Узел.Флаг, 1, 0);
						
					КонецЕсли;
				КонецЦикла;
				
				УзелГруппы.КоличествоОтмеченных 	= КоличествоОтмеченныхВсего;
				УзелГруппы.Флаг 					= КоличествоОтмеченныхВсего > 0;	
				
				Элементы.ТипТаблицы.СписокВыбора.Добавить(ИмяКоллекции, ИмяКоллекции, Ложь, Картинка); 			
				
			КонецЕсли;  		
			
		КонецЦикла; 
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнициализироватьТаблицуМетаданных()	
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИмяКоллекции");
	Результат.Колонки.Добавить("Картинка");
	Результат.Колонки.Добавить("ЭтоСсылочныйТип");
	Результат.Колонки.Добавить("ЭтоРегистр");
	Результат.Колонки.Добавить("КоллекцияМетаданных");
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВидОбъектаПоПолномуИмени(ПолноеИмя, ЭтоСсылочныйТип)
	           	
	Перем КлассОМ, ИмяОМ, Результат;
	
	ЧастиИмени = СтрРазделить(ПолноеИмя, ".");
	
	Если ЧастиИмени.Количество() >= 2 Тогда
		КлассОМ = ЧастиИмени[0];
		ИмяОМ  = ЧастиИмени[1];
	КонецЕсли;
	
	Если      ВРег(КлассОМ) = "ПЛАНОБМЕНА" Тогда
		Результат = "ПланыОбмена";
		ЭтоСсылочныйТип = Истина;
		
	ИначеЕсли ВРег(КлассОМ) = "СПРАВОЧНИК" Тогда
		Результат = "Справочники";
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ВРег(КлассОМ) = "ДОКУМЕНТ" Тогда
		Результат = "Документы";
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ВРег(КлассОМ) = "ЖУРНАЛДОКУМЕНТОВ" Тогда
		Результат = "ЖурналыДокументов";
		
	ИначеЕсли ВРег(КлассОМ) = "ПЕРЕЧИСЛЕНИЕ" Тогда
		Результат = "Перечисления";
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ВРег(КлассОМ) = "ОТЧЕТ" Тогда
		Результат = "Отчеты";
		
	ИначеЕсли ВРег(КлассОМ) = "ОБРАБОТКА" Тогда
		Результат = "Обработки";
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Результат = "ПланыВидовХарактеристик";
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНСЧЕТОВ" Тогда
		Результат = "ПланыСчетов";
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Результат = "ПланыВидовРасчета";
		ЭтоСсылочныйТип = Ложь;
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРСВЕДЕНИЙ" Тогда
		Результат = "РегистрыСведений";
		ЭтоСсылочныйТип = Ложь;

	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРНАКОПЛЕНИЯ" Тогда
		Результат = "РегистрыНакопления";
		ЭтоСсылочныйТип = Ложь;

	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРБУХГАЛТЕРИИ" Тогда
		Результат = "РегистрыБухгалтерии";
		ЭтоСсылочныйТип = Ложь;

	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРРАСЧЕТА" Тогда
		ЭтоСсылочныйТип = Ложь;

		Если ЧастиИмени.Количество() = 2 Тогда
			// Регистр расчета
			Результат = "РегистрыРасчета";
		Иначе
			КлассПодчиненногоОМ = ЧастиИмени[2];
			ИмяПодчиненногоОМ = ЧастиИмени[3];
			Если ВРег(КлассПодчиненногоОМ) = "ПЕРЕРАСЧЕТ" Тогда
				// Перерасчет
				Попытка                              
					Результат = "ПерерасчетыРегистровРасчета";    					
				Исключение
					Результат = Неопределено;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВРег(КлассОМ) = "БИЗНЕСПРОЦЕСС" Тогда
		Результат = "БизнесПроцессы";
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ВРег(КлассОМ) = "ЗАДАЧА" Тогда
		Результат = "Задачи";
		ЭтоСсылочныйТип = Истина;
	ИначеЕсли ВРег(КлассОМ) = "КОНСТАНТА" Тогда
		Результат = "Константы";
		ЭтоСсылочныйТип = Ложь;

	ИначеЕсли ВРег(КлассОМ) = "ПОСЛЕДОВАТЕЛЬНОСТЬ" Тогда
		Результат = "Последовательности";
		ЭтоСсылочныйТип = Ложь;

	КонецЕсли;
	
	Возврат Результат;  	
		
КонецФункции

#КонецОбласти 